[
  {
    "character": "Albedo",
    "talents": {
      "normalAttack": {
        "name": "Favonius Bladework - Weiss",
        "description": "Normal Attack\nPerform up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/albedo_attack.png"
      },
      "elementalSkill": {
        "name": "Abiogenesis: Solar Isotoma",
        "description": "Albedo creates a Solar Isotoma using alchemy, which deals AoE Geo DMG on appearance.\nSolar Isotoma\n\nWhen enemies within the Solar Isotoma zone are hit, the Solar Isotoma will generate Transient Blossoms which deal AoE Geo DMG. DMG dealt scales off Albedo's DEF.\nTransient Blossoms can only be generated once every 2s.\nWhen a character is located at the locus of the Solar Isotoma, the Solar Isotoma will accumulate Geo power to form a crystallized platform that lifts the character up to a certain height. Only one crystallized platform can exist at a time.\nSolar Isotoma is considered a Geo construct.\n\nHold to designate the location of the skill.",
        "icon": "/img/talents/albedo_skill.png"
      },
      "elementalBurst": {
        "name": "Rite of Progeniture: Tectonic Tide",
        "description": "Under Albedo's command, Geo crystals surge and burst forth, dealing AoE Geo DMG in front of him.\nIf a Solar Isotoma created by Albedo himself is on the field, 7 Fatal Blossoms will be generated in the Solar Isotoma field, bursting violently into bloom and dealing AoE Geo DMG\nTecotonic Tide DMG and Fatal Blossom DMG will not generate Transient Blossoms.",
        "icon": "/img/talents/albedo_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Calcite Might",
          "description": "Transient Blossoms generated by Abiogenesis: Solar Isotoma deal 25% more DMG to enemies whose HP is below 50%.",
          "icon": "/img/talents/albedo_passive1.png"
        },
        {
          "name": "Homuncular Nature",
          "description": "Using Rite of Progeniture: Tectonic Tide increases the Elemental Mastery of nearby party members by 125 for 10s.",
          "icon": "/img/talents/albedo_passive2.png"
        },
        {
          "name": "Flash of Genius",
          "description": "When Albedo crafts Weapon Ascension Materials, he has a 10% chance to receive double the product.",
          "icon": "/img/talents/albedo_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Alhaitham",
    "talents": {
      "normalAttack": {
        "name": "Abductive Reasoning",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/alhaitham_attack.png"
      },
      "elementalSkill": {
        "name": "Universality: An Elaboration on Form",
        "description": "Rushes forward, dealing Dendro DMG to nearby opponents when the rush ends, causing a Chisel-Light Mirror to form.\nHolding this skill will cause it to behave differently.\nHold\nEnters Aiming Mode to adjust the direction of Alhaitham's rush attack.\nChisel-Light Mirror\nWhen this skill is unleashed, Alhaitham will generate 1 Chisel-Light Mirror. If there are no Mirrors at this time, he will generate 1 additional Mirror.\nWhen he possesses Chisel-Light Mirrors, Alhaitham's Normal, Charged, and Plunging Attacks will be converted to Dendro DMG. This cannot be overridden.\nWhen attacks of the aforementioned kinds hit opponents, the Chisel-Light Mirrors will unleash a Projection Attack that deals AoE Dendro DMG based on the number of Mirrors on the field.\nA total of 3 Chisel-Light Mirrors can exist at once.\nThe Chisel-Light Mirrors will disappear one after the other over time, and will all disappear when Alhaitham leaves the field.",
        "icon": "/img/talents/alhaitham_skill.png"
      },
      "elementalBurst": {
        "name": "Particular Field: Fetters of Phenomena",
        "description": "Creates a Particular Binding Field and deals multiple instances of AoE Dendro DMG.\nIf Chisel-Light Mirrors exist when this ability is unleashed, all such Mirrors will be consumed and increase the number of DMG instances dealt.\n2s after this ability is unleashed, if 0/1/2/3 Mirrors were consumed, Alhaitham will generate 3/2/1/0 new Mirrors in turn.",
        "icon": "/img/talents/alhaitham_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Four-Causal Correction",
          "description": "When Alhaitham's Charged or Plunging Attacks hit opponents, they will generate 1 Chisel-Light Mirror. This effect can be triggered once every 12s.",
          "icon": "/img/talents/alhaitham_passive1.png"
        },
        {
          "name": "Mysteries Laid Bare",
          "description": "Each point of Alhaitham's Elemental Mastery will increase the DMG dealt by Projection Attacks and Particular Field: Fetters of Phenomena by 0.1%.\nThe maximum DMG increase this way for both these abilities is 100%.",
          "icon": "/img/talents/alhaitham_passive2.png"
        },
        {
          "name": "Law of Reductive Overdetermination",
          "description": "When Alhaitham crafts Weapon Ascension Materials, he has a 10% chance to receive double the product.",
          "icon": "/img/talents/alhaitham_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Aloy",
    "talents": {
      "normalAttack": {
        "name": "Rapid Fire",
        "description": "Normal Attack\nPerform up to 4 consecutive shots with a bow.\nCharged Attack\nPerform a more precise Aimed Shot with increased DMG.\nWhile aiming, biting frost will accumulate on the arrowhead. A fully charged frost arrow will deal Cryo DMG\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/aloy_attack.png"
      },
      "elementalSkill": {
        "name": "Frozen Wilds",
        "description": "Aloy throws a Freeze Bomb in the targeted direction and triggers an explosion, dealing Cryo DMG. After it explodes, the Freeze Bomb will split up into many Chillwater Bomblets that explode on contact with opponents or after a short delay, dealing Cryo DMG.\nWhen a Freeze Bomb or Chillwater Bomblet hits an opponent, the opponent's ATK is decreased and Aloy receives 1 Coil stack.\nAloy can gain up to 1 Coil stack every 0.1s.\n\nCoil\nEach stack increases Aloy's Normal Attack DMG.\nWhen Aloy has 4 Coil stacks, all stacks of Coil are cleared. She then enters the Rushing Ice state, which further increases the DMG dealt by her Normal Attacks and converts her Normal Attack DMG to Cryo DMG.",
        "icon": "/img/talents/aloy_skill.png"
      },
      "elementalBurst": {
        "name": "Prophecies of Dawn",
        "description": "Aloy throws a Power Cell filled with Cryo in the targeted direction, then detonates it with an arrow, dealing AoE Cryo Damage.",
        "icon": "/img/talents/aloy_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Combat Override",
          "description": "When Aloy receives the Coil effect from Frozen Wilds, her ATK is increased by 16%, while nearby party members' ATK is increased by 8%. This effect lasts 10s.",
          "icon": "/img/talents/aloy_passive1.png"
        },
        {
          "name": "Strong Strike",
          "description": "When Aloy is in the Rushing Ice state conferred by Frozen Wilds, her Cryo DMG Bonus increases by 3.5% every 1s. A maximum Cryo DMG Bonus increase of 35% can be gained in this way.",
          "icon": "/img/talents/aloy_passive2.png"
        },
        {
          "name": "Easy Does It",
          "description": "When Aloy is in the party, animals who produce Fowl, Raw Meat, or Chilled Meat will not be startled when party members approach them.",
          "icon": "/img/talents/aloy_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Amber",
    "talents": {
      "normalAttack": {
        "name": "Sharpshooter",
        "description": "Normal Attack\nPerforms up to 5 consecutive shots with a bow.\nCharged Attack\nPerform a more precise Aimed Shot with increased DMG.\n\nWhile aiming, flames accumulates on the arrowhead. A fully charged flaming arrow will deal Pyro DMG.\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/amber_attack.png"
      },
      "elementalSkill": {
        "name": "Explosive Puppet",
        "description": "Baron Bunny\n\nContinuously taunts the enemy, drawing their fire.\nBaron Bunny's HP scales with Amber's Max HP.\nWhen destroyed or when its timer expires, Baron Bunny explodes, dealing AoE Pyro DMG.\n\nHold\nAdjusts the throwing direction of Baron Bunny.\n\nThe longer the button is held, the further the throw.",
        "icon": "/img/talents/amber_skill.png"
      },
      "elementalBurst": {
        "name": "Fiery Rain",
        "description": "Fires of a shower of arrows, dealing continuous AoE Pyro DMG.",
        "icon": "/img/talents/amber_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Every Arrow Finds Its Target",
          "description": "Increases the CRIT Rate of Fiery Rain by 10% and widens its AoE by 30%.",
          "icon": "/img/talents/amber_passive1.png"
        },
        {
          "name": "Precise Shot",
          "description": "Aimed Shot hits on weak spots increase Base ATK by 15% for 10s.",
          "icon": "/img/talents/amber_passive2.png"
        },
        {
          "name": "Gliding Champion",
          "description": "Decreases all party members' gliding Stamina Consumption by 20%.\nThe greatest effect out of all Talents of the same type prevails.",
          "icon": "/img/talents/amber_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Arataki Itto",
    "talents": {
      "normalAttack": {
        "name": "Fight Club Legend",
        "description": "Normal Attack\nPerform up to 4 consecutive strikes.\nCharged Attack\nWhen holding to perform a Charged Attack, Itto unleashes a series of Arataki Kesagiri slashes without consuming Stamina. Instead, each Arataki Kesagiri slash consumes 1 stack of Superlative Superstrength. When the final stack is consumed, Itto delivers a powerful final slash. If no stacks of Superlative Superstrength are available, Itto will perform a single Saichimonji Slash.\nPlunging Attack\nPlunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/arataki_itto_attack.png"
      },
      "elementalSkill": {
        "name": "Masatsu Zetsugi: Akaushi Burst!",
        "description": "Hurls Ushi, the young akaushi bull and auxiliary member of the Arataki Gang, dealing Geo DMG to opponents on hit. When Ushi hits opponents, Arataki Itto gains 1 stack of Superlative Superstrength.",
        "icon": "/img/talents/arataki_itto_skill.png"
      },
      "elementalBurst": {
        "name": "Royal Descent: Behold, Itto the Evil!",
        "description": "Time to show 'em the might of the Arataki Gang! For a time, Itto lets out his inner Raging Oni King, wielding his Oni King's Kanabou in battle.",
        "icon": "/img/talents/arataki_itto_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Woodchuck Chucked",
          "description": "When a party member uses attacks to obtain wood from a tree, they have a 25% chance to get an additional log of wood.",
          "icon": "/img/talents/arataki_itto_passive1.png"
        },
        {
          "name": "Arataki Ichiban",
          "description": "When Arataki Itto uses consecutive Arataki Kesagiri, he obtains the following effects:\n - Each slash increases the ATK SPD of the next slash by 10%. Max ATK SPD increase is 30%.\n - Increases his resistance to interruption.\nThese effects will be cleared once he stops performing consecutive slashes.",
          "icon": "/img/talents/arataki_itto_passive2.png"
        },
        {
          "name": "Bloodline of the Crimson Oni",
          "description": "Arataki Kesagiri DMG is increased by 35% of Arataki Itto's DEF.",
          "icon": "/img/talents/arataki_itto_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Arlecchino",
    "talents": {
      "normalAttack": {
        "name": "Normal Attack: Invitation to a Beheading",
        "description": "Normal Attack\nPerforms up to 6 consecutive spear strikes.\nCharged Attack\nConsumes a fixed amount of Stamina, dashing toward a nearby opponent and cleaving once.\nContinuously holding this button will cause Arlecchino to consume Stamina and engage in up to 5s of high-speed movement.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.\nMasque of the Red Death\nWhen Arlecchino has a Bond of Life equal to or greater than 30% of her Max HP, she will enter the \"Masque of the Red Death\" state, where her Normal, Charged, and Plunging Attacks will be converted to deal Pyro DMG. This cannot be overridden.\nWhen in the \"Masque of the Red Death\" state, Arlecchino's Normal Attacks will deal extra DMG to opponents on hit that scales off her ATK multiplied by a certain ratio of her current Bond of Life percentage. This will consume 7.5% of said current Bond of Life. Her Bond of Life can be consumed this way every 0.03s. When her Bond of Life is consumed in this manner, All Is Ash's CD will decrease by 0.8s.",
        "icon": "/img/talents/arlecchino_attack.png"
      },
      "elementalSkill": {
        "name": "All Is Ash",
        "description": "Summons forth Balemoon Bloodfire, dealing Pyro DMG to multiple nearby opponents and performing a dash-cleave against one of them, dealing AoE Pyro DMG.\nOpponents hit by the aforementioned attack will have a Blood-Debt Directive applied to them.\nBlood-Debt Directive\nLasts 30s. Every 5s, it will deal 1 instance of Pyro DMG to the opponent. Max 2 instances. This DMG will be considered Elemental Skill DMG.\nWhen Arlecchino uses a Charged Attack or her Elemental Burst, Balemoon Rising, she will absorb and clear nearby Blood-Debt Directives. Each Directive absorbed grants her a Bond of Life worth 65% of her Max HP.\nThe maximum value of the Bond of Life she can be granted through Blood-Debt Directives within 35s after using her Elemental Skill is 145% of her Max HP. Using the Elemental Skill again during this duration will restart the count on duration and the limit on the value of Bond of Life she may gain from Blood-Debt Directives.",
        "icon": "/img/talents/arlecchino_skill.png"
      },
      "elementalBurst": {
        "name": "Balemoon Rising",
        "description": "Arlecchino's great wing of Balemoon Bloodfire beats as she absorbs and clears Blood-Debt Directives around her. She deals AoE Pyro DMG before clearing the CD of All Is Ash and healing herself. The healing is based on her Bond of Life value and ATK.",
        "icon": "/img/talents/arlecchino_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Agony Alone May Be Repaid",
          "description": "Blood-Debt Directives have the following characteristics:\nArlecchino will be granted a Bond of Life worth 130% of her Max HP when an opponent to which she herself applied a Directive is defeated.\n5s after a Directive is applied, it will be upgraded to a Blood-Debt Due. When absorbed, it will instead grant Arlecchino a Bond of Life worth 130%.\nA Bond of Life created in the aforementioned ways cannot exceed the original limit on the value of Bonds of Life obtained through All Is Ash.",
          "icon": "/img/talents/arlecchino_passive1.png"
        },
        {
          "name": "Strength Alone Can Defend",
          "description": "Arlecchino gains 1% All Elemental and Physical RES for every 100 ATK she has in excess of 1,000. The maximum RES increase she can gain this way for each is 20%.",
          "icon": "/img/talents/arlecchino_passive2.png"
        },
        {
          "name": "The Balemoon Alone May Know",
          "description": "While in combat, Arlecchino gains a 40% Pyro DMG Bonus and can only be healed through Balemoon Rising.",
          "icon": "/img/talents/arlecchino_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kamisato Ayaka",
    "talents": {
      "normalAttack": {
        "name": "Kamisato Art - Kabuki",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash a flurry of sword ki.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kamisato_ayaka_attack.png"
      },
      "elementalSkill": {
        "name": "Kamisato Art: Hyouka",
        "description": "Summons blooming ice to launch nearby opponents, dealing AoE Cryo DMG.",
        "icon": "/img/talents/kamisato_ayaka_skill.png"
      },
      "elementalBurst": {
        "name": "Kamisato Art: Soumetsu",
        "description": "Summons forth a snowstorm with flawless poise, unleasing a Frostflake Seki no To that moves forward continously.\nFrostflake Seki no To\nA storm of whirling icy winds that slashes repeatedly at every enemy it touches, dealing Cryo DMG.\nThe snowstorm explodes after its duration ends, dealing AoE Cryo DMG.",
        "icon": "/img/talents/kamisato_ayaka_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Amatsumi Kunitsumi Sanctification",
          "description": "After using Kamisato Art: Hyouka, Kamisato Ayaka's Normal and Charged attacks deal 30% increased DMG for 6s.",
          "icon": "/img/talents/kamisato_ayaka_passive1.png"
        },
        {
          "name": "Kanten Senmyou Blessing",
          "description": "When the Cryo application at the end of Kamisato Art: Senho hits an opponent, Kamisato Ayaka gains the following effects:\nRestores 10 Stamina\nGains 18% Cryo DMG Bonus for 10s.",
          "icon": "/img/talents/kamisato_ayaka_passive2.png"
        },
        {
          "name": "Fruits of Shinsa",
          "description": "When Ayaka crafts Weapon Ascension Materials, she has a 10% chance to receive double the product.",
          "icon": "/img/talents/kamisato_ayaka_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kamisato Ayato",
    "talents": {
      "normalAttack": {
        "name": "Kamisato Art - Marobashi",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to dash forward and perform an iai.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kamisato_ayato_attack.png"
      },
      "elementalSkill": {
        "name": "Kamisato Art: Kyouka",
        "description": "Kamisato Ayato shifts positions and enters the Takimeguri Kanka state. After this shift, he will leave a watery illusion at his original location. After it is formed, the watery illusion will explode if opponents are nearby or after its duration ends, dealing AoE Hydro DMG\nTakimeguri Kanka\nIn this state, Kamisato Ayato uses his Shunsuiken to engage in blindingly fast attacks, causing DMG from his Normal Attacks to be converted into AoE Hydro DMG. This cannot be overridden. It also has the following properties:\nAfter a Shunsuiken attack hits an opponent, it will grant Ayato the Namisen effect, increasing the DMG dealt by Shunsuiken based on Ayato's current Max HP. The initial maximum number of Namisen stacks is 4, and 1 stack can be gained through Shunsuiken every 0.1s. This effect will be dispelled when Takimeguri Kanka ends.\nKamisato Ayato's resistance to interruption is increased.\nUnable to use Charged or Plunging Attacks.\nTakimeguri Kanka will be cleared when Ayato leaves the field. Using Kamisato Art: Kyouka again while in the Takimeguri Kanka state will reset and replace the pre-existing state.",
        "icon": "/img/talents/kamisato_ayato_skill.png"
      },
      "elementalBurst": {
        "name": "Kamisato Art: Suiyuu",
        "description": "Unveils a garden of purity that silences the cacophony within. While this space exists, Bloomwater Blades will constantly rain down and attack opponents within its AoE, dealing Hydro DMG and increasing the Normal Attack DMG of characters within.",
        "icon": "/img/talents/kamisato_ayato_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Kamisato Art: Mine Wo Matoishi Kiyotaki",
          "description": "Kamisato Art: Kyouka has the following properties:\nAfter it is used, Kamisato Ayato will gain 2 Namisen stacks.\nWhen the water illusion explodes, Ayato will gain a Namisen effect equal to the maximum number of stacks possible.",
          "icon": "/img/talents/kamisato_ayato_passive1.png"
        },
        {
          "name": "Kamisato Art: Michiyuku Hagetsu",
          "description": "If Kamisato Ayato is not on the field and his Energy is less than 40, he will regenerate 2 Energy for himself every second.",
          "icon": "/img/talents/kamisato_ayato_passive2.png"
        },
        {
          "name": "Kamisato Art: Daily Cooking",
          "description": "When Ayato cooks a dish perfectly, he has a 18% chance to receive an additional \"Suspicious\" dish of the same type.",
          "icon": "/img/talents/kamisato_ayato_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Baizhu",
    "talents": {
      "normalAttack": {
        "name": "The Classics of Acupuncture",
        "description": "Normal Attack\nPerforms up to 4 attacks that deal Dendro DMG to opponents in front of him.\nCharged Attack\nConsumes a certain amount of Stamina to deal AoE Dendro DMG to opponents in front of him after a short casting time.\nPlunging Attack\nCalling upon the might of Dendro, Baizhu plunges towards the ground from mid-air, damaging all opponents in his path. Deals AoE Dendro DMG upon impact with the ground.",
        "icon": "/img/talents/baizhu_attack.png"
      },
      "elementalSkill": {
        "name": "Universal Diagnosis",
        "description": "Controls a Gossamer Sprite that cruises and attacks nearby opponents, dealing Dendro DMG.\nAfter it performs 3 attacks or if there are no opponents nearby, the Sprite will return, healing all nearby party members based on Baizhu's Max HP.\nThose in the medical field who can read true signs of illness from false ones may even cure people before any symptoms can show.",
        "icon": "/img/talents/baizhu_skill.png"
      },
      "elementalBurst": {
        "name": "Holistic Revivification",
        "description": "Enters the Pulsing Clarity state, creating a Seamless Shield that absorbs Dendro DMG with 250% effectiveness.\nWhile in this state, Baizhu will generate a new Seamless Shield every 2.5s.\nThe Seamless Shield will heal your own active character based on Baizhu's Max HP and attack opponents by unleashing Spiritveins, dealing Dendro DMG under the following circumstances:\nWhen a character is under the protection of a Seamless Shield and a new Seamless Shield is generated.\nWhen the Seamless Shield's effects expire, or when it is shattered.\nIf you can perceive the heavens and the earth, defend against malignant auras with the flow of qi, and keep your mind clear, surely nothing can hinder you.",
        "icon": "/img/talents/baizhu_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Herbal Nourishment",
          "description": "When Baizhu is in the party, interacting with certain harvestable items will heal your current active character for 2.5% of Baizhu's Max HP.",
          "icon": "/img/talents/baizhu_passive1.png"
        },
        {
          "name": "Five Fortunes Forever",
          "description": "Baizhu gains different effects according to the current HP of your current active character:\nWhen their HP is less than 50%, Baizhu gains 20% Healing Bonus.\nWhen their HP is equal to or more than 50%, Baizhu gains 25% Dendro DMG Bonus.",
          "icon": "/img/talents/baizhu_passive2.png"
        },
        {
          "name": "All Things Are of the Earth",
          "description": "Characters who are healed by Seamless Shields will gain the Year of Verdant Favor effect: Each 1,000 Max HP that Baizhu possesses that does not exceed 50,000 will increase the Burning, Bloom, Hyperbloom, and Burgeon reaction DMG dealt by these characters by 2%, and will increase the DMG Bonus provided by Aggravate and Spread by 0.8%. This effect lasts 6s.",
          "icon": "/img/talents/baizhu_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Barbara",
    "talents": {
      "normalAttack": {
        "name": "Whisper of Water",
        "description": "Normal Attack\nPerform up to 4 water splashes attacks that deal Hydro DMG.\nCharged Attack\nConsumes a certain amount of Stamina to deal AoE Hydro DMG after a short casting time.\nPlunging Attack\nGathering the might of Hydro, Barbara plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Hydro DMG upon impact with the ground.",
        "icon": "/img/talents/barbara_attack.png"
      },
      "elementalSkill": {
        "name": "Let the Show Begin",
        "description": "Summons water droplets resembling musical notes that form a Melody Loop, dealing Hydro DMG to surrounding enemies and afflicting them with the Wet status.\nMelody Loop\n\nBarbara's Normal Attacks heal all party members and nearby allied characters for a certain amount of HP, which scales with Barbara's Max HP.\nHer Charged Attack generates 4 times the amount of healing.\nRegenerates a certain amount of the current character's HP at regular intervals.\nApplies the Wet status to the character and enemies who come in contact with them.\n",
        "icon": "/img/talents/barbara_skill.png"
      },
      "elementalBurst": {
        "name": "Shining Miracle",
        "description": "Heals friendly forces and all parties for a large amount of HP that scales with Barbara's Max HP.",
        "icon": "/img/talents/barbara_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Glorious Season",
          "description": "The Stamina Consumption of characters within Let the Show Begin's Melody Loop is reduced by 12%.",
          "icon": "/img/talents/barbara_passive1.png"
        },
        {
          "name": "Encore",
          "description": "When a character gains an Elemental Orb/Particle, the duration of Let the Show Begin's Melody Loop is extended by 1s.\nThe maximum extension is 5s.",
          "icon": "/img/talents/barbara_passive2.png"
        },
        {
          "name": "With My Whole Heart",
          "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product.",
          "icon": "/img/talents/barbara_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Beidou",
    "talents": {
      "normalAttack": {
        "name": "Oceanborne",
        "description": "Normal Attack\nPerforms up to 5 successive strikes.\nCharged Attack\nDrains Stamina over time to perform continuous slashes.\n\nAt end of the sequence, perform a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/beidou_attack.png"
      },
      "elementalSkill": {
        "name": "Tidecaller",
        "description": "Nothing to worry about. Should anyone raise a hand against her or her men, she will avenge it ten-fold with sword and thunder.\nPress\nAccumulating the power of lightning, Beidou swings her blade forward fiercely, dealing Electro DMG.\nHold\nLifts her weapon up as a shield. Max DMG absorbed scales off Beidou's Max HP.\n\nAttacks using the energy stored within the greatsword upon release or once this ability's duration expires, dealing Electro DMG. DMG dealt scales with the number of times Beidou is attacked in the skill's duration. The greatest DMG Bonus will be attained once this effect is triggered twice.\n\nThe shield possesses the following properties:\n\nHas 250% Electro DMG Absorption Efficiency.\nApplies the Electro element to Beidou upon activation.",
        "icon": "/img/talents/beidou_skill.png"
      },
      "elementalBurst": {
        "name": "Stormbreaker",
        "description": "Recalling her slaying of the great beast Haishan. Beidou calls upon that monstrous strength and the lightning to create a Thunderbeast's Targe around herself.\nThunderbeast's Target\n\nWhen Normal and Charged Attacks hit, they create a lightning discharge that can jump between enemies, dealing Electro DMG.\nIncreases the character's resistance to interruption, and decreases DMG taken.\n",
        "icon": "/img/talents/beidou_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Retribution",
          "description": "Counterattacking with Tidecaller at the precise moment when the character is hit grants the maximum DMG Bonus.",
          "icon": "/img/talents/beidou_passive1.png"
        },
        {
          "name": "Lightning Storm",
          "description": "Gain the following effects for 10s after unleashing Tidecaller with its maximum DMG Bonus:\nDMG dealt by Normal and Charged Attacks is increased by 15%. ATK SPD of Normal and Charged Attacks is increased by 15%.\nGreatly reduced delay before unleashing Charged Attacks.",
          "icon": "/img/talents/beidou_passive2.png"
        },
        {
          "name": "Conqueror of Tides",
          "description": "Decreases all party member's swimming Stamina consumption by 20%.",
          "icon": "/img/talents/beidou_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Bennett",
    "talents": {
      "normalAttack": {
        "name": "Strike of Fortune",
        "description": "Normal Attack\nPerform up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword swings.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/bennett_attack.png"
      },
      "elementalSkill": {
        "name": "Passion Overload",
        "description": "Bennett puts all his fire and passion for adventuring into his sword. Results may very based on how fired up he is.\nPress\nA single, swift flame strike that deals Pyro DMG.\nHold (Short)\nCharges up, resulting in different effects when unleashed based on the Charge Level.\n\nLevel 1: Strikes twice, dealing Pyro DMG and launching enemies.\nLevel 2: Unleashes 3 consecutive attacks that deal impressive Pyro DMG, but the last attack triggers an explosion that launches both Bennett and the enemy.\n\nBennett takes no damage from being launched.",
        "icon": "/img/talents/bennett_skill.png"
      },
      "elementalBurst": {
        "name": "Fantastic Voyage",
        "description": "Bennett leaps towards the enemy and performs a plunging attack, dealing Pyro DMG, creating an Inspiration Field.\nInspiration Field\n\nIf the health of a character in the circle is equal to or falls below 70%, their health will continuously regenerate. Regeneration scales based on Bennett's Max HP.\nIf the health of a character in the circle is higher than 70%, they gain an ATK Bonus that is based on Bennett's Base ATK.\nApplies the Pyro element to characters within the Field.\n",
        "icon": "/img/talents/bennett_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Rekindle",
          "description": "Decreases Passion Overload's CD by 20%.",
          "icon": "/img/talents/bennett_passive1.png"
        },
        {
          "name": "Fearnaught",
          "description": "When inside the area created by Fantastic Voyage, Passion Overload takes on the following effects:\nCD is reduced by 50%.\nBennett will not be launched by the effects of Charge Level 2.",
          "icon": "/img/talents/bennett_passive2.png"
        },
        {
          "name": "It Should Be Safe...",
          "description": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%.",
          "icon": "/img/talents/bennett_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Candace",
    "talents": {
      "normalAttack": {
        "name": "Gleaming Spear - Guardian Stance",
        "description": "Normal Attack\nPerforms up to 4 consecutive spear strikes.\n\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\n\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/candace_attack.png"
      },
      "elementalSkill": {
        "name": "Sacred Rite: Heron's Sanctum",
        "description": "Candace's fighting style is capable of warding off an entire tide of foes.\n\nTap\nRushes forward with her shield, dealing Hydro DMG to opponents in front of her.\n\nHold\nRaises her shield to block incoming attacks from nearby opponents, forming a barrier that absorbs DMG based on her Max HP and absorbs Hydro DMG 250% more effectively. This barrier lasts until the Elemental Skill is unleashed.\nAfter for a certain period of time, Candace will finish charging, and when the skill button is released, the skill duration expires, or when the barrier is broken, she will perform a leaping strike that deals Hydro DMG to opponents in front of her.",
        "icon": "/img/talents/candace_skill.png"
      },
      "elementalBurst": {
        "name": "Sacred Rite: Wagtail's Tide",
        "description": "Raising her weapon on high, Candace calls upon a divine blessing that deals AoE Hydro DMG based on her Max HP and continuously confers the Prayer of the Crimson Crown on your active character.\n\nPrayer of the Crimson Crown\nThis effect has the following properties:\nCharacters deal increased Elemental DMG with their Normal Attacks.\nWhenever a character takes the field, they will unleash a rippling wave of water that deals Hydro DMG to nearby opponents. There is a limited number of waves that can be triggered in the duration of this skill.\nSword, Claymore, and Polearm-wielding characters under this effect will obtain a Hydro Infusion.",
        "icon": "/img/talents/candace_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Aegis of Crossed Arrows",
          "description": "If Candace is hit by an attack in the Hold duration of Sacred Rite: Heron's Sanctum, that skill will finish charging instantly.",
          "icon": "/img/talents/candace_passive1.png"
        },
        {
          "name": "Celestial Dome of Sand",
          "description": "Characters affected by the Prayer of the Crimson Crown caused by Sacred Rite: Wagtail's Tide will deal 0.5% increased DMG to opponents every 1,000 points of Candace's Max HP when they deal Elemental DMG with their Normal Attacks.",
          "icon": "/img/talents/candace_passive2.png"
        },
        {
          "name": "To Dawn's First Light",
          "description": "Decreases climbing Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the same effects.",
          "icon": "/img/talents/candace_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Charlotte",
    "talents": {
      "normalAttack": {
        "name": "Cool-Color Capture",
        "description": "Normal Attack\nTaking aim at targets using Monsieur Verite, her custom Kamera, Charlotte performs up to 3 consecutive attacks, dealing Cryo DMG.\nCharged Attack\nConsumes a fixed amount of Stamina, and after a moment's preparation, will deploy Monsieur Verite to deal AoE Cryo DMG.\nPlunging Attack\nGathering the power of Cryo, Charlotte plunges toward the ground, dealing DMG to all opponents in her path and dealing AoE Cryo DMG upon landing.\nArkhe: Pneuma\nAt certain intervals, upon using a Charged Attack, Charlotte will cause a Spiritbreath Thorn to descend and pierce opponents, dealing Pneuma-aligned AoE Cryo DMG.",
        "icon": "/img/talents/charlotte_attack.png"
      },
      "elementalSkill": {
        "name": "Framing: Freezing Point Composition",
        "description": "Using the keen instincts of an ace reporter, Charlotte uses her photography skills to produce different effects based on whether the ability is Tapped or Held.\nTap\nTakes a snapshot using Monsieur Verite, dealing AoE Cryo DMG to opponents in front of her and applying Snappy Silhouette to a maximum of 5 opponents. During this effect's duration, it will deal Cryo DMG to affected opponents at intervals.\nHold\nPopping Monsieur Verite's viewfinder open, Charlotte enters Composition Mode, and during this time, the viewfinder will expand as you hold until you reach a Finisher Frame state. In this state, Charlotte can move and change direction freely.\nWhen the hold state ends, Monsieur Verite will deal Cryo DMG to all opponents locked on within the viewfinder, and apply the same Snappy Silhouette as Tap Mode does to them. If you unleash this ability only after reaching Finisher Frame, you will instead apply Focused Impression, which lasts longer and deals more DMG, although the Skill CD will be longer.\nComposition Mode lasts a maximum of 15s and allows a maximum of 5 opponents to be selected.\n\"Press photography requires simple shots with exceptional theming, but most of all, you need to have a knack for capturing the moment!\"",
        "icon": "/img/talents/charlotte_skill.png"
      },
      "elementalBurst": {
        "name": "Still Photo: Comprehensive Confirmation",
        "description": "Condensing ice to create The Steambird's signature, Charlotte creates a Newsflash Field that will deal AoE Cryo DMG and restores HP for all nearby party members based on Charlotte's ATK.\nNewsflash Field\nWhile the ability is active, Monsieur Verite will deal Cryo DMG at intervals to opponents within its AoE.\nWill continuously restore HP to active character(s) within its AoE based on Charlotte's ATK.\n\"Hearing stories from multiple perspectives to recreate what really happened is key to a good report... I mean, that's how you can pick the best angle for your article!\"",
        "icon": "/img/talents/charlotte_burst.png"
      },
      "passiveTalents": [
        {
          "name": "First-Person Shutter",
          "description": "After activating the Special Analysis Zoom Lens, Charlotte's \"Framing: Freezing Point Composition\" Hold Mode cannot trigger its original effects, but instead enables her to take photos in a rather unique manner...",
          "icon": "/img/talents/charlotte_passive1.png"
        },
        {
          "name": "Moment of Impact",
          "description": "When opponents marked by \"Focused Impression\" are defeated, Framing: Freezing Point Composition's CD will be decreased by 2s. This CD decrease can be triggered 4 times every 12s.",
          "icon": "/img/talents/charlotte_passive2.png"
        },
        {
          "name": "Diversified Investigation",
          "description": "When the party contains 1/2/3 Fontainians other than herself, Charlotte gains a 5%/10%/15% Healing Bonus. When the party contains 1/2/3 non-Fontainians, Charlotte gains a 5%/10%/15% Cryo DMG Bonus.",
          "icon": "/img/talents/charlotte_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Chevreuse",
    "talents": {
      "normalAttack": {
        "name": "Line Bayonet Thrust EX",
        "description": "Normal Attack\nPerforms up to 4 consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/chevreuse_attack.png"
      },
      "elementalSkill": {
        "name": "Short-Range Rapid Interdiction Fire",
        "description": "Chevreuse quickly shoulders her musket and fires at her opponent(s), dealing AoE Pyro DMG.\nFor a short duration after Chevreuse fires a shot, she will continuously restore HP to the active character on the field. The amount healed is based on her Max HP.\nHold to fire in a different fashion.\nHold\nEnter Aiming Mode, locking a target in her sights to fire a precise interdiction shot. If Chevreuse has an Overcharged Ball, then she will fire the Overcharged Ball instead, dealing greater Pyro DMG in a larger area.\nChevreuse gains 1 Overcharged Ball every time a nearby character in the party triggers an Overloaded reaction, and can have up to 1 Overcharged Ball at a time.\nArkhe: Ousia\nPeriodically, after Chevreuse's Short-Range Rapid Interdiction Fire hits, a Surging Blade will be called forth that deals Ousia-aligned Pyro DMG.\n\"Actually, training regulations only had the phrase \"interdiction fire,\n\" but the protagonist of this novel believes that even how stylish your terminology is can affect how motivated your troops are, which can put your opponents on the back foot right from the get-go... I think that's a good point, so I changed the regulations!\"",
        "icon": "/img/talents/chevreuse_skill.png"
      },
      "elementalBurst": {
        "name": "Ring of Bursting Grenades",
        "description": "Chevreuse fires an explosive grenade at opponents with her musket, dealing AoE Pyro DMG. After the projectile hits, it will split into many secondary explosive shells.\nThe secondary explosive shells will burst after a short interval, dealing Pyro DMG to nearby opponents.\n\"Theoretically, a rectangular blast would be most efficient at destroying enemy formations. Unfortunately, the cross-section of an explosive shock wave is round, like most cakes. So, the secondary explosive shells can only be arranged like the fruit on a cake, forming a ring around the edge.",
        "icon": "/img/talents/chevreuse_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Double Time March",
          "description": "Decreases sprinting Stamina consumption for your own party members by 20%.\nNot stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/chevreuse_passive1.png"
        },
        {
          "name": "Vanguard's Coordinated Tactics",
          "description": "When the Elemental Type of all party members is Pyro or Electro and there is at least one Pyro and one Electro characters each in the party:\nChevreuse grants \"Coordinated Tactics\" to nearby party members: After a character triggers the Overloaded reaction, the Pyro and Electro RES of the opponent(s) affected by this Overloaded reaction will be decreased by 40% for 6s.\nThe \"Coordinated Tactics\" effect will be removed when the Elemental Types of the characters in the party do not meet the basic requirements for the Passive Talent.",
          "icon": "/img/talents/chevreuse_passive2.png"
        },
        {
          "name": "Vertical Force Coordination",
          "description": "After Chevreuse fires an Overcharged Ball using Short-Range Rapid Interdiction Fire, nearby Pyro and Electro characters in the party gain 1% increased ATK for every 1,000 Max HP Chevreuse has for 30s. ATK can be increased by up to 40% in this way.",
          "icon": "/img/talents/chevreuse_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Chiori",
    "talents": {
      "normalAttack": {
        "name": "Weaving Blade",
        "description": "Normal Attack\nPerforms up to 4 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/chiori_attack.png"
      },
      "elementalSkill": {
        "name": "Fluttering Hasode",
        "description": "Dashes nimbly forward with silken steps. Once this dash ends, Chiori will summon the automaton doll \"Tamoto\" beside her and sweep her blade upward, dealing AoE Geo DMG to nearby opponents based on her ATK and DEF.\nHolding the Skill will cause it to behave differently.\n\nHold\nEnter Aiming Mode to adjust the dash direction.\n\nTamoto\nWill slash at nearby opponents at intervals, dealing AoE Geo DMG based on Chiori's ATK and DEF.\nWhile active, if there are nearby Geo Construct(s) or Geo Construct(s) are created nearby, an additional Tamoto will be summoned next to your active character. Only 1 additional Tamoto can be summoned in this manner, and its duration is independently counted.",
        "icon": "/img/talents/chiori_skill.png"
      },
      "elementalBurst": {
        "name": "Hiyoku: Twin Blades",
        "description": "Twin blades leave their sheaths as Chiori slices with the clean cuts of a master tailor, dealing AoE Geo DMG based on her ATK and DEF.",
        "icon": "/img/talents/chiori_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Tailor-Made",
          "description": "Gain different effects depending on the next action you take within a short duration after using Fluttering Hasode's upward sweep. If you (Press/Tap) the Elemental Skill, you will trigger the Tapestry effect. If you (Press/Tap) your Normal Attack, the Tailoring effect will be triggered instead.\n\nTapestry\nSwitches to the next character in your roster.\nGrants all your party members \"Seize the Moment\": When your active party member's Normal Attacks, Charged Attacks, and Plunging Attacks hit a nearby opponent, \"Tamoto\" will execute a coordinated attack, dealing 100% of Fluttering Hasode's upward sweep DMG as AoE Geo DMG at the opponent's location. DMG dealt this way is considered Elemental Skill DMG.\n\"Seize the Moment\" lasts 8s, and 1 of \"Tamoto\"'s coordinated attack can be unleashed every 2s. 2 such coordinated attacks can occur per \"Seize the Moment\" effect duration.\n\nTailoring\nChiori gains Geo infusion for 5s.\n\nWhen on the field, if Chiori does not either (Press/Tap) her Elemental Skill or use a Normal Attack within a short time after using Fluttering Hasode's upward sweep, the Tailoring effect will be triggered by default.",
          "icon": "/img/talents/chiori_passive1.png"
        },
        {
          "name": "The Finishing Touch",
          "description": "When a nearby party member creates a Geo Construct, Chiori will gain 20% Geo DMG Bonus for 20s.",
          "icon": "/img/talents/chiori_passive2.png"
        },
        {
          "name": "Brocaded Collar's Beauteous Silhouette",
          "description": "When any party member is wearing an outfit apart from their default outfit, or is wearing a wind glider other than the Wings of First Flight, your party members will obtain the Swift Stride effect: Movement SPD is increased by 10%.\nThis effect does not take effect in Domains, Trounce Domains and the Spiral Abyss. Swift Stride does not stack.",
          "icon": "/img/talents/chiori_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Chongyun",
    "talents": {
      "normalAttack": {
        "name": "Demonbane",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes.\nCharged Attack\nDrains Stamina over time to perform continuous swirling attacks against all nearby enemies.\n\nAt end of the sequence, perform a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/chongyun_attack.png"
      },
      "elementalSkill": {
        "name": "Spirit Blade - Chonghua's Layered Frost",
        "description": "Chongyun strikes the ground with his greatsword, causing a Cryo explosion in a circular AoE in front of him that deals Cryo DMG.\n\nAfter a short delay, the cold air created by the Cryo explosion will coalesce into a Chonghua Frost Field, within which all DMG done through Normal and Charged Attacks by Sword, Greatsword and Polearm-wielding characters will be converted to Cryo DMG.",
        "icon": "/img/talents/chongyun_skill.png"
      },
      "elementalBurst": {
        "name": "Spirit Blade - Cloud-parting Star",
        "description": "Performing the secret hand seals, Chongyun summons 3 giant spirit blades in mid-air that fall to the earth one by one after a short delay, exploding as they hit the ground.\n\nWhen the spirit blades explode, they will deal AoE Cryo DMG and launch enemies.",
        "icon": "/img/talents/chongyun_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Steady Breathing",
          "description": "Sword, Claymore, or Polearm-wielding characters within the field created by Spirit Blade - Chonghua's Layered Frost have their Normal Attack SPD increased by 8%.",
          "icon": "/img/talents/chongyun_passive1.png"
        },
        {
          "name": "Rimechaser Blade",
          "description": "When the field created by Spirit Blade - Chonghua's Layered Frost disappears, another spirit will be summoned to strike nearby enemies, dealing 100% of Chonghua's Layered Frost's Skill DMG as AoE Cryo DMG. Enemies hit by this blade will have their Cryo RES decreased by 10% for 8s.",
          "icon": "/img/talents/chongyun_passive2.png"
        },
        {
          "name": "Gallant Journey",
          "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%.",
          "icon": "/img/talents/chongyun_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Clorinde",
    "talents": {
      "normalAttack": {
        "name": "Oath of Hunting Shadows",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina and fires Suppressing Shots in a fan pattern with her pistolet.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/clorinde_attack.png"
      },
      "elementalSkill": {
        "name": "Hunter's Vigil",
        "description": "Preparing her pistolet, she enters the \"Night Vigil\" state, using steel and shot together. In this state, Clorinde's Normal Attacks will be transformed into \"Swift Hunt\" pistolet attacks, and the DMG dealt is converted into Electro DMG that cannot be overridden by infusions, and she will be unable to use Charged Attacks. Using her Elemental Skill will transform it into \"Impale the Night\": Perform a lunging attack, dealing Electro DMG. The DMG done through the aforementioned method is considered Normal Attack DMG.\nSwift Hunt\nWhen her Bond of Life is equal to or greater than 100% of her max HP: Performs a pistolet shot.\nWhen her Bond of Life is less than 100%, firing her pistolet will grant her Bond of Life, with the amount gained based on her max HP. The shots she fires can pierce opponents, and DMG dealt to opponents in their path is increased.\nImpale the Night\nThe current percentage value of Clorinde's Bond of Life determines its effect:\nWhen the Bond of Life value is 0%, perform a normal lunging strike;\nWhen the Bond of Life value is less than 100% of her max HP, Clorinde is healed based on the Bond of Life value, and the AoE of the lunging attack and the DMG dealt is increased;\nWhen the value of the Bond of Life is equal to or greater than 100% of her max HP, use Impale the Night: Pact. The healing multiplier is increased, and the AoE and DMG dealt by the lunge is increased even further.\nIn addition, when Clorinde is in the Night Vigil state, healing effects other than Impale the Night will not take effect and will instead be converted into a Bond of Life that is a percentage of the healing that would have been received.\nClorinde will exit the \"Night Vigil\" state when she leaves the field.\nArkhe: Ousia\nPeriodically, when Clorinde's Swift Hunt shots strike opponents, she will summon a Surging Blade at the position hit that deals Ousia-aligned Electro DMG.\nThough the evil that lurked in the shadows of the night had been purged across thousands of years, a shadow that the light could not reach clouded human hearts.\nEven now, the warning left by the Golden Hunter is etched into her memory: Those of the Night Vigil, carrying aloft lit candles against the blackness, have greater need still to remain vigilant. Be not corrupted by the cold dark.",
        "icon": "/img/talents/clorinde_skill.png"
      },
      "elementalBurst": {
        "name": "Last Lightfall",
        "description": "Grants herself a Bond of Life based upon her own max HP before swiftly evading and striking with saber and sidearm as one, dealing AoE Electro DMG.\nIt is said the legacy of the ancient art of resisting non-human beings with but a mortal body can be traced back to the Lochknights who resisted the Remurian Empire.\nBe that as it may, so long as one can find a way to control the level of force used, it's not as if it cannot be used in duels against ordinary opponents.",
        "icon": "/img/talents/clorinde_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Night Vigil's Harvest",
          "description": "Displays the location of nearby resources unique to Fontaine on the mini-map.",
          "icon": "/img/talents/clorinde_passive1.png"
        },
        {
          "name": "Dark-Shattering Flame",
          "description": "After a nearby party member triggers an Electro-related reaction against an opponent, Electro DMG dealt by Clorinde's Normal Attacks and Last Lightfall will be increased by 20% of Clorinde's ATK for 15s. Max 3 stacks. Each stack is counted independently. The Maximum DMG increase achievable this way for the above attacks is 1,800.",
          "icon": "/img/talents/clorinde_passive2.png"
        },
        {
          "name": "Lawful Remuneration",
          "description": "If Clorinde's Bond of Life is equal to or greater than 100% of her Max HP, her CRIT Rate will increase by 10% for 15s whenever her Bond of Life value increases or decreases. Max 2 stacks. Each stack is counted independently.\nAdditionally, Hunter's Vigil's Night Vigil state is buffed: While it is active, the percent of healing converted to Bond of Life increases to 100%.",
          "icon": "/img/talents/clorinde_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Collei",
    "talents": {
      "normalAttack": {
        "name": "Supplicant's Bowmanship",
        "description": "Normal Attack\nPerforms up to 4 consecutive shots with a bow.\n\nCharged Attack\nPerforms a more precise Aimed Shot with increased DMG.\nWhile aiming, Dendro energy will accumulate on the arrowhead. A fully charged arrow will deal Dendro DMG.\n\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/collei_attack.png"
      },
      "elementalSkill": {
        "name": "Floral Brush",
        "description": "Throws out a Floral Ring that deals 1 instance of Dendro DMG to targets it comes into contact with.\nThe Floral Ring will return after a set time, dealing Dendro DMG once again.",
        "icon": "/img/talents/collei_skill.png"
      },
      "elementalBurst": {
        "name": "Trump-Card Kitty",
        "description": "Trusty Cuilein-Anbar comes to save the day!\nThrows the doll named Cuilein-Anbar, causing an explosion that deals AoE Dendro DMG, creating a Cuilein-Anbar Zone. Cuilein-Anbar will bounce around within this zone, dealing AoE Dendro DMG.",
        "icon": "/img/talents/collei_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Floral Sidewinder",
          "description": "If one of your party members has triggered Burning, Quicken, Aggravate, Spread, Bloom, Hyperbloom, or Burgeon reactions before the Floral Ring returns, it will grant the character the Sprout effect upon return, which will continuously deal Dendro DMG equivalent to 40% of Collei's ATK to nearby opponents for 3s.\nIf another Sprout effect is triggered during its initial duration, the initial effect will be removed.",
          "icon": "/img/talents/collei_passive1.png"
        },
        {
          "name": "The Languid Wood",
          "description": "When a character within the Cuilein-Anbar Zone triggers Burning, Quicken, Aggravate, Spread, Bloom, Hyperbloom, or Burgeon reactions, the Zone's duration will be increased by 1s.\nsingle Trump-Card Kitty can be extended by up to 3s.",
          "icon": "/img/talents/collei_passive2.png"
        },
        {
          "name": "Gliding Champion of Sumeru",
          "description": "Decreases gliding Stamina consumption for your own party members by 20%.\nNot stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/collei_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Cyno",
    "talents": {
      "normalAttack": {
        "name": "Invoker's Spear",
        "description": "Normal Attack\nPerforms up to four consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/cyno_attack.png"
      },
      "elementalSkill": {
        "name": "Secret Rite: Chasmic Soulfarer",
        "description": "Performs a swift thrust, dealing Electro DMG to opponents along the path.\nWhen Cyno is under the Pactsworn Pathclearer state triggered by the Elemental Burst \"Sacred Rite: Wolf's Swiftness,\" he will instead unleash a Mortuary Rite that deals thunderous AoE Electro DMG and extends the duration of Pactsworn Pathclearer.\n\"This judgment brooks no choice. There is no rejection or acceptance here... We have both long been bound up in this conviction.\"",
        "icon": "/img/talents/cyno_skill.png"
      },
      "elementalBurst": {
        "name": "Sacred Rite: Wolf's Swiftness",
        "description": "Calls upon a divine spirit to indwell him, morphing into the Pactsworn Pathclearer.\nPactsworn Pathclearer\nCyno's Normal, Charged, and Plunging Attacks will be converted to Electro DMG that cannot be overridden. Cyno's Elemental Mastery and resistance to interruption will increase, and he gains immunity to Electro-Charged DMG. This effect will be canceled when Cyno leaves the field and lasts a maximum of 18s.",
        "icon": "/img/talents/cyno_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Featherfall Judgment",
          "description": "When Cyno is in the Pactsworn Pathclearer state activated by Sacred Rite: Wolf's Swiftness, Cyno will enter the Endseer stance at intervals. If he activates Secret Rite: Chasmic Soulfarer while affected by this stance, he will activate the Judication effect, increasing the DMG of this Secret Rite: Chasmic Soulfarer by 35%, and firing off 3 Duststalker Bolts that deal 100% of Cyno's ATK as Electro DMG.\nDuststalker Bolt DMG is considered Elemental Skill DMG.",
          "icon": "/img/talents/cyno_passive1.png"
        },
        {
          "name": "Authority Over the Nine Bows",
          "description": "Cyno's DMG values will be increased based on his Elemental Mastery as follows:\n- Pactsworn Pathclearer's Normal Attack DMG is increased by 150% of his Elemental Mastery.\n- Duststalker Bolt DMG from his Passive Talent Featherfall Judgment is increased by 250% of his Elemental Mastery.",
          "icon": "/img/talents/cyno_passive2.png"
        },
        {
          "name": "The Gift of Silencee",
          "description": "Gains 25% more rewards when dispatched on a Sumeru Expedition for 20 hours.",
          "icon": "/img/talents/cyno_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Dehya",
    "talents": {
      "normalAttack": {
        "name": "Sandstorm Assault",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes using her Claymore and her martial arts.\nCharged Attack\nDrains Stamina over time to perform continuous slashes.At the end of the sequence, performs a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/dehya_attack.png"
      },
      "elementalSkill": {
        "name": "Molten Inferno",
        "description": "This art of Dehya's own invention changes its method of use depending on the combat situation.\nIndomitable Flame\nThis skill will be unleashed should there be no Fiery Sanctum field created by Dehya herself present at the time.\nDeals AoE Pyro DMG, and creates a field known as Fiery Sanctum.\nRanging Flame\nThis skill will be unleashed should a Fiery Sanctum field created by Dehya herself already exist.\nDehya will perform a leaping attack, dealing AoE Pyro DMG before recreating a Fiery Sanctum field at her new position.\nA Fiery Sanctum field created this way will inherit the remaining duration of the previous field.\nRanging Flame can be used only once throughout a single Fiery Sanctum field's duration.\nFiery Sanctum\nWhen an opponent within a Fiery Sanctum field takes DMG, the field will unleash a coordinated attack, dealing AoE Pyro DMG to them based on Dehya's ATK and Max HP. This effect can be triggered once every 2.5s.\nActive characters within this field have their resistance to interruption increased, and when such characters take DMG, a portion of that damage will be mitigated and flow into Redmane's Blood. Dehya will then take this DMG over 10s. When the mitigated DMG stored by Redmane's Blood reaches or goes over a certain percentage of Dehya's Max HP, she will stop mitigating DMG in this way.\nOnly 1 Fiery Sanctum created by Dehya herself can exist at the same time.",
        "icon": "/img/talents/dehya_skill.png"
      },
      "elementalBurst": {
        "name": "Leonine Bite",
        "description": "Unleashing her burning anger and casting her inconvenient blade aside, Dehya enters the Blazing Lioness state and increases her resistance to interruption.\nIn this state, Dehya will automatically and continuously unleash the Flame-Mane's Fists, dealing Pyro DMG based on her ATK and Max HP, and when its duration ends, she will unleash an Incineration Drive, dealing AoE Pyro DMG based on her ATK and Max HP.\nIf a Fiery Sanctum field created by Dehya's own Elemental Skill 'Molten Inferno' exists when this ability is unleashed, Dehya will retrieve it, and then create another field once Blazing Lioness's duration expires. This field will take on the retrieved field's duration at the moment of its retrieval.\nIn this state, Dehya will be unable to cast her Elemental Skill, or perform Normal, Charged, and Plunging Attacks. 'Normal Attack: Sandstorm Assault' and Elemental Skill 'Molten Inferno' will be replaced by 'Roaring Barrage.'\nRoaring Barrage\nUnleashing Roaring Barrage within 0.4s after each Flame-Mane's Fist strike will increase the speed at which the next Flame-Mane's Fist strike will be triggered.",
        "icon": "/img/talents/dehya_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Unstinting Succor",
          "description": "Within 6 seconds after Dehya retrieves the Fiery Sanctum field through Molten Inferno: Ranging Flame or Leonine Bite, she will take 60% less DMG when receiving DMG from Redmane's Blood. This effect can be triggered once every 2s.\nAdditionally, within 9s after Dehya unleashes Molten Inferno: Indomitable Flame, she will grant all party members the Gold-Forged Form state. This state will further increase a character's resistance to interruption when they are within the Fiery Sanctum field. Gold-Forged Form can be activated once every 18s.",
          "icon": "/img/talents/dehya_passive1.png"
        },
        {
          "name": "Stalwart and True",
          "description": "When her HP is less than 40%, Dehya will recover 20% of her Max HP and will restore 6% of her Max HP every 2s for the next 10s. This effect can be triggered once every 20s.",
          "icon": "/img/talents/dehya_passive2.png"
        },
        {
          "name": "The Sunlit Way",
          "description": "Increases the Movement SPD of your own party members by 10% during the day (6:00  18:00).\nDoes not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/dehya_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Diluc",
    "talents": {
      "normalAttack": {
        "name": "Tempered Sword",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes.\nCharged Attack\nDrains Stamina over time to perform continuous slashes.\n\nAt the end of the sequence, perform a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/diluc_attack.png"
      },
      "elementalSkill": {
        "name": "Searing Onslaught",
        "description": "Performs a forward slash that deals Pyro DMG.\nThis skill can be used 3 times consecutively. Enters CD if not cast again within a short period.",
        "icon": "/img/talents/diluc_skill.png"
      },
      "elementalBurst": {
        "name": "Dawn",
        "description": "Releases intense flames to knock nearby enemies back, dealing Pyro DMG. The flames then converge into the weapon, summoning a Phoenix that flies forward and deals massive Pyro DMG to all enemies in its path. The Phoenix explodes upon reaching its destination, causing a large amount of AoE Pyro DMG.\n\nThe searing flames that run down his blade cause Diluc's Normal and Charged Attacks to deal Pyro DMG for a time.",
        "icon": "/img/talents/diluc_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Relentless",
          "description": "Diluc's Charged Attack Stamina Cost is decreased by 50%, and its duration is increased by 3s.",
          "icon": "/img/talents/diluc_passive1.png"
        },
        {
          "name": "Blessing of Phoenix",
          "description": "The Pyro Enchantment provided by Dawn lasts for 4s longer. Additionally, Diluc gains 20% Pyro DMG Bonus during the duration of this effect.",
          "icon": "/img/talents/diluc_passive2.png"
        },
        {
          "name": "Tradition of the Dawn Knight",
          "description": "Refunds 15% of the ores used when crafting Claymore-type weapons.",
          "icon": "/img/talents/diluc_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Diona",
    "talents": {
      "normalAttack": {
        "name": "Katzlein Style",
        "description": "Normal Attack\nPerforms up to 5 consecutive shots with a bow.\nCharged Attack\nPerform a more precise Aimed Shot with increased DMG.\n\nWhile aiming, biting frost accumulates on the arrowhead. A fully charged frost arrow will deal Cryo DMG.\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/diona_attack.png"
      },
      "elementalSkill": {
        "name": "Icy Paws",
        "description": "Fires an Icy Paw that deals Cryo DMG to opponents and forms a shield on hit. The shield's DMG Absorption scales based on Diona's Max HP, and its duration scales off the number of Icy Paws that hit their target.\nPress\nRapidly fires off 2 Icy Paws.\nHold\nDashes back quickly before firing five Icy Paws.\nThe shield created by a Hold attack will gain a 75% DMG Absorption Bonus.\nThe shield has a 250% Cryo DMG Absorption Bonus, and will cause your active character to become affected by Cryo at the point of formation for a short duration.",
        "icon": "/img/talents/diona_skill.png"
      },
      "elementalBurst": {
        "name": "Signature Mix",
        "description": "Tosses out a special cold brew that deals AoE Cryo DMG and creates a Drunken Mist in an AoE.\nDrunken Mist\n\nDeals continuous Cryo DMG to opponents within the AoE.\nContinuously regenerates the HP of characters within the AoE.\n",
        "icon": "/img/talents/diona_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Cat's Tail Secret Menu",
          "description": "Characters shielded by Icy Paws have their Movement SPD increased by 10% and their Stamina Consumption decreased by 10%.",
          "icon": "/img/talents/diona_passive1.png"
        },
        {
          "name": "Drunkard's Farce",
          "description": "Opponents who enter the AoE of Signature Mix have 10% decreased ATK for 15s.",
          "icon": "/img/talents/diona_passive2.png"
        },
        {
          "name": "Complimentary Bar Food",
          "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product.",
          "icon": "/img/talents/diona_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Dori",
    "talents": {
      "normalAttack": {
        "name": "Marvelous Sword- Dance (Modified)",
        "description": "Normal Attack\nPerform up to 3 consecutive strikes.\n\nCharged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents.\nAt the end of the sequence, performs a more powerful slash.\n\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG",
        "icon": "/img/talents/dori_attack.png"
      },
      "elementalSkill": {
        "name": "Spirit-Warding Lamp: Troubleshooter Cannon",
        "description": "Directs a Spirit-Warding Lamp to fire off a Troubleshooter Shot at opponents, dealing Electro DMG.\nAfter the Troubleshooter Shot hits, it will create 2 After-Sales Service Rounds that will automatically track opponents and deal Electro DMG.\nIt is said that Dori can fix any problem for you... for the right price.",
        "icon": "/img/talents/dori_skill.png"
      },
      "elementalBurst": {
        "name": "Alcazarzaray's Exactitude",
        "description": "Summons forth the Jinni within the lamp to give the client various kinds of aid.\n\nJinni\nConnects to a nearby character. The connected character will:\n Continuously restore HP based on Dori's Max HP.\n Continuously regenerate Energy.\n Be affected by Electro.\nWhen connector between the Jinni and the character touches opponents, it will deal one instance of Electro DMG to them every 0.4%.\nOnly one Jinni can exist at one time.\n\n\"Hmm? You'll pick this lamp, will you? Oh my, you've got good taste! Unfortunately, there's no price on this treasure - comparable, I'd say, to how you will not sell that mascot by your side for any price in the world.\"",
        "icon": "/img/talents/dori_burst.png"
      },
      "passiveTalents": [
        {
          "name": "An Eye for Gold",
          "description": "After a character connected to the Jinni triggers an Electro0Charged, Superconduct, Overloaded, Quicken, Aggravate, Hyperbloom, or an Electro Swirl or Crystallize reaction, the CD of Spirit-Wandering Lamp: Troubleshooter Cannon is decreased by 1s.\nThis effect can be triggered once every 3s.",
          "icon": "/img/talents/dori_passive1.png"
        },
        {
          "name": "Compound Interest",
          "description": "When the Troubleshooter Shots or After-Sales Service Rounds from Spirit-Warding Lamp: Troubleshooter Cannon hit opponents, Dori will restore 5 Elemental Energy for every 100% Energy Recharge possessed.\nPer Spirit-Warding Lamp: Troubleshooter Cannon, only one instance of Energy restoration can be triggered and a maximum of 15 Energy can be restored this way.",
          "icon": "/img/talents/dori_passive2.png"
        },
        {
          "name": "Unexpected Order",
          "description": "Has a 25% chance to recover some of the materials used when crafting Character and Weapon Materials.",
          "icon": "/img/talents/dori_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Emilie",
    "talents": {
      "normalAttack": {
        "name": "Shadow-Hunting Spear (Custom)",
        "description": "Normal Attack\nPerforms up to 4 consecutive spear strikes.\n\nCharged Attack\nConsumes a certain amount of Stamina to perform an upward slash.\n\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/emilie_attack.png"
      },
      "elementalSkill": {
        "name": "Fragrance Extraction",
        "description": "Creates a Lumidouce Case that deals AoE Dendro DMG.\nLumidouce Case\nFires Puffs of Puredew at nearby opponents at intervals, dealing Dendro DMG.\nWhen nearby opponents are affected by Burning, they will give off Scents at intervals, and 1 Scent can be created this way every 2s. The Lumidouce Case collects nearby Scents. The Lumidouce Case will level up after gathering 2 of them, after which it will fire 1 extra Puff of Puredew when firing, while the DMG dealt by and DMG AoE of the above attack will also be increased.\n1 Lumidouce Case created by Emilie herself can exist at any one time. The Case starts at Level 1 and can go up to Level 2. If the Case does not collect any Scents for 8s while it is on the field, it will go back to Level 1.\nArkhe: Pneuma\nAt intervals, after Emilie creates a Lumidouce Case this way, a Spiritbreath Thorn will descend in front of her and pierce her opponent, dealing Pneuma-aligned Dendro DMG.",
        "icon": "/img/talents/emilie_skill.png"
      },
      "elementalBurst": {
        "name": "Aromatic Explication",
        "description": "Guiding the fragrances collected within the Case, Emilie converts them into pure Dendro energy, creating a Level 3 Lumidouce Case and stowing existing Cases away.\nWhile it exists, the Level 3 Lumidouce Case will not gather nearby Scents, but it will continuously cause Scented Dew to descend, attacking opponents within range and dealing Dendro DMG. During this time, 1 drop of Scented Dew will descend every 0.3 seconds, and 1 opponent can become the target every 0.7 seconds.\nWhen the duration ends, a Level 1 Lumidouce Case will be recreated. If a Lumidouce Case was stowed away when using Aromatic Explication, then the Case that was stowed away will be deployed instead, and its duration will be reset.\nWhile Aromatic Explication is active, the Elemental Skill \"Fragrance Extraction\" will not create a Lumidouce Case.",
        "icon": "/img/talents/emilie_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Lingering Fragrance",
          "description": "Each time it collects 2 Scents, the Level 2 Lumidouce Case will consume Scents and release Cleardew Cologne that deals AoE Dendro DMG equal to 600% of Emilie's ATK to opponents. This DMG is not considered Elemental Skill DMG.",
          "icon": "/img/talents/emilie_passive1.png"
        },
        {
          "name": "Rectification",
          "description": "Emilie deals increased DMG to Burning opponents based on her ATK, with every 1,000 ATK increasing DMG dealt by 15%. The maximum DMG bonus that can be gained this way is 36%.",
          "icon": "/img/talents/emilie_passive2.png"
        },
        {
          "name": "Headspace Capture",
          "description": "When the Lumidouce Case created by Emilie is on the field, all party members gain 85% Pyro RES against Burning DMG.",
          "icon": "/img/talents/emilie_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Eula",
    "talents": {
      "normalAttack": {
        "name": "Favonius Bladework - Edel",
        "description": "Normal Attack\nPerform up to five consecutive strikes.\nCharged Attack\nDrains Stamina over time to perform continuous slashes. At the end of the sequence, perform a more powerful slash.\nPlunging Attack\n Plunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/eula_attack.png"
      },
      "elementalSkill": {
        "name": "Icetide Vortex",
        "description": "Sharp frost, swift blade.\nPress\nSlashes swiftly, dealing Cryo DMG. When it hits an opponent, Eula gains a stack of Grimheart that stacks up to two times. These stats can only be gained once every 0.3s.\nGrimheart\nIncreases Eula's resistance to interruption and DEF.\nHold\nWielding her sword, Eula consumes all the stacks of Grimheart and lashes forward, dealing AoE Cryo DMG to opponents in front of her.\nIf Grimheart stacks are consumed, surrounding opponents will have their Physical RES and Cryo RES decreased.\nEach consumed stack of Grimheart will be converted into an Icewhirl Brand that deals Cryo DMG to nearby opponents.",
        "icon": "/img/talents/eula_skill.png"
      },
      "elementalBurst": {
        "name": "Glacial Illumination",
        "description": "Brandishes her greatsword, dealing Cryo DMG to nearby opponents and creating a Lightfall Sword that follows her around for a duration of up to 7s.\nWhile present, the Lightfall Sword increases Eula's resistance to interruption. When Eula's own Normal Attack, Elemental Skill, and Elemental Burst deal DMG to opponents, they will charge the Lightfall Sword, which can gain an energy stack once every 0.1s.\nOnce its duration ends, the Lightfall Sword will descend and explode violently, dealing Physical DMG to nearby opponents.\nThis DMG scales on the number of energy stacks the Lightfall Sword has accumulated.\nIf Eula leaves the field, the Lightfall Sword will immediately explode.",
        "icon": "/img/talents/eula_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Roiling Rime",
          "description": "If 2 stacks of Grimheart are consumed upon unleashing the Holding Mode of Icetide Vortex, a Shattered Lightfall Sword will be created that will explode immediately, dealing 50% of the basic Physical DMG dealt by a Lightfall Sword created by Glacial Illumination.",
          "icon": "/img/talents/eula_passive1.png"
        },
        {
          "name": "Wellspring of War-Lust",
          "description": "When Glacial Illumination is cast, the CD of Icetide Vortex is reset and Eula gains 1 stack of Grimheart.",
          "icon": "/img/talents/eula_passive2.png"
        },
        {
          "name": "Aristocratic Introspection",
          "description": "When Eula crafts Character Talent Materials, she has a 10% chance to receive double the product.",
          "icon": "/img/talents/eula_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Faruzan",
    "talents": {
      "normalAttack": {
        "name": "Parthian Shot",
        "description": "Normal Attack\nPerforms up to 4 consecutive shots with a bow.\nCharged Attack\nPerforms a more precise Aimed Shot with increased DMG.\nWhile aiming, mighty winds will accumulate on the arrowhead. A fully charged wind arrow will deal Anemo DMG.\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, hitting opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/faruzan_attack.png"
      },
      "elementalSkill": {
        "name": "Wind Realm of Nasamjnin",
        "description": "Faruzan deploys a polyhedron that deals AoE Anemo DMG to nearby opponents. She will also enter the Manifest Gale state.\nWhile in the Manifest Gale state, Faruzan's next fully charged shot will consume this state and will become a Hurricane Arrow that contains high-pressure currents. This arrow deals Anemo DMG based on the DMG of a fully charged Aimed Shot from 'Normal Attack: Parthian Shot.'\nPressurized Collapse\nThe Hurricane Arrow will apply a Pressurized Collapse effect to the opponent or character hit. This effect will be removed after a short delay, creating a vortex that deals AoE Anemo DMG and pulls nearby objects and opponents in. If the Hurricane Arrow does not hit any opponent or character, it will create a Pressurized Collapse effect at its point of impact.\nThe vortex DMG is considered Elemental Skill DMG.",
        "icon": "/img/talents/faruzan_skill.png"
      },
      "elementalBurst": {
        "name": "The Wind's Secret Ways",
        "description": "Faruzan deploys a Dazzling Polyhedron that unleashes a Whirlwind Pulse and deals AoE Anemo DMG.\nWhile the Dazzling Polyhedron persists, it will continuously move along a triangular path. Once it reaches each corner of that triangular path, it will unleash 1 more Whirlwind Pulse.\nWhirlwind Pulse\nWhen the Whirlwind Pulse is unleashed, it will apply Perfidious Wind's Bale to nearby opponents, decreasing their Anemo RES.\nThe Whirlwind Pulse will also apply Prayerful Wind's Benefit to all nearby party members when it is unleashed, granting them an Anemo DMG Bonus.",
        "icon": "/img/talents/faruzan_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Impetuous Flow",
          "description": "When Faruzan is in the Manifest Gale state created by Wind Realm of Nasamjnin, the amount of time taken to charge a shot is decreased by 60%, and she can apply The Wind's Secret Ways' Perfidious Wind's Bale to opponents who are hit by the vortex created by Pressurized Collapse.",
          "icon": "/img/talents/faruzan_passive1.png"
        },
        {
          "name": "Lost Wisdom of the Seven Caverns",
          "description": "When characters affected by The Wind's Secret Ways' Prayerful Wind's Gift deal Anemo DMG using Normal, Charged, Plunging Attacks, Elemental Skills, or Elemental Bursts to opponents, they will gain the Hurricane Guard effect: This DMG will be increased based on 32% of Faruzan's Base ATK. 1 instance of Hurricane Guard can occur once every 0.8s. This DMG Bonus will be cleared after Prayerful Wind's Benefit expires or after the effect is triggered once.",
          "icon": "/img/talents/faruzan_passive2.png"
        },
        {
          "name": "Tomes Light the Path",
          "description": "Gains 25% more rewards when dispatched on a Sumeru Expedition for 20 hours.",
          "icon": "/img/talents/faruzan_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Fischl",
    "talents": {
      "normalAttack": {
        "name": "Bolts of Downfall",
        "description": "Normal Attack\nPerforms up to 5 consecutive shots with a bow.\nCharged Attack\nPerform a more precise Aimed Shot with increased DMG.\n\nWhile aiming, the dark lightning spirits of Immernachtreich shall heed the call of their Prinzessin and indwell the enchanted arrowhead. When fully indwelt, the Rachsuchtig Blitz shall deal immense Electro DMG.\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/fischl_attack.png"
      },
      "elementalSkill": {
        "name": "Nightrider",
        "description": "Summons Oz, the night raven forged of darkness and lightning descends upon the land, dealing Electro DMG in a small AoE.\n\nFor the ability's duration, Oz will continuously attack nearby enemies with Freikugel.\nHold to adjust the location Oz will be summoned to.\n\nPress again any time during the ability's duration to once again summon him to Fischl's side.",
        "icon": "/img/talents/fischl_skill.png"
      },
      "elementalBurst": {
        "name": "Midnight Phantasmagoria",
        "description": "Summons Oz to spread his twin swings of twilight and defend Fischl.\n\nHas the following properties during the ability's duration:\n\nFischl takes on Oz's form, greatly increasing her Movement Speed.\nStrikes nearby enemies with lightning, dealing Electro DMG to enemies she comes into contact with. Each enemy can only be struck once.\nOnce this ability's effects end, Oz will remain on the battlefield and attack his Prinzessin's foes. If Oz is already on the field, then this will reset the duration of his presence.\n",
        "icon": "/img/talents/fischl_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Stellar Predator",
          "description": "When Fischl hits Oz with a fully-charged Aimed Shot, Oz brings down Thundering Retribution, dealing AoE Electro DMG equal to 152.7% of the arrow's DMG.",
          "icon": "/img/talents/fischl_passive1.png"
        },
        {
          "name": "Undone Be Thy Sinful Hex",
          "description": "If a character triggers an Electro-related Elemental Reaction when Oz is on the field, the enemy shall be stricken with Thundering Retribution, dealing Electro DMG equal to 80% of Fischl's ATK.",
          "icon": "/img/talents/fischl_passive2.png"
        },
        {
          "name": "Mein Hausgarten",
          "description": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%.",
          "icon": "/img/talents/fischl_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Freminet",
    "talents": {
      "normalAttack": {
        "name": "Flowing Eddies",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes.\nCharged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents.\nAt the end of the sequence, performs a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/freminet_attack.png"
      },
      "elementalSkill": {
        "name": "Pressurized Floe",
        "description": "Does an upward thrust that will deal Cryo DMG and cause Freminet to enter Pers Timer for 10s.\nWhile Pers Timer is active, his Elemental Skill will turn into Shattering Pressure.\nShattering Pressure\nExecutes different sorts of attacks based on the Pressure level of Pers Timer, and then cancels Pers Timer.\nLevel 0: Unleashes a vertical cut that will deal Cryo DMG.\nLevels 1 to 3: Unleashes a vertical cut alongside Pers, dealing Cryo DMG and Physical DMG. DMG dealt scales based on Pressure level.\nLevel 4: Borrows the power of a fully-pressurized Pers to deal Physical DMG. Meanwhile, Normal Attack: Flowing Eddies will be replaced by Shattering Pressure.\nPers Timer\nWhen Freminet uses Normal Attacks, he will also unleash waves of frost that deal Cryo DMG and increase Pers' Pressure level.\nThe accompanying Cryo DMG dealt this way is considered Elemental Skill DMG.\nArkhe: Pneuma\nAt certain intervals, after using the upward thrust, a Spiritbreath Thorn in the form of another upward thrust will be created, dealing Pneuma-aligned Cryo DMG.\nTo immobilize one's opponent without taking their life can also be considered something of a \"survival\" strategy that one may choose.\n\"Pers... I leave the rest to you.\"",
        "icon": "/img/talents/freminet_skill.png"
      },
      "elementalBurst": {
        "name": "Shadowhunter's Ambush",
        "description": "Unleashes a wave of untouchable cold, dealing AoE Cryo DMG, resetting the CD of the Elemental Skill \"Pressurized Floe,\" and causing Freminet to enter the Subnautical Hunter mode for 10s.\nWhile in Subnautical Hunter mode, his interruption resistance will increase, and Pressurized Floe will obtain the following buffs:\nCD decreased by 70%.\nNormal Attacks will give Pers 1 additional Pressure stack, and the frost released by his Normal Attacks deal 200% of their original DMG.\nThis effect will be canceled when Freminet leaves the field.\n\"Now... I have no need of any extraneous noise.\"",
        "icon": "/img/talents/freminet_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Deepwater Navigation",
          "description": "Decreases underwater stamina consumption for your own party members by 35%.\nNot stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/freminet_passive1.png"
        },
        {
          "name": "Saturation Deep Dive",
          "description": "When using Pressurized Floe: Shattering Pressure, if Pers Timer has less than 4 levels of Pressure, the CD of Pressurized Floe will be decreased by 1s.",
          "icon": "/img/talents/freminet_passive2.png"
        },
        {
          "name": "Parallel Condensers",
          "description": "When Freminet triggers Shatter against opponents, the DMG dealt by Pressurized Floe: Shattering Pressure will be increased by 40% for 5s.",
          "icon": "/img/talents/freminet_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Furina",
    "talents": {
      "normalAttack": {
        "name": "Soloist's Solicitation",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash a solo dance, dealing Physical DMG to nearby opponents and changing her Arkhe alignment. If Salon Members or Singer of Many Waters summoned by her Elemental Skill \"Salon Solitaire\" are present, their lineup will switch in response.\nArkhe: Seats Sacred and Secular\nAt intervals, when Furina's Normal Attacks hit, a Spiritbreath Thorn or a Surging Blade will descend based on her current alignment, dealing Hydro DMG based on her current alignment.\nWhen Furina takes the field, her starting Arkhe will be Ousia.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/furina_attack.png"
      },
      "elementalSkill": {
        "name": "Salon Solitaire",
        "description": "Invites the guests of the Salon Solitaire to come forth and abet in Furina's performance. Will summon either the Salon Members or the Singer of Many Waters based on Furina's current Arkhe alignment.\nOusia\nFoaming bubbles like celebrants shall dance, dealing AoE Hydro DMG based on Furina's Max HP and summoning 3 Salon Members: the Ball Octopus-shaped Gentilhomme Usher, the Bubbly Seahorse-shaped Surintendante Chevalmarin, and the Armored Crab-shaped Mademoiselle Crabaletta.\nThey will attack nearby opponents at intervals, prioritizing the target of the active character, dealing Hydro DMG based on Max HP.\nWhen they attack, if character(s) with more than 50% HP are nearby, the Members will increase their current attack's power based on the number of such characters, and consume said characters' HP. If 1/2/3/4 (or more) characters meet these requirements, the Members' attacks will deal 110%/120%/130%/140% of their original DMG.\nPneuma\nSummons the Singer of Many Waters, who will heal nearby active character(s) based on Max HP at intervals.\nThe Salon Members and Singer of Many Waters share a duration, and when Furina uses her Charged Attack to change the guest type, the new guests will inherit the initial duration.\nWhile the Salon Members or the Singer of Many Waters is on the field, Furina can move on the water's surface.\nA fixed roster of regulars frequent Furina's Salon Solitaire. At other times, Mademoiselle Crabaletta, Surintendante Chevalmarin, and Gentilhomme Usher shall visit, and on gloomy Wednesdays, it is the singer who comes by.",
        "icon": "/img/talents/furina_skill.png"
      },
      "elementalBurst": {
        "name": "Let the People Rejoice",
        "description": "Rouses the impulse to revel, creating a stage of foam that will deal AoE Hydro DMG based on Furina's Max HP and cause nearby party members to enter the Universal Revelry state: During this time, when nearby party members' HP increases or decreases, 1 Fanfare point will be granted to Furina for each percentage point of their Max HP by which their HP changes.\nAt the same time, Furina will increase the DMG dealt by and Incoming Healing Bonus of all nearby party members based on the amount of Fanfare she has.\nWhen the duration ends, Furina's Fanfare points will be cleared.\n\"Cheer! Give praise! Be awed! Raise your glasses! Every night bereft of banqueting is a sordid squandering of sore, sober daylight... And, uh, those who are not yet of age may have grape juice instead!\"",
        "icon": "/img/talents/furina_burst.png"
      },
      "passiveTalents": [
        {
          "name": "The Sea Is My Stage",
          "description": "Xenochromatic Fontemer Aberrant ability CD decreased by 30%.",
          "icon": "/img/talents/furina_passive1.png"
        },
        {
          "name": "Endless Waltz",
          "description": "When the active character in your party receives healing, if the source of the healing is not Furina herself and the healing overflows, then Furina will heal a nearby party member for 2% of their Max HP once every 2s within the next 4s.",
          "icon": "/img/talents/furina_passive2.png"
        },
        {
          "name": "Unheard Confession",
          "description": "Every 1,000 points of Furina's Max HP can buff the different Arkhe-aligned Salon Solitaire in the following ways:\nWill increase Salon Member DMG dealt by 0.7%, up to a maximum of 28%.\nWill decrease active character healing interval of the Singer of Many Waters by 0.4%, up to a maximum of 16%.",
          "icon": "/img/talents/furina_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Gaming",
    "talents": {
      "normalAttack": {
        "name": "Stellar Rend",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes.\nCharged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents. At the end of the sequence, performs a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/gaming_attack.png"
      },
      "elementalSkill": {
        "name": "Bestial Ascent",
        "description": "Pounces forward using the Wushou arts, leaping high into the air after coming into contact with a target or surface.\nAfter Gaming has used Bestial Ascent to rise into the air, he will use the especially powerful Plunging Attack: Charmed Cloudstrider when performing a Plunging Attack.\n\nPlunging Attack: Charmed Cloudstrider\nThe DMG from Plunging Attacks caused by Bestial Ascent is converted to Pyro DMG that cannot be overridden by other elemental infusions. Upon landing, Gaming will consume a fixed amount of HP. Gaming's HP cannot be reduced below 10% by this method.\nCharmed Cloudstrider DMG is considered Plunging Attack DMG.",
        "icon": "/img/talents/gaming_skill.png"
      },
      "elementalBurst": {
        "name": "Suanni's Gilded Dance",
        "description": "Gaming enters Wushou Stance, briefly applying Pyro to him, recovering a fixed amount of HP, and summons his companion, the Suanni Man Chai, to smash into his target, dealing AoE Pyro DMG.\nAfter bashing its target, Man Chai will roll to a nearby location before moving towards Gaming. When it links up with Gaming, Man Chai will leave the field and reset the CD for Gaming's Elemental Skill, Bestial Ascent.\nWhile Wushou Stance is active, his resistance to interruption is increased, and when Gaming lands with Charmed Cloudstrider attack or completes the forward pounce attack from Bestial Ascent with over 50% HP, he will summon Man Chai again.\nEach Gaming can only have 1 Man Chai on the field simultaneously.\nThis effect will be canceled once Gaming leaves the field.",
        "icon": "/img/talents/gaming_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Dance of Amity",
          "description": "After Bestial Ascent's Plunging Attack: Charmed Cloudstrider hits an opponent, Gaming will regain 1.5% of his Max HP once every 0.2s for 0.8s.",
          "icon": "/img/talents/gaming_passive1.png"
        },
        {
          "name": "Air of Prosperity",
          "description": "When Gaming has less than 50% HP, he will receive a 20% Incoming Healing Bonus. When Gaming has 50% HP or more, Plunging Attack: Charmed Cloudstrider will deal 20% more DMG.",
          "icon": "/img/talents/gaming_passive2.png"
        },
        {
          "name": "The Striding Beast",
          "description": "Increases the Movement SPD of your own party members by 10% during the day (6:00  18:00).\nDoes not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/gaming_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Ganyu",
    "talents": {
      "normalAttack": {
        "name": "Liutian Archery",
        "description": "Normal Attack\nPerform up to 6 consecutive shots with a bow.\nCharged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, an icy aura will accumulate on the arrowhead before the arrow is fired.\nHas different effects based on how long the energy has been charged\nCharge Level 1\nFires off an icy arrow that deals Cryo DMG.\nCharge Level 2\nFires off a Frostflake Arrow that deals Cryo DMG.\nThe Frostflake Arrow blooms after hitting its target, dealing AoE Cryo DMG.",
        "icon": "/img/talents/ganyu_attack.png"
      },
      "elementalSkill": {
        "name": "Trail of the Qilin",
        "description": "Leaving a single Ice Lotus behind, Ganyu dashes backward, shunning all impurity and dealing AoE Cryo DMG.\nThe Ice Lotus continuously taunts surrounding opponents, attracting them to attack it. Its endurance scales based on Ganyu's Max HP, and it blooms profusely when destroyed or once its duration ends, dealing AoE Cryo DMG.",
        "icon": "/img/talents/ganyu_skill.png"
      },
      "elementalBurst": {
        "name": "Celestial Shower",
        "description": "Coalesces atmospheric frost and snow to summon a Sacred Cryo Pearl that exorcises evil.\nWhile active, the Sacred Cryo Pearl will continuously rain down shards of ice, striking opponents within its AoE and dealing Cryo DMG.",
        "icon": "/img/talents/ganyu_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Undivided Heart",
          "description": "After firing a Frostflake Arrow, the CRIT Rate of subsequent Frostflake Arrows and their resulting bloom effects is increased by 20% for 5s.",
          "icon": "/img/talents/ganyu_passive1.png"
        },
        {
          "name": "Harmony between Heaven and Earth",
          "description": "Celestial Shower grants a 20% Cryo DMG Bonus to active members in the AoE.",
          "icon": "/img/talents/ganyu_passive2.png"
        },
        {
          "name": "Preserved for the Hunt",
          "description": "Refunds 15% of the ores used when crafting Bow-type weapons.",
          "icon": "/img/talents/ganyu_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Gorou",
    "talents": {
      "normalAttack": {
        "name": "Ripping Fang Fletching",
        "description": "Normal Attack\nPerform up to 4 consecutive shots with a bow.\nCharged Attack\nPerform a more precise Aimed Shot with increased DMG.\nWhile aiming, stone crystals will accumulate on the arrowhead. A fully charged crystalline arrow will deal Geo DMG.\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/gorou_attack.png"
      },
      "elementalSkill": {
        "name": "Inuzaka All-Round Defense",
        "description": "Deals AoE Geo DMG and sets up a General's War Banner.\nGeneral's War Banner\nProvides up to 3 buffs to active characters within the skill's AoE based on the number of Geo characters in the party at the time of casting:\n- 1 Geo character: Adds \"Standing Firm\" - DEF Bonus.\n- 2 Geo characters: Adds \"Impregnable\" - Increased resistance to interruption.\n- 3 Geo characters: Adds \"Crunch\" - Geo DMG Bonus.\nGorou can deploy only 1 General's War Banner on the field at any one time. Characters can only benefit from 1 General's War Banner at a time. When a party member leaves the field, the active buff will last for 2s.\nHold\nAdjust the location of the skill.",
        "icon": "/img/talents/gorou_skill.png"
      },
      "elementalBurst": {
        "name": "Juuga: Forward Unto Victory",
        "description": "Displaying his valor as a general, Gorou deals AoE Geo DMG and creates a field known as General's Glory to embolden his comrades.\nGeneral's Glory\nThis field has the following properties:\n- Like the General's War Banner created by Inuzaka All-Round Defense, provides buffs to active characters within the skill's AoE based on the number of Geo characters in the party. Also moves together with your active character.\n- Generates 1 Crystal Collapse every 1.5s that deals AoE Geo DMG to 1 opponent within the skill's AoE.\n- Pulls 1 elemental shard in the skill's AoE to your active character's position every 1.5s (elemental shards are created by Crystallize reactions).\nIf a General's War Banner created by Gorou currently exists on the field when this ability is used, it will be destroyed. In addition, for the duration of General's Glory, Gorou's Elemental Skill \"Inuzaka All-Round Defense\" will not create the General's War Banner.\nIf Gorou falls, the effects of General's Glory will be cleared.",
        "icon": "/img/talents/gorou_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Seeker of Shinies",
          "description": "Displays the location of nearby resources unique to Inazuma on the mini-map.",
          "icon": "/img/talents/gorou_passive1.png"
        },
        {
          "name": "Heedless of the Wind and Weather",
          "description": "After using Juuga: Forward Unto Victory, all nearby party members' DEF is increased by 25% for 12s.",
          "icon": "/img/talents/gorou_passive2.png"
        },
        {
          "name": "A Favor Repaid",
          "description": "Gorou receives the following DMG Bonuses to his attacks based on his DEF:\n- Inuzaka All-Round Defense: Skill DMG increased by 156% of DEF\n- Juuga: Forward Unto Victory: Skill DMG and Crystal Collapse DMG increased by 15.6% of DEF",
          "icon": "/img/talents/gorou_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Hu Tao",
    "talents": {
      "normalAttack": {
        "name": "Secret Spear of Wangsheng",
        "description": "Normal Attack\nPerforms up to 6 consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/hu_tao_attack.png"
      },
      "elementalSkill": {
        "name": "Guide to Afterlife",
        "description": "Paramita Papilio\nIncreases Hu Tao's ATK based on her Max HP at the time of entering this state. ATK Bonus gained this way cannot exceed 400% of Hu Tao's Base ATK.\nConverts attack DMG to Pyro DMG, which cannot be overridden by any other elemental infusion.\nIncreases Hu Tao's resistance to interruption.\n\nBlood Blossom\nEnemies affected by Blood Blossom will take Pyro DMG every 4s. This DMG is considered Elemental Skill DMG.\nEach enemy can be affected by only one Blood Blossom effect at a time, and its duration may only be refreshed by Hu Tao herself.\n\nParamita Papilio ends when its duration is over, or Hu Tao has left the battlefield or fallen.",
        "icon": "/img/talents/hu_tao_skill.png"
      },
      "elementalBurst": {
        "name": "Spirit Soother",
        "description": "Commands a blazing spirit to attack, dealing Pyro DMG in a large AoE.\nUpon striking the enemy, regenerates a percentage of Hu Tao's Max HP. This effect can be triggered up to 5 times, based on the number of enemies hit. If Hu Tao's HP is below or equal to 50% when the enemy is hit, both the DMG and HP Regeneration are increased.",
        "icon": "/img/talents/hu_tao_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Flutter By",
          "description": "When a Paramita Papilio state activated by Guide to Afterlife ends, all allies in the party (excluding Hu Tao herself) will have their CRIT Rate increased by 12% for 8s.",
          "icon": "/img/talents/hu_tao_passive1.png"
        },
        {
          "name": "Sanguine Rouge",
          "description": "When Hu Tao's HP is equal to or less than 50%, her Pyro DMG Bonus is increased by 33%.",
          "icon": "/img/talents/hu_tao_passive2.png"
        },
        {
          "name": "The More the Merrier",
          "description": "When Hu Tao cooks a dish perfectly, she has anm 18% chance to receive an additional \"Suspicious\" dish of the same type.",
          "icon": "/img/talents/hu_tao_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Jean",
    "talents": {
      "normalAttack": {
        "name": "Favonius Bladework",
        "description": "Normal Attack\nPerforms up to 5 consecutive strikes.\nCharged Attack\nConsumes a certain amount of Stamina to launch an enemy using the power of wind.\n\nLaunched enemies will slowly fall to the ground.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/jean_attack.png"
      },
      "elementalSkill": {
        "name": "Gale Blade",
        "description": "Focusing the might of the formless wind around her blade, Jean releases a miniature storm, launching enemies in the direction she aims at, dealing massive Anemo DMG.\nHold\nAt the cost of continued Stamina consumption, Jean can command the whirlwind to pull surrounding enemies towards her front.\n\nDirection can be adjusted.\n\nCharacter is immobile during skill duration.",
        "icon": "/img/talents/jean_skill.png"
      },
      "elementalBurst": {
        "name": "Dandelion Breeze",
        "description": "Calling upon the wind's protection, Jean creates a swirling Dandelion Field, launching surrounding enemies and causing Anemo DMG.\n\nAt the same time, she instantly regenerates a large amount of HP for nearby allied units and all party members. HP restored scale off Jean's ATK.\nDandelion Field\n\nContinuously regenerates HP for one ally and imbues them with the Anemo attribute.\nDeals Anemo DMG to enemies entering or exiting the field.\n",
        "icon": "/img/talents/jean_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Wind Companion",
          "description": "Hits by Normal Attacks have a 50% chance to regenerate HP equal to 15% of Jean's ATK for all party members.",
          "icon": "/img/talents/jean_passive1.png"
        },
        {
          "name": "Let the Wind Lead",
          "description": "Using Dandelion Breeze will regenerate 20% of its Energy.",
          "icon": "/img/talents/jean_passive2.png"
        },
        {
          "name": "Guiding Breeze",
          "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product.",
          "icon": "/img/talents/jean_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kachina",
    "talents": {
      "normalAttack": {
        "name": "Cragbiter",
        "description": "Normal Attack\nPerforms up to 4 consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kachina_attack.png"
      },
      "elementalSkill": {
        "name": "Go, Go Turbo Twirly!",
        "description": "Fight alongside the turbo trusty Turbo Twirly!\nSummons Turbo Twirly. When the skill is Held and released, Kachina will summon and ride Turbo Twirly.\nAfter the Skill is used, Kachina will gain 60 Nightsoul points and enter the Nightsoul's Blessing state.\n\nNightsoul's Blessing: Kachina\nTurbo Twirly's various actions consume Kachina's Nightsoul points.\nThe Nightsoul's Blessing state will end when these points have been depleted.\n\nTurbo Twirly\nCan exist independently or be ridden and operated by Kachina. When Turbo Twirly is present, Kachina's Elemental Skill, 'Go, Go Turbo Twirly!', will change to an option to Mount/Dismount Turbo Twirly.\nWhen present independent of Kachina, it will slam the ground at intervals, dealing Nightsoul-aligned AoE Geo DMG based on Kachina's DEF.\nWhen Kachina is riding Turbo Twirly, she can control it to move and climb swiftly, and use Normal Attacks to slam the ground, dealing Nightsoul-aligned AoE Geo DMG based on Kachina's DEF.\n\nTurbo Twirly will disappear once Kachina's Nightsoul's Blessing state ends, and it is considered a Geo Construct. 1 Turbo Twirly can exist on the field at any one time.",
        "icon": "/img/talents/kachina_skill.png"
      },
      "elementalBurst": {
        "name": "Time to Get Serious!",
        "description": "Striking the ground, Kachina deals AoE Geo DMG based on her DEF and creates a Turbo Drill Field.\nThe Field increases Turbo Twirly's attack AoE and its movement speed when Kachina is riding it.\n\nIf Kachina's own Turbo Twirly is present when this is used, Turbo Twirly will be summoned to her side.",
        "icon": "/img/talents/kachina_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Mountain Echoes",
          "description": "When nearby party members trigger a Nightsoul Burst, Kachina's Geo DMG Bonus increases by 20% for 12s.",
          "icon": "/img/talents/kachina_passive1.png"
        },
        {
          "name": "The Weight of Stone",
          "description": "Turbo Twirly's DMG is increased by 20% of Kachina's DEF.",
          "icon": "/img/talents/kachina_passive2.png"
        },
        {
          "name": "Heart of Unity",
          "description": "After her Nightsoul points are depleted, Kachina will switch to consuming Phlogiston to maintain her Nightsoul's Blessing.\nWhile in an area with Phlogiston Mechanics within Natlan, she can use Nightsoul Transmission: Kachina. When the active character is currently sprinting, climbing, in a movement mode caused by certain Talents, or at a certain height in the air, the following will trigger when switching to Kachina: Kachina will enter the Nightsoul's Blessing state and ride Turbo Twirly when taking the field while gaining 30 Nightsoul points. Nightsoul Transmission can be triggered once every 10s by your own team.\n\nAdditionally, while in Natlan, Kachina will consume 90% less Stamina when climbing while riding Turbo Twirly.",
          "icon": "/img/talents/kachina_passive3.png"
        },
        {
          "name": "Boon of Crystal Flame",
          "description": "While in an area with Phlogiston Mechanics within Natlan, 20 Stamina will be restored when interacting with some harvestable items. Additionally, the location of nearby resources unique to Natlan will appear on your mini-map.",
          "icon": "/img/talents/kachina_passive4.png"
        }
      ]
    }
  },
  {
    "character": "Kaeya",
    "talents": {
      "normalAttack": {
        "name": "Ceremonial Bladework",
        "description": "Normal Attack\nPerforms up to 5 consecutive strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemeies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kaeya_attack.png"
      },
      "elementalSkill": {
        "name": "Frostgnaw",
        "description": "Unleashes a frigit blast, dealing Cryo DMG to enemies in front of Kaeya.",
        "icon": "/img/talents/kaeya_skill.png"
      },
      "elementalBurst": {
        "name": "Glacial Waltz",
        "description": "Coalescing the frost in the air, Kaeya summons 3 icicles that revolve around him.\n\nThese icicles will follow the character around and deal Cryo DMG to enemies in their path for so long as they persist.",
        "icon": "/img/talents/kaeya_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Cold-Blooded Strike",
          "description": "Every hit with Frostgnaw regenerates HP for Kaeya equal to 15% of ATK.",
          "icon": "/img/talents/kaeya_passive1.png"
        },
        {
          "name": "Glacial Heart",
          "description": "Enemies Frozen by Frostgnaw will drop additional Elemental Particles.\nFrostgnaw may only produce a maximum of 2 additional Elemental Particles per use.",
          "icon": "/img/talents/kaeya_passive2.png"
        },
        {
          "name": "Hidden Strength",
          "description": "Decreases all party member's sprinting Stamina consumption by 20%.",
          "icon": "/img/talents/kaeya_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kaveh",
    "talents": {
      "normalAttack": {
        "name": "Schematic Setup",
        "description": "Normal Attack\nUses Mehrak to perform up to 4 consecutive attacks.\nCharged Attack\nDrains Stamina over time to perform continuous slashes.\nAt the end of the sequence, performs a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kaveh_attack.png"
      },
      "elementalSkill": {
        "name": "Artistic Ingenuity",
        "description": "Uses Mehrak's mapping ability for offensive purposes, initiating a radial scan that deals AoE Dendro DMG. It will also scan all Dendro Cores in its AoE and cause them to immediately burst.\nMehrak was created through the modification of ancient technology and may have some other functions apart from mapping work...",
        "icon": "/img/talents/kaveh_skill.png"
      },
      "elementalBurst": {
        "name": "Painted Dome",
        "description": "Completely unleashes Mehrak's energy and creates a cubic scanned space, dealing AoE Dendro DMG to all opponents within it, causing all Dendro Cores in its AoE to immediately burst, and granting Kaveh the following enhanced combat abilities for a specific duration:\nIncreases Kaveh's Normal, Charged, and Plunging Attack AoE, and converts his attack DMG to Dendro DMG that cannot be overridden.\nAll Dendro Cores created by all your own party members through Bloom reactions will deal additional DMG when they burst.\nIncreases Kaveh's resistance to interruption.\nThese effects will be canceled once Kaveh leaves the field.\n\"Every building style includes the architect's unique worldview, and from this angle, one can say that the buildings themselves are coalescences of human memories.\"",
        "icon": "/img/talents/kaveh_burst.png"
      },
      "passiveTalents": [
        {
          "name": "The Art of Budgeting",
          "description": "When Kaveh crafts Landscape, Building, and Courtyard-type Furnishings, he has a 100% chance to refund a portion of the materials used.",
          "icon": "/img/talents/kaveh_passive1.png"
        },
        {
          "name": "An Architect's Undertaking",
          "description": "When DMG dealt by a Dendro Core (including DMG from Burgeon and Hyperbloom) hits Kaveh, Kaveh will regain HP equal to 300% of his Elemental Mastery. This effect can be triggered once every 0.5s.",
          "icon": "/img/talents/kaveh_passive2.png"
        },
        {
          "name": "A Craftsman's Curious Conceptions",
          "description": "During Painted Dome, after Kaveh's Normal, Charged, or Plunging Attacks hit opponents, his Elemental Mastery will increase by 25. This effect can be triggered once every 0.1s. Max 4 stacks.\nThis effect will be canceled when Painted Dome's effects end.",
          "icon": "/img/talents/kaveh_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kaedehara Kazuha",
    "talents": {
      "normalAttack": {
        "name": "Garyuu Bladework",
        "description": "Normal Attack\nPerform up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact. If this Plunging Attack is triggered by Chihayaburu, it will be converted to Plunging Attack: Midare Ranzan.\nPlunging Attack: Midare Ranzan\nWhen a Plunging Attack is performed using the effects of the Elemental Skill Chihayaburu, Plunging Attack DMG is converted to Anemo DMG and will create a small wind tunnel via a secret blade technique that pulls in nearby objects and opponents.",
        "icon": "/img/talents/kaedehara_kazuha_attack.png"
      },
      "elementalSkill": {
        "name": "Chihayaburu",
        "description": "Unleashes a secret technique as fierce as the rushing wind that pulls objects and opponents towards Kazuha's current position before launching opponents within the AoE, dealing Anemo DMG and lifting Kazuha into the air on a rushing gust of wind.\nPress\nCan be used in mid-air.\nHold\nCharges up before unleashing greater Anemo DMG over a larger AoE than Press Mode.\nPlunging Attack: Midare Ranzan\nWithin 10s of remaining airborne after casting Chihayaburu, Kazuha can unleash a powerful Plunging Attack known as Midare Ranzan.\nWhen a Plunging Attack is performed using the effects of the Elemental Skill Chihayaburu, Plunging Attack DMG is converted to Anemo DMG. On landing, Kazuha creates a small wind tunnel via a secret blade technique that pulls in nearby objects and opponents. Midare Ranzan's DMG is considered Plunging Attack DMG.",
        "icon": "/img/talents/kaedehara_kazuha_skill.png"
      },
      "elementalBurst": {
        "name": "Kazuha Slash",
        "description": "The signature technique of Kazuha's self-styled bladework  a single slash that strikes with the force of the first winds of autumn, dealing AoE Anemo DMG. The blade's passage will leave behind a field named \"Autumn Whirlwind\" that periodically deals AoE Anemo DMG to opponents within its range.\nElemental Absorption: If Autumn Whirlwind comes into contact with Hydro/Pyro/Cryo/Electro, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use.",
        "icon": "/img/talents/kaedehara_kazuha_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Soumon Swordsmanship",
          "description": "If Chihayaburu comes into contact with Hydro/Pyro/Cryo/Electro when cast, Chihayaburu will absorb that element and if Plunging Attack: Midare Ranzan is used before the effect expires, it will deal an additional 200% ATK of the absorbed elemental type as DMG. This will be considered Plunging Attack DMG.\nElemental Absorption may only occur once per use of Chihayaburu.",
          "icon": "/img/talents/kaedehara_kazuha_passive1.png"
        },
        {
          "name": "Poetics of Fuubutsu",
          "description": "Upon triggering a Swirl reaction, Kaedehara Kazuha will grant all party members a 0.04% Elemental DMG Bonus to the element absorbed by Swirl for every point of Elemental Mastery he has for 8s. Bonuses for different elements obtained through this method can co-exist.",
          "icon": "/img/talents/kaedehara_kazuha_passive2.png"
        },
        {
          "name": "Cloud Strider",
          "description": "Decreases sprinting Stamina consumption for your own party members by 20%.\nNot stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/kaedehara_kazuha_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Keqing",
    "talents": {
      "normalAttack": {
        "name": "Yunlai Swordsmanship",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemeies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/keqing_attack.png"
      },
      "elementalSkill": {
        "name": "Stellar Restoration",
        "description": "Hurls a Lightning Stiletto that annihilates her enemies like the swift thunder.\n\nWhen the Stiletto hits its target, it deals Electro DMG to enemies in a small AoE, and places a Stiletto Mark on the spot hit.\nHold\nHold to adjust the direction in which the Stiletto shall be thrown.\n\nStilettos thrown by the Hold attack mode can be suspended in mid-air, allowing Keqing to jump to them when using Stellar Restoration a second time.\nLightning Stiletto\nIf Keqing uses Stellar Restoration again or uses a Charged Attack while its duration lasts, it will clear the Stiletto Mark and produce different effects:\n\nIf she uses Stellar Restoration again, she will blink to the location of the Mark and unleashed one slashing attack that deals AoE Electro DMG. When blinking to a Stiletto that was thrown from a Holding attack, Keqing can leap across obstructing terrain.\nIf Keqing uses a Charged Attack, she will ignite a series of thundering cuts at the Mark's location, dealing AoE Electro DMG.\n",
        "icon": "/img/talents/keqing_skill.png"
      },
      "elementalBurst": {
        "name": "Starward Sword",
        "description": "Keqing unleashes the power of lightning, dealing Electro DMG in an AoE.\nShe then blends into the shadow of her blade, striking a series of thunderclap-blows to nearby enemies simultaneous that deal multiple instance of Electro DMG. The final attack deals massive AoE Electro DMG.",
        "icon": "/img/talents/keqing_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Thundering Penance",
          "description": "Within 5s of recasting Stellar Restoration while a Lightning Stiletto is present, Keqing's Normal and Charged Attacks are converted to Electro DMG.",
          "icon": "/img/talents/keqing_passive1.png"
        },
        {
          "name": "Aristocratic Dignity",
          "description": "When casting Starward Sword, Keqing's CRIT Rate is increased by 15%, and her Energy Recharge is increased by 15%. This effect lasts for 8s.",
          "icon": "/img/talents/keqing_passive2.png"
        },
        {
          "name": "Land's Overseer",
          "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%.",
          "icon": "/img/talents/keqing_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kinich",
    "talents": {
      "normalAttack": {
        "name": "Nightsun Style",
        "description": "Normal Attack\nPerforms up to 3 rapid strikes.\nAfter using his Elemental Skill 'Canopy Hunter: Riding High's' mid-air swing, he can perform a Normal Attack in mid-air before landing.\n\nCharged Attack\nConsumes a certain amount to spin and throw his Claymore forward to attack opponents.\n\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kinich_attack.png"
      },
      "elementalSkill": {
        "name": "Canopy Hunter: Riding High",
        "description": "Kinich can swing in mid-air using a grappling hook. When the grappling hook hits an enemy, it attaches to enemies and Kinich will fire Loop Shots. When Nightsoul points are at max, he can use the Elemental Skill to fire a powerful \"Scalespiker Cannon\" and deal Dendro DMG to enemies.",
        "icon": "/img/talents/kinich_skill.png"
      },
      "elementalBurst": {
        "name": "Hail to the Almighty Dragonlord",
        "description": "Unleashes the power of the Almighty Dragonlord, K'uhul Ajaw. Ajaw will unleash his Dragon Breath at intervals, dealing AoE Dendro DMG.",
        "icon": "/img/talents/kinich_burst.png"
      },
      "passiveTalents": [
        {
          "name": "The Price of Desolation",
          "description": "When Kinich is in Nightsoul's Blessing state, opponents hit by his Elemental Skill will enter the Desolation state, and when affected by Burning or Burgeon reaction DMG, they will restore 7 Nightsoul points to him. Nightsoul points can be gained this way once every 0.8s. The Desolation state will persist until this instance of Kinich's Nightsoul's Blessing state ends.",
          "icon": "/img/talents/kinich_passive1.png"
        },
        {
          "name": "Flame Spirit Pact",
          "description": "After a nearby party member triggers a Nightsoul Burst, Kinich will gain 1 stack of Hunter's Experience that lasts 15s. Max 2 stacks. When Kinich uses Canopy Hunter: Riding High's Scalespiker Cannon, all stacks of Hunter's Experience will be consumed, with each stack consumed increasing the DMG dealt by this Cannon shot by 320% of Kinich's ATK.",
          "icon": "/img/talents/kinich_passive2.png"
        },
        {
          "name": "Repaid in Full",
          "description": "When Kinich is in the air following Canopy Hunter: Riding High's mid-air swing, he can consume 10 Phlogiston points to perform another mid-air swing.\nWhile in an area with Phlogiston Mechanics within Natlan, he can use Nightsoul Transmission: Kinich. When the current active character is sprinting, in movement states that result from specific Talents, or in the air, when you switch to Kinich: Kinich will perform one of the following actions depending on the conditions met:\nWhen facing a Coilgrass Sigil that can be interacted with: He will fire a grappling hook towards it to move;\nWhen there are nearby opponents and you are in combat: Kinich will use Canopy Hunter: Riding High in the direction of the opponents;\nOtherwise, Kinich will fire a grappling hook and swing, prioritizing valid Coilgrass Sigils as grapple targets.\nNightsoul Transmission can be triggered once every 10s by your own party.\n\nWhen interacting with Coilgrass Sigils and other items that Yumkasaurs can interact with, 'Canopy Hunter: Riding High' will be converted to 'Yumkasaur Mimesis,' which causes interactions with such items to follow rules applicable to Yumkasaurs, and which will not put Canopy Hunter: Riding High on CD.",
          "icon": "/img/talents/kinich_passive3.png"
        },
        {
          "name": "Swift Envoy",
          "description": "While in an area with Phlogiston Mechanics within Natlan, interacting with some harvestable items will increase your own party members' Movement SPD by 15% for 10s. Additionally, the location of nearby resources unique to Natlan will appear on your mini-map.",
          "icon": "/img/talents/kinich_passive4.png"
        }
      ]
    }
  },
  {
    "character": "Kirara",
    "talents": {
      "normalAttack": {
        "name": "Boxcutter",
        "description": "Normal Attack\nPerforms up to 4 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 3 rapid claw strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kirara_attack.png"
      },
      "elementalSkill": {
        "name": "Meow-teor Kick",
        "description": "Press\nLeaps into the air with all the agility of a cat passing through the bushes, and thwacks her foes with a flying kick that deals AoE Dendro DMG while creating a Shield of Safe Transport. This will also briefly apply Dendro to Kirara. The shield will absorb Dendro DMG with 250% effectiveness. The shield's DMG absorption will be based on Kirara's Max HP and will not exceed a certain percentage of that Max HP. The remaining DMG absorption on a Shield of Safe Transport will stack on a new one when it is created, and its duration will reset.\nHold\nOut of her desire to \"deliver within half a day,\" Kirara deploys a Shield of Safe Transport identical to the one that can be created by pressing the skill. She will also curl up into a special express delivery box, entering the Urgent Neko Parcel state in order to move and fight more swiftly.\nUrgent Neko Parcel\nDeals Dendro DMG to opponents she crashes into. This effect can be triggered once on each opponent every 0.5s.\nWhen in this state, Kirara's movement speed, climbing speed, and jumping power are all increased, and her Stamina Consumption from climbing is increased.\nWhen the duration ends or the skill is used again, a Flipclaw Strike more powerful than the attack in the Press Mode will be unleashed, dealing AoE Dendro DMG.\nThe Urgent Neko Parcel state lasts a maximum of 10s. When the state ends, the skill will enter CD. The longer Kirara spends in this state, the longer the CD will be.\nSprinting or actively canceling climbing will end this state early.\n\"So you wanna know the secret to speedy deliveries? Well, it's all in the legs!\"",
        "icon": "/img/talents/kirara_skill.png"
      },
      "elementalBurst": {
        "name": "Secret Art: Surprise Dispatch",
        "description": "Smash opponents with a Special Delivery Package used for punishing parcel thieves, dealing AoE Dendro DMG. After the Special Delivery Package explodes, it will split up into many Cat Grass Cardamoms that will explode either upon contact with opponents or after a period of time, dealing AoE Dendro DMG.\n\"Hehe, that's right, this stuff was made to deal with those parcel thieves! Remember to leave a 5-star rating once you've received yours!\"",
        "icon": "/img/talents/kirara_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Cat's Creeping Carriage",
          "description": "When Kirara is in the party, animals who produce Fowl, Raw Meat, or Chilled Meat will not be startled when party members approach them.",
          "icon": "/img/talents/kirara_passive1.png"
        },
        {
          "name": "Bewitching, Betwitching Tails",
          "description": "When Kirara is in the Urgent Neko Parcel state of Meow-teor Kick, each impact against an opponent will grant her a stack of Reinforced Packaging. This effect can be triggered once for each opponent hit every 0.5s. Max 3 stacks. When the Urgent Neko Parcel state ends, each stack of Reinforced Packaging will create 1 Shield of Safe Transport for Kirara. The shields that are created this way will have 20% of the DMG absorption that the Shield of Safe Transport produced by Meow-teor Kick would have. If Kirara is already protected by a Shield of Safe Transport created by Meow-teor Kick, its DMG absorption will stack with these shields and its duration will reset.",
          "icon": "/img/talents/kirara_passive2.png"
        },
        {
          "name": "Pupillary Variance",
          "description": "Every 1,000 Max HP Kirara possesses will increase the DMG dealt by Meow-teor Kick by 0.4%, and the DMG dealt by Secret Art: Surprise Dispatch by 0.3%.",
          "icon": "/img/talents/kirara_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Klee",
    "talents": {
      "normalAttack": {
        "name": "Kaboom!",
        "description": "Normal Attack\nThrows things that go boom when they hit things! Perform up to 3 explosive attacks, dealing AoE Pyro DMG.\nCharged Attack\nConsumes a certain amount of Stamina and deals Pyro DMG to enemies after a short casting time.\nPlunging Attack\nGathering the power of Pyro, Klee plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Pyro DMG upon impact with the ground.",
        "icon": "/img/talents/klee_attack.png"
      },
      "elementalSkill": {
        "name": "Jumpy Dumpty",
        "description": "Jumpy Dumpty is tons of boom-bang-fun!\n\nWhen thrown, Jumpy Dumpty bounces thrice, igniting and dealing AoE Pyro DMG with every bounce.\nOn the third bounce, the bomb splits into many mines.\n\nThe mines will explode upon contact with enemies, or after a short period of time, dealing AoE Pyro DMG.\nStarts with 2 charges.",
        "icon": "/img/talents/klee_skill.png"
      },
      "elementalBurst": {
        "name": "Sparks 'n' Splash",
        "description": "Klee's Blazing Delight! For the duration of this ability, continuously summons Sparks 'n' Splash to attack nearby enemies, dealing AoE Pyro DMG.",
        "icon": "/img/talents/klee_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Pounding Surprise",
          "description": "When Jumpy Dumpty and Normal Attacks deal DMG, Klee has a 50% chance to obtain an Explosive Spark. This Explosive Spark is consumed by the next Charged Attack, which costs no Stamina and deals 50% increased DMG.",
          "icon": "/img/talents/klee_passive1.png"
        },
        {
          "name": "Sparkling Burst",
          "description": "When a Charged Attack results in a CRIT, all party members gain 2 Elemental Energy.",
          "icon": "/img/talents/klee_passive2.png"
        },
        {
          "name": "All Of My Treasures!",
          "description": "Displays the location of nearby resources unique to Mondstadt on the mini-map.",
          "icon": "/img/talents/klee_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Sangonomiya Kokomi",
    "talents": {
      "normalAttack": {
        "name": "The Shape of Water",
        "description": "Normal Attack\nPerforms up to 3 consecutive attacks that take the form of swimming fish, dealing Hydro DMG.\nCharged Attack\nConsumes a certain amount of Stamina to deal AoE Hydro DMG after a short casting time.\nPlunging Attack\nGathering the might of Hydro, Kokomi plunges towards the ground from mid-air, damaging all opponents in her path. Deals AoE Hydro DMG upon impact with the ground.",
        "icon": "/img/talents/sangonomiya_kokomi_attack.png"
      },
      "elementalSkill": {
        "name": "Kurage's Oath",
        "description": "Summons a \"bake-kurage\" created from water that can heal her allies.\nUsing this skill will apply the Wet status to Sangonomiya Kokomi.\n\nBake-Kurage:\nDeals Hydro DMG to surrounding opponents and heal nearby active characters at fixed intervals. This healing is based on Kokomi's Max HP.",
        "icon": "/img/talents/sangonomiya_kokomi_skill.png"
      },
      "elementalBurst": {
        "name": "Nereid's Ascension",
        "description": "The might of Watatsumi descends, dealing Hydro DMG to surrounding opponents, before robing Kokomi in a Ceremonial Garment made from the flowing waters of Sangonomiya.\n\nCeremonial Garment\nSangonomiya Kokomi's Normal Attack, Charged Attack and Bake-Kurage DMG are increased based on her Max HP.\nWhen her Normal and Charged Attacks hit opponents, Kokomi will restore HP for all nearby party members, and the amount restored is based on her Max HP.\nIncreases Sangonomiya Kokomi's resistance to interruption and allows her to move on the water's surface.\n\nThese effects will be cleared once Sangonomiya Kokomi leaves the field.",
        "icon": "/img/talents/sangonomiya_kokomi_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Tamanooya's Casket",
          "description": "If Sangonomiya Kokomi's own Bake-Kurage are on the field when she uses Nereid's Ascension, the Bake-Kurage's duration will be refreshed.",
          "icon": "/img/talents/sangonomiya_kokomi_passive1.png"
        },
        {
          "name": "Song of Pearls",
          "description": "While donning the Ceremonial Garment created by Nereid's Ascension, the Normal and Charged Attack DMG Bonus Sangonomiya Kokomi gains based on her Max HP will receive a further increase based on 15% of her Healing Bonus.",
          "icon": "/img/talents/sangonomiya_kokomi_passive2.png"
        },
        {
          "name": "Flawless Strategy",
          "description": "Sangonomiya Kokomi has a 25% Healing Bonus, but a 100% decrease in CRIT Rate.",
          "icon": "/img/talents/sangonomiya_kokomi_passive3.png"
        },
        {
          "name": "Princess of Watatsumi",
          "description": "Decreases swimming Stamina consumption for your own party members by 20%.\nNot stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/sangonomiya_kokomi_passive4.png"
        }
      ]
    }
  },
  {
    "character": "Kuki Shinobu",
    "talents": {
      "normalAttack": {
        "name": "Shinobu's Shadowsword",
        "description": "Normal Attack\nPerform up to 4 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kuki_shinobu_attack.png"
      },
      "elementalSkill": {
        "name": "Sanctifying Ring",
        "description": "Creates a Grass Ring of Sanctification at the cost of part of her HP, dealing Electro DMG to nearby opponents.\nGrass Ring of Sanctification\nFollows your current active character around. Deals Electro DMG to nearby opponents every 1.5s and restores HP for active character(s) within the ring's AoE based on Kuki Shinobu's Max HP.\nThe HP consumption from using this skill can only bring her to 20% HP.",
        "icon": "/img/talents/kuki_shinobu_skill.png"
      },
      "elementalBurst": {
        "name": "Gyoei Narukami Kariyama Rite",
        "description": "Stabs an evil-excoriating blade into the ground, creating a field that cleanses the area of all that is foul, dealing continuous Electro DMG to opponents within its AoE based on Shinobu's Max HP.\nIf Shinobu's HP is less than or equal to 50% when this skill is used, the field will last longer.",
        "icon": "/img/talents/kuki_shinobu_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Breaking Free",
          "description": "When Shinobu's HP is not higher than 50%, her Healing Bonus is increased by 15%.",
          "icon": "/img/talents/kuki_shinobu_passive1.png"
        },
        {
          "name": "Heart's Repose",
          "description": "Sanctifying Ring's abilities will be boosted based on Shinobu's Elemental Mastery:\nHealing amount will be increased by 75% of Elemental Mastery.\nDMG dealt is increased by 25% of Elemental Mastery.",
          "icon": "/img/talents/kuki_shinobu_passive2.png"
        },
        {
          "name": "Protracted Prayers",
          "description": "",
          "icon": "/img/talents/kuki_shinobu_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Layla",
    "talents": {
      "normalAttack": {
        "name": "Sword of the Radiant Path",
        "description": "Normal Attack\nPerforms up to 3 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/layla_attack.png"
      },
      "elementalSkill": {
        "name": "Nights of Formal Focus",
        "description": "Puts forth a shield known as the Curtain of Slumber, dealing AoE Cryo DMG.\nThe Curtain of Slumber's DMG Absorption is based on Layla's Max HP and absorbs Cryo DMG with 250% effectiveness. When the shield is deployed, Layla will have Cryo applied to her briefly.\nNight Stars and Shooting Stars\nWhile the Curtain of Slumber is active, it will create 1 Night Star that will be attached to it every 1.5s. When a character protected by this shield uses an Elemental Skill, 2 Night Stars will be created. Night Stars can be created once every 0.3s in this way. A maximum of 4 Night Stars can be accumulated at any one time.\nOnce the Curtain of Slumber has accumulated 4 Night Stars and there are opponents nearby, these Night Stars will transform into homing Shooting Stars that will be fired off in sequence, dealing Cryo DMG to any opponents hit.\nIf the Curtain of Slumber's duration ends or it is destroyed, the Night Stars will disappear. If they are already being fired off as Shooting Stars, these Shooting Stars will last until this wave of shots ends.\nNew Night Stars cannot be created until the previous wave of Shooting Stars has been fired completely.",
        "icon": "/img/talents/layla_skill.png"
      },
      "elementalBurst": {
        "name": "Dream of the Star-Stream Shaker",
        "description": "Unleashes a Celestial Dreamsphere that constantly fires Starlight Slugs at opponents within its AoE, dealing Cryo DMG.\nWhen a Starlight Slug hits, it will generate 1 Night Star for nearby Curtains of Slumber. Each Curtain of Slumber can gain 1 Night Star this way every 0.5s.",
        "icon": "/img/talents/layla_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Like Nascent Light",
          "description": "While the Curtain of Slumber is active, the Deep Sleep effect will activate each time the Curtain gains 1 Night Star:\nThe Shield Strength of a character under the effect of the Curtain of Slumber increases by 6%.\nThis effect can have a maximum of 4 stacks and persists until the Curtain of Slumber disappears.",
          "icon": "/img/talents/layla_passive1.png"
        },
        {
          "name": "Sweet Slumber Undisturbed",
          "description": "The DMG dealt by the Shooting Stars fired by Nights of Formal Focus is increased by 1.5% of Layla's Max HP.",
          "icon": "/img/talents/layla_passive2.png"
        },
        {
          "name": "Shadowy Dream-Signs",
          "description": "When Layla crafts Character Talent Materials, she has a 10% chance to receive double the product.",
          "icon": "/img/talents/layla_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Lisa",
    "talents": {
      "normalAttack": {
        "name": "Lightning Touch",
        "description": "Normal Attack\nPerform up to 4 lightning attacks that deal Electro DMG.\nCharged Attack\nConsumes a certain amount of Stamina to deal AoE Electro DMG after a short casting time.\nPlunging Attack\nGathering the might of Electro, Lisa plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Electro DMG upon impact with the ground.",
        "icon": "/img/talents/lisa_attack.png"
      },
      "elementalSkill": {
        "name": "Violet Arc",
        "description": "Channels the power of lightning to sweep bothersome matters away.\nPress\nReleases a homing Lightning Orb. On hit, it deals Electro DMG, and applies a stack of Conductive status (Max 3 stacks) to enemies in a small AoE.\nHold\nAfter an extended casting time, calls down lightning from the heavens, dealing massive Electro DMG to all nearby enemies.\n\nDeals great amounts of extra damage to enemies based on the number of Conductive stacks applied to them, and clears their Conductive status.",
        "icon": "/img/talents/lisa_skill.png"
      },
      "elementalBurst": {
        "name": "Lightning Rose",
        "description": "Summons a Lightning Rose that unleashes powerful lightning bolts, launching surrounding enemies and dealing Electro DMG.\n\nThe Lightning Rose will continuously emit lightning to knock back enemies and deal Electro DMG for so long as it persists.",
        "icon": "/img/talents/lisa_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Induced Aftershock",
          "description": "Hits by charged Attacks apply Violet Arc's Conductive status to enemies.",
          "icon": "/img/talents/lisa_passive1.png"
        },
        {
          "name": "Static Electricity Field",
          "description": "Enemies hit by Lightning Rose have their DEF decreased by 15% for 10s.",
          "icon": "/img/talents/lisa_passive2.png"
        },
        {
          "name": "General Pharmaceutics",
          "description": "When Lisa crafts a potion, she has a 20% chance to refund a portion of the crafting materials used.",
          "icon": "/img/talents/lisa_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Lynette",
    "talents": {
      "normalAttack": {
        "name": "Rapid Ritesword",
        "description": "Normal Attack\nPerforms up to 4 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/lynette_attack.png"
      },
      "elementalSkill": {
        "name": "Enigmatic Feint",
        "description": "Flicks her mantle and executes an Enigma Thrust, dealing Anemo DMG.\nWhen the Enigma Thrust hits an opponent, it will restore Lynette's HP based on her Max HP, and in the 4s afterward, she will lose a certain amount of HP per second.\nBased on whether you press or hold this ability, she will use Enigma Thrust differently.\nPress\nShe swiftly uses an Enigma Thrust.\nHold\nLynette will enter a high-speed Pilfering Shadow state and apply Shadowsign to a nearby opponent.\nWhen this high-speed state ends, Lynette will unleash her Enigma Thrust. If there is an opponent with Shadowsign applied to them nearby, Lynette will approach them in a flash before using Enigma Thrust.\nA maximum of 1 opponent can have Shadowsign at any one time. When this opponent gets too far from Lynette, the Shadowsign will be canceled.\nArkhe: Ousia\nAt specific intervals, Lynette will unleash a Surging Blade when she uses Enigma Thrust, dealing Ousia-aligned Anemo DMG.\n\"Now then, turn your eyes to the stage and continue to enjoy the performance. When I next appear, I'll be where you least expect.\"",
        "icon": "/img/talents/lynette_skill.png"
      },
      "elementalBurst": {
        "name": "Magic Trick: Astonishing Shift",
        "description": "Lynette raises her mantle high, dealing AoE Anemo DMG, using skillful sleight of hand to make a giant Bogglecat Box appear!\nBogglecat Box\nTaunts nearby opponents, attracting their attacks.\nDeals Anemo DMG to nearby opponents at intervals.\nWhen the Bogglecat Box comes into contact with Hydro/Pyro/Cryo/Electro, it will gain the corresponding element and additionally fire Vivid Shots that will deal DMG from that element at intervals.\nElemental Absorption of this kind will only occur once during this ability's duration.\n\"Look this way, and look closely. This is a time for miracles, just for us.\"",
        "icon": "/img/talents/lynette_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Loci-Based Mnemonics",
          "description": "Shows the location of nearby Recovery Orbs on the minimap. The underwater Stamina and HP gained from touching Orbs will be increased by 25%.",
          "icon": "/img/talents/lynette_passive1.png"
        },
        {
          "name": "Sophisticated Synergy",
          "description": "Within 10s after using Magic Trick: Astonishing Shift, when there are 1/2/3/4 Elemental Types in the party, all party members' ATK will be increased by 8%/12%/16%/20% respectively.",
          "icon": "/img/talents/lynette_passive2.png"
        },
        {
          "name": "Props Positively Prepped",
          "description": "After the Bogglecat Box summoned by Magic Trick: Astonishing Shift performs Elemental Conversion, Lynette's Elemental Burst will deal 15% more DMG. This effect will persist until the Bogglecat Box's duration ends.",
          "icon": "/img/talents/lynette_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Lyney",
    "talents": {
      "normalAttack": {
        "name": "Card Force Translocation",
        "description": "Normal Attack\nPerforms up to 4 consecutive shots with a bow.\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.\nCharged Attack\nPerforms a more precise Aimed Shot with increased DMG.\nWhile aiming, flames will run across the arrowhead before being fired. Different effects will occur based on the time spent charging.\nCharge Level 1: Fires off a Pyro-infused arrow, dealing Pyro DMG.\nCharge Level 2: Fires off a Prop Arrow that deals Pyro DMG, and upon hit, it will summon a Grin-Malkin Hat.\nWhen firing the Prop Arrow, and when Lyney has more than 60% HP, he will consume a portion of his HP to obtain 1 Prop Surplus stack. Max 5 stacks. The effect will be removed after the character spends 30s out of combat.\nThe lowest Lyney can drop to through this method is 60% of his Max HP.\nGrin-Malkin Hat\nCan taunt nearby opponents and attract their attacks. Each opponent can only be taunted by the Hat once every 5s.\nThe Hat will inherit a percentage of Lyney's Max HP.\nIf destroyed, or if its duration expires, it will fire off a Pyrotechnic Strike at 1 nearby opponent, dealing Pyro DMG.\n1 Hat can exist at any given time.\nArkhe: Pneuma\nAt certain intervals, the Prop Arrow will cause a Spiritbreath Thorn to descend upon its hit location, dealing Pneuma-aligned Pyro DMG.",
        "icon": "/img/talents/lyney_attack.png"
      },
      "elementalSkill": {
        "name": "Bewildering Lights",
        "description": "Lyney does a flourish with his hat, unleashing a firework surprise!\nWhen used, he will clear all current Prop Surplus stacks and deal AoE Pyro DMG to opponents in front of him. DMG will be increased according to the stacks cleared, and this will also regenerate Lyney's HP based on his Max HP.\nWhen a Grin-Malkin Hat created by Lyney is on the field, the fireworks will cause it to explode, dealing AoE Pyro DMG equal to that of a Pyrotechnic Strike.\nThe DMG dealt through the Grin-Malkin Hat in this way is considered Charged Attack DMG.\n\"Everyone knows that magicians will intentionally misdirect the audience... Ah, yes, while you were looking my way, the hat and assistant over there have both disappeared... Fascinating, is it not?\"",
        "icon": "/img/talents/lyney_skill.png"
      },
      "elementalBurst": {
        "name": "Wondrous Trick: Miracle Parade",
        "description": "Unleashing his magic, Lyney turns hinself into a Grin-Malkin Cat that can move around quickly. (Not to be mistaken for the Grin-Malkin Hat. They're two different props!)\nWhen the Grin-Malkin Cat gets close to opponents, it will send flames falling down on them, dealing at most 1 instance of Pyro DMG to each opponent. When the duration ends, he will dismiss the Grin-Malkin Cat and ignite fireworks that deal AoE Pyro DMG, summon 1 Grin-Malkin Hat, and grant himself 1 Prop Surplus stack.\nGrin-Malkin Cat can be actively canceled.\n\"Watch closely now. This is a time for miracles, and it belongs just to the two of us!\"",
        "icon": "/img/talents/lyney_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Trivial Observations",
          "description": "Displays the location of nearby resources unique to Fontaine on the mini-map.",
          "icon": "/img/talents/lyney_passive1.png"
        },
        {
          "name": "Perilous Performance",
          "description": "If Lyney consumes HP when firing off a Prop Arrow, the Grin-Malkin hat summoned by the arrow will, upon hitting an opponent, restore 3 Energy to Lyney and increase DMG dealt by 80% of his ATK.",
          "icon": "/img/talents/lyney_passive2.png"
        },
        {
          "name": "Conclusive Ovation",
          "description": "When dealing DMG to opponents affected by Pyro, Lyney will receive the following buffs:\nBase ATK increased by 60%.\nEach Pyro party member other than Lyney will cause this effect to receive a further 20% bonus.\nLyney can gain a total of 100% increased DMG to opponents affected by Pyro in this way.",
          "icon": "/img/talents/lyney_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Mika",
    "talents": {
      "normalAttack": {
        "name": "Spear of Favonius - Arrow's Passage",
        "description": "Normal Attack\nPerforms up to 5 consecutive strikes using his crossbow and spear.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/mika_attack.png"
      },
      "elementalSkill": {
        "name": "Starfrost Swirl",
        "description": "Mika uses his crossbow to attack, granting all nearby characters in your party Soulwind. When characters in the Soulwind state are on the field, their ATK SPD will be increased.\nWill take effect in different ways if Tapped or Held.\nTap\nFires a Flowfrost Arrow that can pierce through opponents, dealing Cryo DMG to enemies it comes into contact with.\nHold\nGoes into Aiming Mode, locking on to an opponent and firing a Rimestar Flare at them, dealing Cryo DMG. When the Rimestar Flare hits, it will rise before exploding, launching Rimestar Shards into a maximum of 3 other opponents, dealing Cryo DMG.\nStars burst 'neath the frosted skies.",
        "icon": "/img/talents/mika_skill.png"
      },
      "elementalBurst": {
        "name": "Skyfeather Song",
        "description": "Derives the ability to spur his teammates on from the recited prayers of the knightly order, regenerating HP for all nearby party members. This healing is based on Mika's Max HP and will grant them the Eagleplume state.\nEagleplume\nWhen the Normal Attacks of active characters affected by Eagleplume hit an opponent, Mika will help them regenerate HP based on his Max HP.\nCharacters affected by this state can only regenerate HP in this way once per short interval of time.\n\"Carry hope when in dire straits, and keep vigil when all is well... For that pure white plume shall at last guide the lost wayfarers.\"",
        "icon": "/img/talents/mika_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Demarcation",
          "description": "Displays the location of nearby resources unique to Mondstadt on the mini-map.",
          "icon": "/img/talents/mika_passive1.png"
        },
        {
          "name": "Suppressive Barrage",
          "description": "Per the following circumstances, the Soulwind state caused by Starfrost Swirl will grant characters the Detector effect, increasing their Physical DMG by 10% when they are on the field.\nIf the Flowfrost Arrow hits more than one opponent, each additional opponent hit will generate 1 Detector stack.\nWhen a Rimestar Shard hits an opponent, it will generate 1 Detector stack. Each Rimestar Shard can trigger the effect 1 time.\nThe Soulwind state can have a maximum of 3 Detector stacks, and if Starfrost Swirl is cast again during this duration, the pre-existing Soulwind state and all its Detector stacks will be cleared.",
          "icon": "/img/talents/mika_passive2.png"
        },
        {
          "name": "Topographical Mapping",
          "description": "When an active character affected by both Skyfeather Song's Eagleplume and Starfrost Swirl's Soulwind at once scores a CRIT Hit with their attacks, Soulwind will grant them 1 stack of Detector from Suppressive Barrage. During a single instance of Soulwind, 1 Detector stack can be gained in this manner.\nAdditionally, the maximum number of stacks that can be gained through Soulwind alone is increased by 1.\nRequires Suppressive Barrage to be unlocked first.",
          "icon": "/img/talents/mika_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Mona",
    "talents": {
      "normalAttack": {
        "name": "Ripple of Fate",
        "description": "Normal Attack\nPerforms up to 4 water splash attacks that deal Hydro DMG.\nCharged Attack\nConsumes a certain amount of Stamina and deals AoE Hydro DMG after a short casting time.\nPlunging Attack\nGathering the might of Hydro, Mona plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Hydro DMG upon impact with the ground.",
        "icon": "/img/talents/mona_attack.png"
      },
      "elementalSkill": {
        "name": "Reflection of Doom",
        "description": "Creates an illusory Phantom of fate from coalesced waterspouts.\n\nThe Phantom has the following special properties:\n\nContinuously taunts nearby enemies, attracting their fire.\nContinuously deals Hydro DMG to nearby enemies.\nWhen its duration expires, the Phantom explodes, dealing AoE Hydro DMG.\n\nHold\nUtilizes water currents to move backwards swiftly before conjuring a Phantom.\n\nOnly one Phantom created by Mirror Reflection of Doom can exist at any time.\n",
        "icon": "/img/talents/mona_skill.png"
      },
      "elementalBurst": {
        "name": "Stellaris Phantasm",
        "description": "Mona summons the sparkling waves and creates a reflection of the starry sky, applying the Illusory Bubble status to opponents in a large AoE.\nIllusory Bubble\nTraps opponents inside a pocket of destiny and also makes them Wet. Renders weaker opponents immobile. When an opponent affected by Illusory Bubble sustains DMG, the following effects are produced:\n\nApplies an Omen to the opponent, which gives a DMG Bonus, also increasing the DMG of the attack that causes it.\nRemoves the Illusory Bubble, dealing Hydro Elemental DMG in the process. The DMG Bonus does not apply to the Hydro Elemental DMG dealt in this instance.\n\nOmen\nDuring its duration, increases DMG taken by enemies.",
        "icon": "/img/talents/mona_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Come 'n' Get Me, Hag!",
          "description": "After she has used Illusory Torrent for 2s, if there are any enemies nearby, Mona will automatically create a Phantom.\nA Phantom created in this manner lasts for 2s, and its explosion DMG is equal to 50% of Mirror Reflection of Doom.",
          "icon": "/img/talents/mona_passive1.png"
        },
        {
          "name": "Waterborne Destiny",
          "description": "Increases Mona's Hydro DMG Bonus by a degree equivalent to 20% of her Energy Recharge rate.",
          "icon": "/img/talents/mona_passive2.png"
        },
        {
          "name": "Principium of Astrology",
          "description": "When Mona crafts Weapon Ascension Materials, she has a 25% chance to refund a portion of the crafting materials used.",
          "icon": "/img/talents/mona_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Mualani",
    "talents": {
      "normalAttack": {
        "name": "Cooling Treatment",
        "description": "Normal Attack\nPerforms up to 3 attacks that deal Hydro DMG.\n\nCharged Attack\nConsumes a certain amount of Stamina to smack a Pufferball into the air that deals AoE Hydro DMG upon landing.\n\nPlunging Attack\nGathers the power of Hydro and plunges towards the ground from mid-air, damaging all opponents in her path. Deals AoE Hydro DMG upon impact with the ground.",
        "icon": "/img/talents/mualani_attack.png"
      },
      "elementalSkill": {
        "name": "Surfshark Wavebreaker",
        "description": "Combining her mastery of speed and the waves and water, Mualani can surf anytime, anywhere.\nAfter using this skill, Mualani will gain 60 Nightsoul points and enter the Nightsoul's Blessing state.\n\nNightsoul's Blessing: Mualani\nContinuously consume Nightsoul points. When they are depleted or when the skill is used again, Mualani's Nightsoul's Blessing will end. The state itself has the following traits:\nMualani mounts her Sharky Surfboard, increasing Mualani's Movement SPD and interruption resistance. Mualani can move on water and liquid Phlogiston while this state is active, and she will take no DMG from the latter.\nNormal Attacks will be converted to Sharky's Bites, dealing Nightsoul-aligned Hydro DMG based on Mualani's Max HP. Sharky's Bites can be used in mid-air. DMG dealt this way is considered Normal Attack DMG.\nWhen she makes contact with opponents in this state, Mualani applies 'Marked as Prey' to them and gains 1 Wave Momentum stack. Max 3 stacks. 1 stack can be gained from the same opponent every 0.7s.\n\nWave Momentum and Marked as Prey\nWhen Mualani uses Sharky's Bite, her DMG dealt increases based on Wave Momentum stacks. When she has 3 stacks, a Normal Attack will use Sharky's Surging Bite instead, further increasing her DMG and removing all her stacks afterward.\nWhen Sharky's Bites hit opponents Marked as Prey, that mark is removed, and she will fire Shark Missiles at up to 5 nearby opponents Marked as Prey, dealing DMG to them equal to this Sharky's Bite instance and clearing their Marks. If more than 1 opponent is the target of Sharky's Bite and Shark Missiles, the DMG dealt will decrease, with 28% being the maximum decrease when at least 3 opponents are targeted.",
        "icon": "/img/talents/mualani_skill.png"
      },
      "elementalBurst": {
        "name": "Boomsharka-laka",
        "description": "Fires a Super Shark Missile that can track opponents, dealing Nightsoul-aligned AoE Hydro DMG based on Mualani's Max HP.",
        "icon": "/img/talents/mualani_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Heat-Resistant Freshwater Floater",
          "description": "When Sharky's Surging Bite hits an opponent, a Puffer will be generated nearby. Mualani will restore 20 Nightsoul points when she picks up a Puffer. Only 2 such Puffers can be created in this way during a single instance of being in Nightsoul's Blessing.",
          "icon": "/img/talents/mualani_passive1.png"
        },
        {
          "name": "Natlan's Greatest Guide",
          "description": "When a nearby party member triggers a Nightsoul Burst, Mualani will gain 1 stack of Wavechaser's Exploits, which lasts for 20s. Max 3 stacks. When she uses Boomsharka-laka, Mualani will clear all Wavechaser's Exploits stacks and increase the DMG of this Boomsharka-laka by 15%/30%/45% of her Max HP based on the number of stacks cleared.",
          "icon": "/img/talents/mualani_passive2.png"
        },
        {
          "name": "Crests and Troughs",
          "description": "After her Nightsoul points are depleted, Mualani will switch to consuming Phlogiston to maintain her Nightsoul's Blessing.\nWhile in an area with Phlogiston Mechanics within Natlan, she can use Nightsoul Transmission: Mualani. When the active character is currently sprinting, swimming, in a movement mode caused by certain Talents, or at a certain height in the air, the following will trigger when switching to Mualani: Mualani will enter the Nightsoul's Blessing state and gain 40 Nightsoul points. Nightsoul Transmission can be triggered once every 10s by your own team.\n\nAdditionally, Mualani's Nightsoul point or Phlogiston consumption while moving on water and Liquid Phlogiston during Nightsoul's Blessing is decreased by 75% while in Natlan, and her Nightsoul point consumption is decreased by 35% while doing the same outside Natlan.",
          "icon": "/img/talents/mualani_passive3.png"
        },
        {
          "name": "The Trick Is to Keep Smiling!",
          "description": "While in an area with Phlogiston Mechanics within Natlan, 15 Phlogiston will be restored when interacting with some harvestable items. Additionally, the location of nearby resources unique to Natlan will appear on your mini-map.",
          "icon": "/img/talents/mualani_passive4.png"
        }
      ]
    }
  },
  {
    "character": "Nahida",
    "talents": {
      "normalAttack": {
        "name": "Akara",
        "description": "Normal Attack\nPerforms up to 4 attacks that deal Dendro DMG to opponents in front of her\nCharged Attack\nConsumes a certain amount of Stamina to deal AoE Dendro DMG to opponents in front of her after a short casting time.\nPlunging Attack\nCalling upon the might of Dendro, Nahida plunges towards the ground from mid-air, damaging all opponents in her path. Deals AoE Dendro DMG upon impact with the ground.",
        "icon": "/img/talents/nahida_attack.png"
      },
      "elementalSkill": {
        "name": "All Schemes to Know",
        "description": "Sends forth karmic bonds of wood and tree from her side, dealing AoE Dendro DMG and marking up to 8 opponents hit with the Seed of Skandha. When held, this skill will trigger differently.\nHold\nEnters Aiming Mode, which will allow you to select a limited number of opponents within a limited area. During this time, Nahida's resistance to interruption will be increased.\nWhen released, this skill deals Dendro DMG to these opponents and marks them with the Seed of Skandha.\nAiming Mode will last up to 5s and can select a maximum of 8 opponents.\nSeed of Skandha\nOpponents who have been marked by the Seed of Skandha will be linked to one another up till a certain distance.\nAfter you trigger Elemental Reactions on opponents who are affected by the Seeds of Skandha or when they take DMG from Dendro Cores (including Burgeon and Hyperbloom DMG), Nahida will unleash Tri-Karma Purification on the opponents and all connected opponents, dealing Dendro DMG based on her ATK and Elemental Mastery.You can trigger at most 1 Tri-Karma Purification within a short period of time.",
        "icon": "/img/talents/nahida_skill.png"
      },
      "elementalBurst": {
        "name": "Illusory Heart",
        "description": "Manifests the Court of Dreams and expands the Shrine of Maya.\nWhen the Shrine of Maya field is unleashed, the following effects will be separately unleashed based on the Elemental Types present within the party.\nPyro: While Nahida remains within the Shrine of Maya, the DMG dealt by Tri-Karma Purification from \"All Schemes to Know\" is increased.\nElectro: While Nahida remains within the Shrine of Maya, the interval between each Tri-Karma Purification from \"All Schemes to Know\" is decreased.\nHydro: The Shrine of Maya's duration is increased.\nIf there are at least 2 party members of the aforementioned Elemental Types present when the field is deployed, the aforementioned effects will be increased further.\nEven if Nahida is not on the field, these bonuses will still take effect so long as party members are within the Shrine of Maya.",
        "icon": "/img/talents/nahida_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Compassion Illuminated",
          "description": "When unleashing Illusory Heart, the Shrine of Maya will gain the following effects:\nThe Elemental Mastery of the active character within the field will be increased by 25% of the Elemental Mastery of the party member with the highest Elemental Mastery.\nYou can gain a maximum of 250 Elemental Mastery in this manner.",
          "icon": "/img/talents/nahida_passive1.png"
        },
        {
          "name": "Awakening Elucidated",
          "description": "Each point of Nahida's Elemental Mastery beyond 200 will grant 0.1% Bonus DMG and 0.03% CRIT Rate to Tri-Karma Purification from All Schemes to Know.\nA maximum of 80% Bonus DMG and 24% CRIT Rate can be granted to Tri-Karma Purification in this manner.",
          "icon": "/img/talents/nahida_passive2.png"
        },
        {
          "name": "On All Things Meditated",
          "description": "Nahida can use All Schemes to Know to interact with some harvestable items within a fixed AoE. This skill may even have some other effects...",
          "icon": "/img/talents/nahida_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Navia",
    "talents": {
      "normalAttack": {
        "name": "Blunt Refusal",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes.\nCharged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents.\nAt the end of the sequence, performs a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/navia_attack.png"
      },
      "elementalSkill": {
        "name": "Ceremonial Crystalshot",
        "description": "When a character in the party obtains an Elemental Shard created from the Crystallize reaction, Navia will gain 1 Crystal Shrapnel stack. Navia can have up to 6 stacks of Crystal Shrapnel at once. Each time Crystal Shrapnel gain is triggered, the duration of the Crystal Shrapnel stacks you already have will be reset.\nWhen she fires, Navia will consume all Crystal Shrapnel stacks and open her elegant yet lethal Gunbrella, firing multiple Rosula Shardshots that can penetrate opponents, dealing Geo DMG to opponents hit.\nWhen 0/1/2/3 or more stacks of Crystal Shrapnel are consumed,5/7/9/11 Rosula Shardshots will be fired respectively. The more Rosula Shardshots that strike a single opponent, the greater the DMG dealt to them. When all 11 Rosula Shardshots strike, 200% of the original amount of DMG is dealt.\nIn addition, when more than 3 stacks of Crystal Shrapnel are consumed, every stack consumed beyond those 3 will increase the DMG dealt by this Gunbrella attack by an additional 15%.\nHold\nEnter Aiming Mode, continually collecting nearby Elemental Shards created by Crystallize reactions. When released, fire Rosula Shardshots with the same effect as when the skill is Tapped.\nTwo initial charges.\nArkhe: Ousia\nPeriodically, when Navia fires her Gunbrella, a Surging Blade will be summoned, dealing Ousia-aligned Geo DMG.\n\"Maintaining the appropriate distance with those whom distance should be maintained is an essential part of etiquette. Naturally, there are also many ways to do this...\"",
        "icon": "/img/talents/navia_skill.png"
      },
      "elementalBurst": {
        "name": "As the Sunlit Sky's Singing Salute",
        "description": "On the orders of the President of the Spina di Rosula, call for a magnificent Rosula Dorata Salute. Unleashes a massive cannon bombardment on opponents in front of her, dealing AoE Geo DMG and providing Cannon Fire Support for a duration afterward, periodically dealing Geo DMG to nearby opponents.\nWhen cannon attacks hit opponents, Navia will gain 1 stack of Crystal Shrapnel. This effect can be triggered up to once every 2.4s.\n\"The Spina di Rosula's salute is a preemptive celebration of the successful conclusion of our negotiations and is fired just before talks begin. Don't misunderstand, it isn't in any way, shape, or form some kind of threat.\"",
        "icon": "/img/talents/navia_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Painstaking Transaction",
          "description": "Gains 25% more rewards when dispatched on a Fontaine Expedition for 20 hours.",
          "icon": "/img/talents/navia_passive1.png"
        },
        {
          "name": "Undisclosed Distribution Channels",
          "description": "For 4s after using Ceremonial Crystalshot, the DMG dealt by Navia's Normal Attacks, Charged Attacks, and Plunging Attacks will be converted into Geo DMG which cannot be overridden by other Elemental infusions, and the DMG dealt by Navia's Normal Attacks, Charged Attacks, and Plunging Attacks will be increased by 40%.",
          "icon": "/img/talents/navia_passive2.png"
        },
        {
          "name": "Mutual Assistance Network",
          "description": "For each Pyro/Electro/Cryo/Hydro party member, Navia gains 20% increased ATK. This effect can stack up to 2 times.",
          "icon": "/img/talents/navia_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Neuvillette",
    "talents": {
      "normalAttack": {
        "name": "As Water Seeks Equilibrium",
        "description": "Normal Attack\nWith light flourishes, Neuvillette commands the tides to unleash a maximum of 3 attacks, dealing Hydro DMG.\nCharged Attack Empowerment: Legal Evaluation\nWhile charging up, Neuvillette will gather the power of water, forming it into a Seal of Arbitration. In this state, Neuvillette can move and change facing, and also absorb any Sourcewater Droplets in a certain AoE.\nEvery Droplet he absorbs will increase the formation speed of the Seal, and will heal Neuvillette.\nWhen the charging is stopped, if the Symbol has yet to be formed, then a Charged Attack will be unleashed. If it has been formed, then a Charged Attack: Equitable Judgment will be unleashed.\nCharged Attack\nConsumes a fixed amount of Stamina to attack opponents with a rupturing blast of water, dealing AoE Hydro DMG.\nCharged Attack: Equitable Judgment\nUnleashes surging torrents, dealing continuous AoE Hydro DMG to all opponents in a straight-line area in front of him.\nEquitable Judgment will not consume any Stamina and lasts 3s.\nIf Neuvillette's HP is above 50%, he will continuously lose HP while using this attack.\nPlunging Attack\nGathering the might of Hydro, Neuvillette plunges towards the ground from mid-air, damaging all opponents in his path. Deals AoE Hydro DMG upon impact with the ground.",
        "icon": "/img/talents/neuvillette_attack.png"
      },
      "elementalSkill": {
        "name": "O Tears, I Shall Repay",
        "description": "Summons a Raging Waterfall that will deal AoE Hydro DMG to opponents in front of Neuvillette based on his Max HP. After hitting an opponent, this skill will generate 3 Sourcewater Droplets near that opponent.\nArkhe: Pneuma\nAt certain intervals, when the Raging Waterfall descends, a Spiritbreath Thorn will descend that will pierce opponents, dealing Pneuma-aligned Hydro DMG.\n\"The law can restrict all manner of crimes, but it cannot extirpate evil itself.\"",
        "icon": "/img/talents/neuvillette_skill.png"
      },
      "elementalBurst": {
        "name": "O Tides, I Have Returned",
        "description": "Unleashes waves that will deal AoE Hydro DMG based on Neuvillette's Max HP. After a short interval, 2 waterfalls will descend and deal Hydro DMG in a somewhat smaller AoE, and will generate 6 Sourcewater Droplets within an area in front.\n\"The law is only established after its publication, and above that, the laws of nature have governed all species and eras since ancient times.\"",
        "icon": "/img/talents/neuvillette_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Gather Like the Tide",
          "description": "Increases underwater Sprint SPD for your own party members by 15%.\nNot stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/neuvillette_passive1.png"
        },
        {
          "name": "Heir to the Ancient Sea's Authority",
          "description": "When a party member triggers a Vaporize, Frozen, Electro-Charged, Bloom, Hydro Swirl, or a Hydro Crystallize reaction on opponents, 1 stack of Past Draconic Glories will be granted to Neuvillette for 30s. Max 3 stacks. Past Draconic Glories causes Charged Attack: Equitable Judgment to deal 110%/125%/160% of its original DMG.\nThe stacks of Past Draconic Glories created by each kind of Elemental Reaction exist independently.",
          "icon": "/img/talents/neuvillette_passive2.png"
        },
        {
          "name": "Discipline of the Supreme Arbitration",
          "description": "For each 1% of Neuvillette's current HP greater than 30% of Max HP, he will gain 0.6% Hydro DMG Bonus. A maximum bonus of 30% can be obtained this way.",
          "icon": "/img/talents/neuvillette_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Nilou",
    "talents": {
      "normalAttack": {
        "name": "Dance of Samser",
        "description": "Normal Attack\nPerforms up to 3 consecutive sword strikes.\nCharged Attack\nConsumes a certain amount of Stamina to perform a twirling slash.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/nilou_attack.png"
      },
      "elementalSkill": {
        "name": "Dance of Haftkarsvar",
        "description": "Nilou will enter the Pirouette state, dealing Hydro DMG to nearby opponents based on her Max HP.\nWhile she is in the Pirouette state, Nilou's Normal Attacks and Elemental Attacks will cause her to enter the Sword Dance and Whirling Steps stances respectively, causing DMG she deals to be converted to Hydro DMG that cannot be overridden and that is considered Elemental Skill DMG.\nIn these stances, Nilou's third dance step will end Pirouette, and has the following effects:\nSword Dance: unleashes a Luminous Illusion that deals Hydro DMG to opponents it touches and grants Nilou the Lunar Prayer effect. This effect converts Nilou's Normal Attacks into Sword Dance techniques, and her final hit will unleash a Luminous Illusion.\nWhirling Steps: Nilou unleashes a Whirling Water Wheel that deals AoE Hydro DMG and creates a Tranquility Aura that follows your active character around and applies Wet to opponents within its AoE.\nNilou is unable to perform Charged Attacks when under the effect of Pirouette or Lunar Prayer. These effects will be removed once she leaves the field.",
        "icon": "/img/talents/nilou_skill.png"
      },
      "elementalBurst": {
        "name": "Dance of Abzendegi: Distant Dreams, Listening Spring",
        "description": "Begins the dance of faraway dreams and springs that hear, causing a Lotus of Distant Waters to bloom, dealing AoE Hydro DMG based on Nilou's Max HP and applying the Lingering Aeon effect to all opponents hit. After an interval, opponents affected by Lingering Aeon will take Hydro DMG.",
        "icon": "/img/talents/nilou_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Court of Dancing Petals",
          "description": "When all characters in the party are all Dendro or Hydro, and there are at least one Dendro character and one Hydro character:\nThe completion of the third dance step of Nilou's Dance of Haftkarsvar will grant all nearby characters the Golden Chalice's Bounty for 30s.\nCharacters under the effect of Golden Chalice's Bounty will increase the Elemental Mastery of all nearby characters by 100 for 10s whenever they are hit by Dendro attacks. Also, triggering the Bloom reaction will create Bountiful Cores instead of Dendro Cores.\nSuch Cores will burst very quickly after being created, and they have larger AoEs.\nBountiful Cores cannot trigger Hyperbloom or Burgeon, and they share an upper numerical limit with Dendro Cores. Bountiful Core DMG is considered DMG dealt by Dendro Cores produced by Bloom.\nShould the party not meet the conditions for this Passive Talent, any existing Golden Chalice's Bounty effects will be canceled.",
          "icon": "/img/talents/nilou_passive1.png"
        },
        {
          "name": "Dreamy Dance of Aeons",
          "description": "Every 1,000 points of Nilou's Max HP above 30,000 will cause the DMG dealt by Bountiful Cores created by characters affected by Golden Chalice's Bounty to increase by 9%.\nThe maximum increase in Bountiful Core DMG that can be achieved this way is 400%.",
          "icon": "/img/talents/nilou_passive2.png"
        },
        {
          "name": "White Jade Lotus",
          "description": "When Perfect Cooking is achieved on Food with Adventure-related effects, there is a 12% chance to obtain double the product.",
          "icon": "/img/talents/nilou_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Ningguang",
    "talents": {
      "normalAttack": {
        "name": "Sparkling Scatter",
        "description": "Normal Attack\nShoots gems that deal Geo DMG.\n\nUpon hit, this grants Ningguang 1 Star Jade.\nCharged Attack\nConsumes a certain amount of Stamina to fire off a giant gem that deals Geo DMG.\n\nIf Ningguang has any Star Jades, unleashing a Charged Attack will cause the Star Jades to be fired at the enemy as well, dealing additional DMG.\nPlunging Attack\nGathering the might of Geo, Ningguang plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Geo DMG upon impact with the ground.",
        "icon": "/img/talents/ningguang_attack.png"
      },
      "elementalSkill": {
        "name": "Jade Screen",
        "description": "Ningguang creates a Jade Screen out of gold, obsidian and her great opulence, dealing AoE Geo DMG.\nJade Screen\n\nBlocks enemy projectiles.\nEndurance scales based on Ningguang's Max HP.\n\nJade Screen is considered a Geo Construct and can be used to block certain attacks, but cannot be climbed. Only one Jade Screen may exist at any one time.",
        "icon": "/img/talents/ningguang_skill.png"
      },
      "elementalBurst": {
        "name": "Starshatter",
        "description": "Gathering a great number of gems, Ningguang scatters them all at once, sending homing projectiles at her enemies that deal massive Geo DMG.\n\nIf Starshatter is cast when a Jade Screen is nearby, the Jade Screen will fire additional gem projectiles at the same time.",
        "icon": "/img/talents/ningguang_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Backup Plan",
          "description": "When Ningguang is in possession of Star Jades, her Charged Attack does not consume Stamina.",
          "icon": "/img/talents/ningguang_passive1.png"
        },
        {
          "name": "Strategic Reserve",
          "description": "A character that passes through the Jade Screen will gain a 12% Geo DMG Bonus for 10s.",
          "icon": "/img/talents/ningguang_passive2.png"
        },
        {
          "name": "Trove of Marvelous Treasure",
          "description": "Displays the location of nearby ore veins (Iron Ore, White Iron Ore, Crystal Ore, and Magical Crystal Ore) on the mini-map.",
          "icon": "/img/talents/ningguang_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Noelle",
    "talents": {
      "normalAttack": {
        "name": "Favonius Bladework - Maid",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes.\nCharged Attack\nDrains Stamina over time to perform continuous swirling attacks against all nearby enemies.\n\nAt end of the sequence, perform a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/noelle_attack.png"
      },
      "elementalSkill": {
        "name": "Breastplate",
        "description": "Summons a protective stone armor, dealing Geo DMG to surrounding enemies and creating a shield. The shield's DMG Absorption scaled based on Noelle's DEF.\n\nThe shield has the following properties:\n\nWhen Noelle's Normal and Charged Attacks hit a target, they have a certain chance to regenerate HP for all characters, both on and off the field.\nApplies the Geo element to the character.\nPossesses 250% Absorption Efficiency against Geo DMG.\n\nThe amount of HP healed when regeneration is triggered scales based on Noelle's DEF.",
        "icon": "/img/talents/noelle_skill.png"
      },
      "elementalBurst": {
        "name": "Sweeping Time",
        "description": "Gathering the strength of stone around her weapon, Noelle strikes the enemies surrounding her within a large AoE, dealing Geo DMG.\n\nAfterwards, Noelle gains the following effects:\n\nLarger attack AoE.\nConverts attack DMG to Geo DMG.\nIncreased ATK that scales based on her DEF.\n",
        "icon": "/img/talents/noelle_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Devotion",
          "description": "When Noelle is in the party but not on the field, this ability triggers automatically when the active character's HP falls below 30%:\nCreates a shield that lasts for 20s and absorbs DMG equal to 400% of Noelle's DEF. This effect can only occur once every 60s.",
          "icon": "/img/talents/noelle_passive1.png"
        },
        {
          "name": "Nice and Clean",
          "description": "Every 4 Normal or Charged Attack hits will decrease the CD of Breastplate by 1s.\nHitting multiple enemies with a single attack is only counted as 1 hit.",
          "icon": "/img/talents/noelle_passive2.png"
        },
        {
          "name": "Maid's Knighthood",
          "description": "When a Perfect Cooking is achieved on a DEF-boosting dish, Noelle has a 12% chance to obtain double the product.",
          "icon": "/img/talents/noelle_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Qiqi",
    "talents": {
      "normalAttack": {
        "name": "Ancient Sword Art",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/qiqi_attack.png"
      },
      "elementalSkill": {
        "name": "Adeptus Art: Herald of Frost",
        "description": "Using the Icevein Talisman, Qiqi brings forth the Herald of Frost, dealing Cryo DMG to nearby enemies.\nHerald of Frost\n\nWhen Qiqi hits a target with her Normal or Charged Attacks, she regenerates HP for all party members and all nearby allied characters. Healing scales based on Qiqi's ATK.\nRegenerates HP for current character at regular intervals.\nFollows the character around, dealing Cryo DMG to enemies in its path.\n",
        "icon": "/img/talents/qiqi_skill.png"
      },
      "elementalBurst": {
        "name": "Adeptus Art: Preserver of Fortune",
        "description": "Qiqi releases the adeptus power sealed within her body, marking nearby enemies with a Fortune-Preserving Talisman that deals Cryo DMG.\nFortune-Preserving Talisman\nWhen enemies affected by this Talisman take DMG, the character that dealt this DMG regenerates HP.",
        "icon": "/img/talents/qiqi_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Life-Prolonging Methods",
          "description": "When a character under the effects of Adeptus Art: Herald of Frost triggers an Elemental Reaction, their Incoming Healing Bonus is increased by 20% for 8s.",
          "icon": "/img/talents/qiqi_passive1.png"
        },
        {
          "name": "A Glimpse into Arcanum",
          "description": "When Qiqi hits enemies with her Normal and Charged Attacks, she has a 50% chance to apply a Fortune-Preserving Talisman to them for 6s. This effect can only occur once every 30s.",
          "icon": "/img/talents/qiqi_passive2.png"
        },
        {
          "name": "Former Life Memories",
          "description": "Displays the location of nearby resources unique to Liyue on the mini-map.",
          "icon": "/img/talents/qiqi_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Raiden Shogun",
    "talents": {
      "normalAttack": {
        "name": "Origin",
        "description": "Normal Attack\nPerforms up to 5 consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to perform an upward slash.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/raiden_shogun_attack.png"
      },
      "elementalSkill": {
        "name": "Transcendence: Baleful Omen",
        "description": "The Raiden Shogun unveils a shard of her Euthymia, dealing Electro DMG to nearby opponents, and granting nearby party members the Eye of Stormy Judgment.\n\nEye of Stormy Judgment\nWhen characters with this buff attack and deal DMG to opponents, the Eye will unleash a coordinated attack, dealing AoE Electro DMG at the opponent's position.\nCharacters who gain the Eye of Stormy Judgment will have their Elemental Burst DMG increased based on the Energy Cost of the Elemental Burst during the Eye's duration.\nThe Eye can initiate one coordinated attack every 0.9s per party.Coordinated attacks generated by characters not controlled by you deal 20% of the normal DMG.",
        "icon": "/img/talents/raiden_shogun_skill.png"
      },
      "elementalBurst": {
        "name": "Secret Art: Musou Shinsetsu",
        "description": "Gathering truths unnumbered and wishes uncounted, the Raiden Shogun unleashes the Musou no Hitotachi and deals AoE Electro DMG, using Musou Isshin in combat for a certain duration afterward. The DMG dealt by Musou no Hitotachi and Musou Isshin's attacks will be increased based on the number of Chakra Desiderata's Resolve stacks consumed when this skill is used.\n\nMusou Isshin\nWhile in this state, the Raiden Shogun will wield her tachi in battle, while her Normal, Charged, and Plunging Attacks will be infused with Electro DMG, which cannot be overridden. When such attacks hit opponents, she will regenerate Energy for all nearby party members. Energy can be restored this way once every 1s, and this effect can be triggered 5 times throughout this skill's duration.\nWhile in this state, the Raiden Shogun's resistance to interruption is increased, and she is immune to Electro-Charged reaction DMG.\nWhile Musou Isshin is active, the Raiden Shogun's Normal, Charged, and Plunging Attack DMG will be considered Elemental Burst DMG.\nThe effects of Musou Isshin will be cleared when the Raiden Shogun leaves the field.\n\nChakra Desiderata\nWhen nearby party members (excluding the Raiden Shogun herself) use their Elemental Bursts, the Raiden Shogun will build up Resolve stacks based on the Energy Cost of these Elemental Bursts.\nThe maximum number of Resolve stacks is 60. The Resolve gained by Chakra Desiderata will be cleared 300s after the Raiden Shogun leaves the field.",
        "icon": "/img/talents/raiden_shogun_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Wishes Unnumbered",
          "description": "When nearby party members gain Elemental Orbs or Particles, Chakra Desiderata gains 2 Resolve stacks.\nThis effect can occur once every 3s.",
          "icon": "/img/talents/raiden_shogun_passive1.png"
        },
        {
          "name": "Enlightened One",
          "description": "Each 1% above 100% Energy Recharge that the Raiden Shogun possesses grants her:\n0.6% greater Energy restoration from Musou Isshin\n0.4% Electro DMG Bonus",
          "icon": "/img/talents/raiden_shogun_passive2.png"
        },
        {
          "name": "All-Preserver",
          "description": "Mora expended when ascending Swords and Polearms is decreased by 50%.",
          "icon": "/img/talents/raiden_shogun_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Razor",
    "talents": {
      "normalAttack": {
        "name": "Steel Fang",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes.\nCharged Attack\nDrains Stamina over time to perform continuous swirling attacks against all nearby enemies.\n\nAt end of the sequence, perform a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/razor_attack.png"
      },
      "elementalSkill": {
        "name": "Claw and Thunder",
        "description": "Hunts his prey using the techniques taught to him by his master and his Lupical.\nPress\nSwings the Thunder Wolf Claw, dealing Electro DMG to enemies in front of Razor.\n\nUpon striking an enemy, Razor will gain an Electro Sigil, which increases his Energy Recharge rate.\n\nRazor can have up to 3 Electro Sigils simultaneously, and gaining a new Electro Sigil refreshes their duration.\nHold\nGathers Electro energy to unleash a lightning storm over a small AoE, causing massive Electro DMG, and clears all of Razor's Electro Sigils.\n\nEach Electro Sigil cleared in this manner will be converted into Energy for Razor.",
        "icon": "/img/talents/razor_skill.png"
      },
      "elementalBurst": {
        "name": "Lightning Fang",
        "description": "Summons the Wolf Within which deals Electro DMG to all nearby opponents. This clears all of Razor's Electro Sigils, which will be converted into elemental energy for him.\n\nThe Wolf Within will fight alongside Razor for the skill's duration.\nThe Wolf Within\n\nStrikes alongside Razor's normal attacks, dealing Electro DMG.\nRaises Razor's ATK SPD and Electro RES.\nCauses Razor to be immune to DMG inflicted by the Electro-Charged status.\nDisables Razor's Charged Attacks.\n\nThe effects end when Razor leaves the battlefield.\n\nWhen Razor leaves the field, a maximum of 10 Energy will be returned to him based off the duration remaining on this skill.",
        "icon": "/img/talents/razor_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Awakening",
          "description": "Decreases Claw and Thunder's CD by 18%.\nUsing Lightning Fang resets the CD of Claw and Thunder.",
          "icon": "/img/talents/razor_passive1.png"
        },
        {
          "name": "Hunger",
          "description": "When Razor's Energy is below 50%, increases Energy Recharge by 30%.",
          "icon": "/img/talents/razor_passive2.png"
        },
        {
          "name": "Wolvensprint",
          "description": "Decreases all party member's sprinting Stamina Consumption by 20%.",
          "icon": "/img/talents/razor_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Rosaria",
    "talents": {
      "normalAttack": {
        "name": "Spear of the Church",
        "description": "Normal Attack\nPerforms up to five rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/rosaria_attack.png"
      },
      "elementalSkill": {
        "name": "Ravaging Confession",
        "description": "Rosaria swiftly positions herself behind her opponent, then pierces and slashes the enemy with her polearm, dealing Cryo DMG.\nRosaria cannot use this ability to move behind larger opponents.",
        "icon": "/img/talents/rosaria_skill.png"
      },
      "elementalBurst": {
        "name": "Rites of Termination",
        "description": "Rosaria's unique take on this prayer ritual.\nFirst, she swings her weapon to slash surrounding enemies; then, she summons a frigid Ice Lance that strikes the ground. Both actions deal Cryo DMG.\nWhile active, the Ice Lance periodically releases a blast of cold air, dealing Cryo DMG to surrounding enemies.",
        "icon": "/img/talents/rosaria_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Regina Probationum",
          "description": "When Rosaria strikes an opponent from behind using Ravaging Confession, Rosaria's CRIT Rate increases by 12% for 5s.",
          "icon": "/img/talents/rosaria_passive1.png"
        },
        {
          "name": "Shadow Samaritan",
          "description": "Casting Rites of Termination increases CRIT Rate of all nearby party members (except Rosaria herself) by 15% of Rosaria's CRIT Rate for 10s.\nRosaria's CRIT Rate Bonus gained this way cannot exceed 15%.",
          "icon": "/img/talents/rosaria_passive2.png"
        },
        {
          "name": "Night Walk",
          "description": "At night (18:00 - 6:00), increases the Movement SPD of your own party members by 10%.\nDoes not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the same effects.",
          "icon": "/img/talents/rosaria_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kujou Sara",
    "talents": {
      "normalAttack": {
        "name": "Tengu Bowmanship",
        "description": "Normal Attack\nPerform up to 5 consecutive shots with a bow.\nCharged Attack\n Perform a more precise Aimed Shot with increased DMG. While aiming, crackling lightning will accumulate on the arrowhead. An arrow fully charged with the storm's might will deal Electro DMG. When in the Crowfeather Cover state, a fully-charged arrow will leave a Crowfeather behind after it hits.\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/kujou_sara_attack.png"
      },
      "elementalSkill": {
        "name": "Tengu Stormcall",
        "description": "Retreats rapidly with the speed of a tengu, summoning the protection of the Crowfeather. Gains Crowfeather Cover for 18s, and when Kujou Sara fires a fully-charged Aimed Shot, Crowfeather Cover will be consumed, and will leave a Crowfeather at the target location.\nCrowfeathers will trigger Tengu Juurai: Ambush after a short time, dealing Electro DMG and granting the active character within its AoE an ATK Bonus based on Kujou Sara's Base ATK.\nThe ATK Bonuses from different Tengu Juurai will not stack, and their effects and duration will be determined by the last Tengu Juurai to take effect.",
        "icon": "/img/talents/kujou_sara_skill.png"
      },
      "elementalBurst": {
        "name": "Subjugation: Koukou Sendou",
        "description": "Casts down Tengu Juurai: Titanbreaker, dealing AoE Electro DMG. Afterwards, Tengu Juurai: Titanbreaker spreads out into 4 consecutive bouts of Tengu Juurai: Stormcluster, dealing AoE Electro DMG.\nTengu Juurai: Titanbreaker and Tengu Juurai: Stormcluster can provide the active character within their AoE with the same ATK Bonus as given by the Elemental Skill, Tengu Stormcall.\nThe ATK Bonus provided by various kinds of Tengu Juurai will not stack, and their effects and duration will be determined by the last Tengu Juurai to take effect.",
        "icon": "/img/talents/kujou_sara_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Immovable Will",
          "description": "While in the Crowfeather Cover state provided by Tengu Stormcall, Aimed Shot charge times are decreased by 60%.",
          "icon": "/img/talents/kujou_sara_passive1.png"
        },
        {
          "name": "Decorum",
          "description": "When Tengu Juurai: Ambush hits opponents, Kujou Sara will restore 1.2 Energy to all party members for every 100% Energy Recharge she has. This effect can be triggered once every 3s.",
          "icon": "/img/talents/kujou_sara_passive2.png"
        },
        {
          "name": "Land Survey",
          "description": "When dispatched on an expedition in Inazuma, time consumed is reduced by 25%",
          "icon": "/img/talents/kujou_sara_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Sayu",
    "talents": {
      "normalAttack": {
        "name": "Shuumatsuban Ninja Blade",
        "description": "Normal Attack:\nPerforms up to 4 consecutive strikes.\nCharged Attack:\nrains Stamina over time to perform continuous spinning attacks against all nearby opponents. At the end of the sequence, perform a more powerful slash.\nPlunging Attack:\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/sayu_attack.png"
      },
      "elementalSkill": {
        "name": "Yoohoo Art: Fuuin Dash",
        "description": "The special technique of the Yoohoo Ninja Arts!\nSayu curls up into a rolling Fuufuu Windwheel and smashes into opponents at high speed, dealing Anemo DMG.\nWhen the duration ends, she unleashes a Fuufuu Whirlwind Kick, dealing AoE Anemo DMG.\nPress: Enters the Fuufuu Windwheel state, rolling forward a short distance before using the Fuufuu Whirlwind Kick.\nHold: Rolls about continuously in the Fuufuu Windwheel state, increasing Sayu's resistance to interruption while within that state.\nDuring this time, Sayu can control the direction of her roll, and can use the skill again to end her Windwheel state early and unleash a stronger version of the Fuufuu Whirlwind Kick.\nThe Hold version of this skill can trigger Elemental Absorption.\nThis skill has a maximum duration of 10s and enters CD once its effects end. The longer Sayu remains in her Windwheel state, the longer the CD.\nElemental Absorption: If Sayu comes into contact with Hydro, Pyro, Cryo and Electro while in her Windwheel state, she will deal additional elemental DMG of that type.\nElemental Absorption may only occur once per use of this skill.",
        "icon": "/img/talents/sayu_skill.png"
      },
      "elementalBurst": {
        "name": "Yoohoo Art: Mujina Flurry",
        "description": "The other super special technique of the Yoohoo Ninja Arts!\n\nIt summons a pair of helping hands for Sayu.\nDeals Anemo DMG to nearby opponents and heals all nearby party members. The amount of HP restored is based on Sayu's ATK. This skill then summons a Muji-Muji Daruma.\n\nMuji-Muji Daruma: At specific intervals, the Daruma will take one of several actions based on the situation around it:\nIf the HP of nearby characters is above 70%, it will attack a nearby opponent, dealing Anemo DMG.\nIf there are active characters with 70% or less HP nearby, it will heal the active character with the lowest percentage HP left.\n\nIf there are no opponents nearby, it will heal active characters nearby even if they have 70% HP or more.",
        "icon": "/img/talents/sayu_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Someone More Capable",
          "description": "When Sayu triggers a Swirl reaction while active, she heals all your characters and nearby allies for 300 HP. She will also heal an additional 1.2 HP for every point of Elemental Mastery she has.\nThis effect can be triggered once every 2s.",
          "icon": "/img/talents/sayu_passive1.png"
        },
        {
          "name": "No Work Today!",
          "description": "The Muji-Muji Daruma created by Yoohoo Art: Mujina Flurry gains the following effects:\nWhen healing a character, it will also heal characters near that healed character for 20% the amount of HP.\nIncreases the AoE of its attack against opponents.",
          "icon": "/img/talents/sayu_passive2.png"
        },
        {
          "name": "Yoohoo Art: Silencer's Secret",
          "description": "When Sayu is in the party, your characters will not startle Crystalflies and certain other animals when getting near them.\nCheck the \"Other\" sub-category of the \"Living Beings / Wildlife\" section in the Archive for creatures this skill works on.",
          "icon": "/img/talents/sayu_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Sethos",
    "talents": {
      "normalAttack": {
        "name": "Royal Reed Archery",
        "description": "Normal Attack\nPerforms up to 3 consecutive shots with a bow.\nCharged Attack\nPerforms a more precise Aimed Shot with increased DMG.\nWhile aiming, the power of Electro will accumulate on the arrowhead before the arrow is fired. Has different effects based on how long the energy has been charged:\nCharge Level 1: Fires off an arrow carrying the power of lightning that deals Electro DMG.\nCharge Level 2: Fires off a Shadowpiercing Shot which can pierce enemies, dealing Electro DMG to enemies along its path. After the Shadowpiercing Shot is fully charged, Sethos cannot move around.\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/sethos_attack.png"
      },
      "elementalSkill": {
        "name": "Ancient Rite: The Thundering Sands",
        "description": "Gathers the might of thunder, dealing AoE Electro DMG and quickly retreating. If this attack triggers Electro-Charged, Superconduct, Overloaded, Quicken, Aggravate, Hyperbloom, or Electro Swirl reactions, Sethos recovers a certain amount of Elemental Energy.\n\"The God indwelt Priest, the Magi who turned pits to springs, the singers of the sea of sand still spread their stories... But I know those are not legends, for they are our ancestors.\"",
        "icon": "/img/talents/sethos_skill.png"
      },
      "elementalBurst": {
        "name": "Secret Rite: Twilight Shadowpiercer",
        "description": "Perform a secret rite, entering the \"Twilight Meditation\" state, during which Sethos's Normal Attacks will be converted into enemy-piercing Dusk Bolts: Deal Electro DMG to opponents in its path, with DMG increased based on Sethos's Elemental Mastery.\nSethos cannot perform Aimed Shots while in this state.\nDMG dealt by Dusk Bolts is considered Charged Attack DMG.\nThis effect will be canceled when Sethos leaves the field.\nThe archives of the Temple of Silence preserve many tomes left behind by Akhtamun, from the era of King Deshret. Many secret rituals of great power are recorded within, but even among the Temple of Silence, very few could master them.",
        "icon": "/img/talents/sethos_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Thoth's Revelation",
          "description": "Displays the location of nearby resources unique to Sumeru on the mini-map.",
          "icon": "/img/talents/sethos_passive1.png"
        },
        {
          "name": "Black Kite's Enigma",
          "description": "When Aiming, the charging time is decreased by 0.285s based on each point of Sethos's current Elemental Energy. Charging time can be reduced to a minimum of 0.3s through this method and a maximum of 20 Energy can be tallied. If a Shadowpiercing Shot is fired, consume the tallied amount of Elemental Energy; if it is a Charge Level 1 shot, then consume 50% of the tallied amount of Elemental Energy.",
          "icon": "/img/talents/sethos_passive2.png"
        },
        {
          "name": "The Sand King's Boon",
          "description": "Sethos gains the \"Scorching Sandshade\" effect, increasing the DMG dealt by Shadowpiercing Shots by 700% of Sethos's Elemental Mastery.\nThe Scorching Sandshade effect will be canceled when any of the following conditions are met:\n5s after a Shadowpiercing Shot first hits an opponent.\nAfter 4 Shadowpiercing Shots strike opponents.\nWhen a Shadowpiercing Shot affected by Scorching Sandshade first hits an opponent, Sethos will regain Scorching Sandshade after 15s.",
          "icon": "/img/talents/sethos_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Shenhe",
    "talents": {
      "normalAttack": {
        "name": "Dawnstar Piercer",
        "description": "Normal Attack\nPerforms up to five consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/shenhe_attack.png"
      },
      "elementalSkill": {
        "name": "Spring Spirit Summoning",
        "description": "The frosted dew, silvery and dense, shall exorcise all demons.\nGrants all nearby party members the Icy Quill effect and deals Cryo DMG in different ways based on whether it is {LAYOUT_MOBILE#tapped}{LAYOUT_PC#pressed}{LAYOUT_PS#pressed} or held.\nPress\nRushes forward together with a Talisman Spirit, dealing Cryo DMG to opponents along the path.\nHold\nCommands the Talisman Spirit to deal AoE Cryo DMG.\nIcy Quill\nWhen Normal, Charged, and Plunging Attacks, Elemental Skills, and Elemental Bursts deal Cryo DMG to opponents, the DMG dealt is increased based on Shenhe's current ATK.\nThe Icy Quill's effects will be cleared once its duration ends or after being triggered a certain number of times. When held rather than {LAYOUT_MOBILE#tapped}{LAYOUT_PC#pressed}{LAYOUT_PS#pressed}, the Icy Quill's effect lasts longer and can be triggered more times.\nWhen one Cryo DMG instance strikes multiple opponents, the effect is triggered multiple times based on the number of opponents hit. The number of times the effect is triggered is calculated independently for each party member with the Icy Quill.",
        "icon": "/img/talents/shenhe_skill.png"
      },
      "elementalBurst": {
        "name": "Divine Maiden's Deliverance",
        "description": "Unleashes the power of the Talisman Spirit, allowing it to roam free in this plane, dealing AoE Cryo DMG.\nThe Talisman Spirit then creates a field that decreases the Cryo RES and Physical RES of opponents within it. It also deals periodic Cryo DMG to opponents within the field.",
        "icon": "/img/talents/shenhe_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Precise Comings and Goings",
          "description": "Gains 25% more rewards when dispatched on a Liyue Expedition for 20 hours.",
          "icon": "/img/talents/shenhe_passive1.png"
        },
        {
          "name": "Deific Embrace",
          "description": "An active character within the field created by Divine Maiden's Deliverance gains 15% Cryo DMG Bonus.",
          "icon": "/img/talents/shenhe_passive2.png"
        },
        {
          "name": "Spirit Communion Seal",
          "description": "After Shenhe uses Spring Spirit Summoning, she will grant all nearby party members the following effects:\n- Press: Elemental Skill and Elemental Burst DMG increased by 15% for 10s.\n- Hold: Normal, Charged, and Plunging Attack DMG increased by 15% for 15s.",
          "icon": "/img/talents/shenhe_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Shikanoin Heizou",
    "talents": {
      "normalAttack": {
        "name": "Fudou Style Martial Arts",
        "description": "Normal Attack\nPerforms up to 5 fisticuffs empowered by a mighty wind, dealing Anemo DMG.\nCharged Attack\nConsumes a certain amount of Stamina and performs a sweeping kick that deals Anemo DMG.\nPlunging Attack\nCalling upon the surging wind, Heizou plunges towards the ground from mid-air, damaging all opponents in his path. Deals AoE Anemo DMG upon impact with the ground.",
        "icon": "/img/talents/shikanoin_heizou_attack.png"
      },
      "elementalSkill": {
        "name": "Heartstopper Strike",
        "description": "Press\nWields the swift winds to launch a Heartstopper Strike that deals Anemo DMG.\nHold\nCharges energy to unleash an even stronger blow. He will obtain the Declension effect while charging, which will increase the power of the Heartstopper Strike. When the skill button is released or the skill finishes charging, he will strike forward, dealing Anemo DMG.\nDeclension\nIncreases the power of the next Heartstopper Strike. Max 4 stacks.\nWhen you possess 4 Declension stacks, the Conviction effect will be produced, which will cause the next Hearstopper Strike to be even stronger and have a larger AoE.",
        "icon": "/img/talents/shikanoin_heizou_skill.png"
      },
      "elementalBurst": {
        "name": "Windmuster Kick",
        "description": "Leaps into the air and uses the Fudou Style Vacuum Slugger and kicks his opponent. The Vacuum Slugger will explode upon hit and create an Arresting Windtunnel that pulls in nearby objects and opponents, dealing AoE Anemo DMG.\nWhen Vacuum Slugger hits opponents affected by Hydro/Pyro/Cryo/Electro, these opponents will be afflicted with Windmuster Iris. This Windmuster Iris will explode after a moment and dissipate, dealing AoE DMG of the corresponding aforementioned elemental type.\nVacuum Slugger can afflict a maximum of 4 opponents with the Windmuster Iris. A single opponent cannot be under the effect of Windmuster Irises of different elements at the same time.",
        "icon": "/img/talents/shikanoin_heizou_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Paradoxical Practice",
          "description": "When Shikanoin Heizou activates a Swirl reaction while on the field, he will gain 1 Declension stack for Heartstopper Strike. This effect can be triggered once every 0.1s.",
          "icon": "/img/talents/shikanoin_heizou_passive1.png"
        },
        {
          "name": "Penetrative Reasoning",
          "description": "After Shikanoin Heizou's Heartstopper Strike hits an opponent, increases all party members' (excluding Shikanoin Heizou) Elemental Mastery by 80 for 10s.",
          "icon": "/img/talents/shikanoin_heizou_passive2.png"
        },
        {
          "name": "Pre-Existing Guilt",
          "description": "Decreases sprinting Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/shikanoin_heizou_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Sigewinne",
    "talents": {
      "normalAttack": {
        "name": "Targeted Treatment",
        "description": "Normal Attack\nPerforms up to 3 consecutive attacks.\nCharged Attack\nPerforms a more precise Aimed Shot with increased DMG.\nWhile aiming, the power of Hydro will continually accumulate on the arrow. After fully charging, Sigewinne will periodically fire slow-moving Mini-Stration Bubbles toward the target, dealing Hydro DMG. When released, an arrow imbued with torrential energy will deal Hydro DMG to the opponent hit.\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/sigewinne_attack.png"
      },
      "elementalSkill": {
        "name": "Rebound Hydrotherapy",
        "description": "Blows a Bolstering Bubblebalm that can stimulate blood flow and help patients drift off to sleep using a bubblegun specially made in the Fortress of Meropide.\nBolstering Bubblebalms will bounce between nearby opponents, dealing Hydro DMG based on Sigewinne's max HP to opponents it hits. When it bounces, it will restore HP to all nearby party members except Sigewinne herself. The amount healed is based on Sigewinne's max HP.\nAfter bouncing 5 times, the Bolstering Bubblebalm will disappear and restore HP to Sigewinne based on her max HP value.\nWhen no opponents are present, the Bolstering Bubblebalm will bounce nearby. Only one Bolstering Bubblebalm created by a Sigewinne may exist at once.\nWhen Held, the Bolstering Bubblebalm can be boosted to an even bigger size.\nHold\nEnter Aiming Mode to begin blowing an even bigger, even more breathtaking Bolstering Bubblebalm!\nThe Bolstering Bubblebalm will grow bigger the longer the skill is Held, until it grows up to two tiers in size. Each tier it grows increases its DMG by 5% and healing by 5%. When a Bolstering Bubblebalm bounces, it will drop down a tier in size, until it returns to being a normal Bolstering Bubblebalm.\nAfter weaker opponents are hit by big Bolstering Bubblebalms, they will be imprisoned and will be unable to move.\nIn addition, 2 Sourcewater Droplets will be created near Sigewinne when she uses this Skill. Each Sourcewater Droplet Sigewinne collects will grant her a Bond of Life worth 10% of her Max HP.\nWhen Sigewinne's Bond of Life is cleared, she regains 1 Elemental Energy for every 2,000 HP worth of the Bond of Life that was cleared. Sigewinne can regain up to 5 Elemental Energy in this way.\nArkhe: Ousia\nBolstering Bubblebalms periodically call down a Surging Blade on the position they hit, dealing Ousia-aligned Hydro DMG based on Sigewinne's max HP.\n\"What do you think? Not only can this kind of hydrotherapy stimulate the circulatory system, but it can also cheer patients up, ooh, and that's not all, it can even help patients who ought to get some rest have a nice nap...\"",
        "icon": "/img/talents/sigewinne_skill.png"
      },
      "elementalBurst": {
        "name": "Super Saturated Syringing",
        "description": "Takes out a special Fortress of Meropide-made syringe and assault the area in front with waves of kindness and medicine, dealing AoE Hydro DMG based on Sigewinne's max HP.\nIn addition, Sigewinne absorbs up to 2 nearby Sourcewater Droplets within a certain range when she uses this skill.\n\"Hey, overdosing on medicine is no different from poison, you know, it's real dangerous! But patients need care and concern, and nobody can overdose on that!\"",
        "icon": "/img/talents/sigewinne_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Emergency Dose",
          "description": "While underwater, heal your active character over 2.5s when their HP falls under 50%. The amount healed is equal to 50% of their Max HP, and their All Elemental and Physical RES will be decreased by 10% for 10s. This effect can be triggered up to once every 20s.",
          "icon": "/img/talents/sigewinne_passive1.png"
        },
        {
          "name": "Requires Appropriate Rest",
          "description": "Sigewinne grants herself the \"Semi-Strict Bedrest\" effect for 18s after using Rebound Hydrotherapy: Sigewinne gains an 8% Hydro DMG Bonus and 10 stacks of Convalescence. When the Elemental Skills of your nearby off-field party members other than Sigewinne deal DMG, consume 1 stack of Convalescence, and increase the DMG dealt by this instance of Elemental Skill DMG. Every 1,000 Max HP Sigewinne has above 30,000 increases the DMG by 80. The maximum DMG increase for Elemental Skills that can be gained in this way is 2,800.",
          "icon": "/img/talents/sigewinne_passive2.png"
        },
        {
          "name": "Detailed Diagnosis, Thorough Treatment",
          "description": "When Sigewinne performs healing, the amount healed for this instance is increased based on the total current value of the Bonds of Life on all party members: For each 1,000 HP worth of Bonds of Life, the outgoing healing is increased by 3%. The amount of healing provided can be increased by up to 30% in this way.",
          "icon": "/img/talents/sigewinne_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Sucrose",
    "talents": {
      "normalAttack": {
        "name": "Wind Spirit Creation",
        "description": "Normal Attack\nPerforms up to 4 attacks using Wind Spirits, dealing Anemo DMG.\nCharged Attack\nConsumes a certain amount of Stamina and deals AoE Anemo DMG after a short casting time.\nPlunging Attack\nCalling upon the power of her Wind Spirits, Sucrose plunges towards the ground from mid-air, damaging all enemies in her path. Deals AoE Anemo DMG upon impact with the ground.",
        "icon": "/img/talents/sucrose_attack.png"
      },
      "elementalSkill": {
        "name": "Astable Anemohypostasis Creation - 6308",
        "description": "Creates a small Wind Spirit that deals Anemo DMG to enemies in an AoE, pulling them towards the location of the Wind Spirit before launching them.",
        "icon": "/img/talents/sucrose_skill.png"
      },
      "elementalBurst": {
        "name": "Forbidden Creation - Isomer 75 / Type II",
        "description": "Sucrose hurls an unstable concoction that creates a Large Wind Spirit. While it persists, the Large Wind Spirit will continuously pull and launch nearby enemies, dealing AoE Anemo DMG.\nElemental Absorption\nIf the Wind Spirit comes into contact with Hydro / Pyro / Cryo / Electro elements, it will deal additional DMG of that type.\n\nElemental Absorption may only occur once per use.",
        "icon": "/img/talents/sucrose_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Catalyst Conversion",
          "description": "When Sucrose triggers a Swirl effect, characters in the party with the matching element have their Elemental Mastery increased by 50 for 8s.",
          "icon": "/img/talents/sucrose_passive1.png"
        },
        {
          "name": "Mollis Favonius",
          "description": "When Astable Anemohypostatis Creation - 6308 or Forbidden Creation - Isomer 75 / Type II hit an enemy, increases other party member's Elemental Mastery based on 20% of Sucrose's Elemental Mastery for 8s.",
          "icon": "/img/talents/sucrose_passive2.png"
        },
        {
          "name": "Astable Invention",
          "description": "When Sucrose crafts Character and Weapon Enhancement Materials, she has a 10% to obtain double the product.",
          "icon": "/img/talents/sucrose_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Tartaglia",
    "talents": {
      "normalAttack": {
        "name": "Cutting Torrent",
        "description": "Normal Attack\nPerforms up to 6 consecutive shots with a bow.\nCharged Attack\nPerform a more precise Aimed Shot with increased DMG.\n\nWhile aiming, the power of Hydro will accumulate on the arrowhead. An arrow fully charged with the torrent will deal Hydro DMG and apply Riptide status..\nRiptide\nOpponents affected by Riptide will suffer from AoE Hydro DMG effects when attacked by Tartaglia in various ways. DMG dealt in this way is considered Normal Attack DMG.\n\nRiptide Flash: A fully-charged Aimed Shot that hits an opponent affected by Riptide deals consecutive bouts of AoE DMG. Can occur once every 0.7s.\nRiptide Burst: Defeating an opponent affected by Riptide created a Hydro burst that inflicts the Riptide status on nearby opponents hit.\n\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact. When Tartaglia is in Foul Legacy: Raging Tide's Melee Stance, he cannot perform a plunging attack.",
        "icon": "/img/talents/tartaglia_attack.png"
      },
      "elementalSkill": {
        "name": "Foul Legacy: Raging Tide",
        "description": "Unleashes a set of weaponry made of pure water, dealing Hydro DMG to surrounding opponents and entering a Melee Stance.\nIn this Stance, Tartaglia's Normal and Charged Attacks change as follows:\nNormal Attack\nPerforms up to 6 consecutive Hydro strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash a cross slash, dealing Hydro DMG.\nRiptide Slash\nHitting an opponent affected by Riptide with a melee attack unleashes a Riptide Slash that deals AoE Hydro DMG. DMG dealt in this way is considered Elemental Skill DMG, and can only occur once every 1.5s.\nAfter 30s, or when the ability is unleashed again, this skill will end. Tartaglia will return to his Ranged Stance and this ability will enter CD. The longer Tartaglia stays in his Melee Stance, the longer the CD.\nIf the return to a ranged stance occurs automatically after 30s, the CD is even longer.",
        "icon": "/img/talents/tartaglia_skill.png"
      },
      "elementalBurst": {
        "name": "Havor: Obliteration",
        "description": "Performs different attacks based on what stance Tartaglia is in when casting.\nRanged Stance: Flash of Havoc\nSwiftly fires a Hydro-imbued magic arrow, dealing AoE Hydro DMG and applying the Riptide status.\nReturns a portion of its Energy Cost after use.\nMelee Stance: Light Obliteration\nPerforms a slash with a large AoE, dealing massive Hydro DMG to all surrounding opponents, which triggers Riptide Blast.\nRiptide Blast\nWhen the obliterating waters hit an opponent affected by Riptide, it clears their Riptide status and triggers a Hydro Explosion that deals AoE Hydro DMG.\nDMG dealt in this way is considered Elemental Burst DMG.",
        "icon": "/img/talents/tartaglia_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Never Ending",
          "description": "Extends Riptide duration by 8s.",
          "icon": "/img/talents/tartaglia_passive1.png"
        },
        {
          "name": "Sword of Torrents",
          "description": "When Tartaglia is in Foul Legacy: Raging Tide's Melee Stance, or if his Normal and Charged Attacks do CRIT DMG, they will apply the Riptide status effect on the hit enemy.",
          "icon": "/img/talents/tartaglia_passive2.png"
        },
        {
          "name": "Master of Weaponry",
          "description": "Increases your own party member's Normal Attack Level by 1.",
          "icon": "/img/talents/tartaglia_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Thoma",
    "talents": {
      "normalAttack": {
        "name": "Swiftshatter Spear",
        "description": "Normal Attack\nPerforms up to four consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/thoma_attack.png"
      },
      "elementalSkill": {
        "name": "Blazing Blessing",
        "description": "Thoma vaults forward with his polearm and delivers a flame-filled flying kick that deals AoE Pyro DMG, while also summoning a defensive Blazing Barrier.\nAt the moment of casting, Thoma's Elemental Skill applies Pyro to himself.\nThe DMG Absorption of the Blazing Barrier scales off Thoma's Max HP.\nThe Blazing Barrier has the following traits:\n- Absorbs Pyro DMG 250% more effectively.\n- When a new Blazing Barrier is obtained, the remaining DMG Absorption of an existing Blazing Barrier will stack and its duration will be refreshed.\nThe maximum DMG Absoprtion of the Blazing Barrier will not exceed a certain percentage of Thoma's Max HP.",
        "icon": "/img/talents/thoma_skill.png"
      },
      "elementalBurst": {
        "name": "Crimson Ooyoroi",
        "description": "Thoma spins his polearm, slicing at his foes with roaring flames that deal AoE Pyro DMG and weave themselves into a Scorching Ooyoroi.\nScorching Ooyoroi\nWhile Scorching Ooyoroi is in effect, the active character's Normal Attacks will trigger Fiery Collapse, dealing AoE Pyro DMG and summoning a Blazing Barrier.\nFiery Collapse can be triggered once every 1s.\nExcept for the amount of DMG they can absorb, the Blazing Barriers created in this way are identical to those created by Thoma's Elemental Skill, Blazing Blessing:\n- Absorbs Pyro DMG 250% more effectively.\n- When a new Blazing Barrier is obtained, the remaining DMG Absorption of an existing Blazing Barrier will stack and its duration will be refreshed.\nThe maximum DMG Absorption of the Blazing Barrier will not exceed a certain percentage of Thoma's Max HP.\nIf Thoma falls, the effects of Scorching Ooyoroi will be cleared.",
        "icon": "/img/talents/thoma_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Imbricated Armor",
          "description": "When your current active character obtains or refreshes a Blazing Barrier, this character's Shield Strength will increase by 5% for 6s.\nThis effect can be triggered once every 0.3 seconds. Max 5 stacks.",
          "icon": "/img/talents/thoma_passive1.png"
        },
        {
          "name": "Flaming Assault",
          "description": "DMG dealt by Crimson Ooyoroi's Fiery Collapse is increased by 2.2% of Thoma's Max HP. ",
          "icon": "/img/talents/thoma_passive2.png"
        },
        {
          "name": "Snap and Swing",
          "description": "When you fish successfully in Inazuma, Thoma's help grants a 20% chance of scoring a double catch.",
          "icon": "/img/talents/thoma_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Tighnari",
    "talents": {
      "normalAttack": {
        "name": "Khanda Barrier-Buster",
        "description": "Normal Attack\nPerform up to 4 consecutive shots with a bow.\nCharged Attack\nPerform a more precise Aimed Shot with increased DMG.\nWhile aiming, the power of Dendro will accumulate on the arrowhead before the arrow is fired. Has different effects based on how long the energy has been charged:\nCharge Level 1: Fires off an arrow carrying the power of flora that deals Dendro DMG.\nCharge Level 2: Fires off a Wreath Arrow that deals Dendro DMG. Upon hit, the Wreath Arrow will create 4 Clusterbloom Arrows that will track nearby opponents automatically and deal Dendro DMG.",
        "icon": "/img/talents/tighnari_attack.png"
      },
      "elementalSkill": {
        "name": "Vijnana-Phala Mine",
        "description": "Tighnari throws a Vijnana Stormheart ahead that deals AoE Dendro DMG, creating a Vijnana-Khanda Field that creates mysterious illusions that taunt opponents and draw their fir\nAdditionally, Tighnari gains the Vijnana Suffusion effect, which will decrease the Wreath Arrow's charging time by 2.4s. This effect will dissipate once the skill duration ends or after Tighnari has fired 3 Wreath Arrows.\n\"If sees whither apart from the soil, they will remain a single seed. But if returned to the soil, they shall multiply ten-million fold.\"",
        "icon": "/img/talents/tighnari_skill.png"
      },
      "elementalBurst": {
        "name": "Fashioner's Tanglevine Shaft",
        "description": "Combines the power of all seeds to fire 6 Tanglevine Shafts that can track opponents and deal Dendro DMG.\nAfter they hit, the Tanglevine Shafts will create a secondary wave of Tanglevine Shafts that can also track opponents and deal Dendro DMG on hit.\n\"Do not seek to escape so easily. The vines grow and regrow ever on. Things might get dicey if you don't clear every last one of them out.\"",
        "icon": "/img/talents/tighnari_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Keen Sight",
          "description": "After Tighnari fires a Wreath Arrow, his Elemental Mastery is increased by 50 for 4s.",
          "icon": "/img/talents/tighnari_passive1.png"
        },
        {
          "name": "Scholarly Blade",
          "description": "For every point of Elemental Mastery Tighnari possesses, his Charged Attack and Fashioner's Tanglevine Shaft DMG are increased by 0.06%.\nThe maximum DMG Bonus obtainable this way is 60%.",
          "icon": "/img/talents/tighnari_passive2.png"
        },
        {
          "name": "Encyclopedic Knowledge",
          "description": "Displays the location of nearby resources unique to Sumeru on the mini-map.",
          "icon": "/img/talents/tighnari_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Traveler",
    "talents": {
      "normalAttack": {
        "name": "Foreign Ironwind",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/traveler_attack.png"
      },
      "elementalSkill": {
        "name": "Palm Vortex",
        "description": "Grasping the wind's might, you form a vortex of vacuum in your palm, causing Anemo DMG 6 times in 1.5 seconds to opponents in front of you. The vacuum vortex explodes when the skill duration ends, causing a greater amount of Anemo DMG over a larger area.\nHold\nDMG and AoE will gradually increase.\nElemental Absorption\nIf the vortex comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal 23% additional elemental DMG of that type. Elemental Absorption may only occur once per use.\nGenerate 2 elemental particles when press and 3.5 when hold, if it hit at least 1 target.",
        "icon": "/img/talents/traveler_skill.png"
      },
      "elementalBurst": {
        "name": "Gust Surge",
        "description": "Guiding the path of the wind currents, you summon a forward-moving tornado that pulls objects and opponents towards itself, dealing Anemo DMG each 0.5 seconds, 9 times.\nElemental Absorption\nIf the vortex comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal 30.7% additional elemental DMG of that type. Elemental Absorption may only occur once per use.",
        "icon": "/img/talents/traveler_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Slitting Wind",
          "description": "The last hit of a Normal Attack combo unleashes a wind blade, dealing 60% of ATK as Anemo DMG to all opponents in its path.",
          "icon": "/img/talents/traveler_passive1.png"
        },
        {
          "name": "Second Wind",
          "description": "Palm Vortex kills regenerate 2% HP for 5s. This effect can only occur once every 5s.",
          "icon": "/img/talents/traveler_passive2.png"
        }
      ]
    }
  },
  {
    "character": "Traveler",
    "talents": {
      "normalAttack": {
        "name": "Foreign Fieldcleaver",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/traveler_attack.png"
      },
      "elementalSkill": {
        "name": "Razorgrass Blade",
        "description": "With a flourish of your blade, you unleash a spray of razor-sharp leaves that go before you and deal Dendro DMG.",
        "icon": "/img/talents/traveler_skill.png"
      },
      "elementalBurst": {
        "name": "Surgent Manifestation",
        "description": "Calling upon the might of the flora all around you, you create a Lea Lotus Lamp. This Lamp will deal continuous Dendro DMG to opponents within its AoE.\nLotuslight Transfiguration\nThe Lea Lotus Lamp will undergo the following changes after it comes into contact with Hydro/Electro/Pyro:\nHydro: the Lamp's AoE and the AoE of its atacks are increased.\nElectro: the Lamp's ATK SPD is increased.\nPyro: the Lamp will explode after a short delay and then disappear, dealing AoE Dendro DMG.\n\n\nThe Lea Lotus Lamp can only undergo one Lotuslight Transfiguration in its duration.\n Only one Lamp created by the Traveler can exist at any one time.",
        "icon": "/img/talents/traveler_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Verdant Luxury",
          "description": "Every point of Elemental Mastery the Traveler possesses increases the DMG dealt by Razorgrass Blade by 0.15% and the DMG dealt by Surgent Manifestation by 0.1%.",
          "icon": "/img/talents/traveler_passive1.png"
        },
        {
          "name": "Verdant Overgrowth",
          "description": "Lea Lotus Lamp will obtain one level of Overflowing Lotuslight every second it is on the field, increasing the Elemental Mastery of active character(s) within its AoE by 6. Overflowing Lotuslight has a maximum of 10 stacks.",
          "icon": "/img/talents/traveler_passive2.png"
        }
      ]
    }
  },
  {
    "character": "Traveler",
    "talents": {
      "normalAttack": {
        "name": "Foreign Thundershock",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/traveler_attack.png"
      },
      "elementalSkill": {
        "name": "Lightning Blade",
        "description": "Unleashes three swift thunder shadows that deal Electro DMG to opponents and leave an Abundance Amulet behind after hitting an opponent.\n2 Abundance Amulets can be created initially. Using this skill will reset any Abundance Amulets that were generated.\n\nAbundance Amulets\nWhen a character is near an Abundance Amulet, they will absorb it and obtain the following effects:\nRestores Elemental Energy\nIncreases Energy Recharge during the Abundance Amulet's duration.",
        "icon": "/img/talents/traveler_skill.png"
      },
      "elementalBurst": {
        "name": "Bellowing Thunder",
        "description": "You call upon the protection of lightning, knocking nearby opponents back and dealing Electro DMG to them.\nLightning Shroud\nWhen your active character's Normal or Charged Attacks hit opponents, they will call Falling Thunder forth, dealing Electro DMG.\nWhen Falling Thunder hits opponents, it will regenerate Energy for that character.\nOne instance of Falling Thunder can be generated every 0.5s.",
        "icon": "/img/talents/traveler_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Thunderflash",
          "description": "When another nearby character in the party obtains an Abundance Amulet created by Lightning Blade, Lightning Blade's CD is decreased by 1.5s.",
          "icon": "/img/talents/traveler_passive1.png"
        },
        {
          "name": "Resounding Roar",
          "description": "Increases the Energy Recharge effect granted by Lightning Blade's Abundance Amulet by 10% of the Traveler's Energy Recharge.",
          "icon": "/img/talents/traveler_passive2.png"
        }
      ]
    }
  },
  {
    "character": "Traveler",
    "talents": {
      "normalAttack": {
        "name": "Foreign Rockblade",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/traveler_attack.png"
      },
      "elementalSkill": {
        "name": "Starfell Sword",
        "description": "You disgorge a meteorite from the depths of the earth, dealing AoE Geo DMG. The meteorite is considered a Geo Construct, and can be climbed or used to block attacks.\nHold: This skill's positioning may be adjusted.",
        "icon": "/img/talents/traveler_skill.png"
      },
      "elementalBurst": {
        "name": "Wake of Earth",
        "description": "Energizing the Geo elements deep underground, you set off expanding shockwaves.\nLaunches surrounding opponents back and deals AoE Geo DMG.\nA stone wall is erected at the edges of the shockwave.\nThe stone wall is considered a Geo Construct, and may be used to block attacks.",
        "icon": "/img/talents/traveler_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Shattered Darkrock",
          "description": "Reduces Starfell Sword's CD by 2s.",
          "icon": "/img/talents/traveler_passive1.png"
        },
        {
          "name": "Frenzied Rockslide",
          "description": "The final hit of a Normal Attack combo triggers a collapse, dealing 60% of ATK as AoE Geo DMG.",
          "icon": "/img/talents/traveler_passive2.png"
        }
      ]
    }
  },
  {
    "character": "Traveler",
    "talents": {
      "normalAttack": {
        "name": "Foreign Stream",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/traveler_attack.png"
      },
      "elementalSkill": {
        "name": "Aquacrest Saber",
        "description": "Unleashes a torrent that can cleanse the world.\nPress\nSends a Torrent Surge forward that will deal Hydro DMG to opponents it comes into contact with.\nHold\nEnter Aiming Mode and constantly fire off Dewdrops in the direction in which you are aiming, dealing Hydro DMG to opponents they hit.\nWhen the skill ends, it will send a Torrent Surge forward that will deal Hydro DMG to opponents it comes into contact with.\nSuffusion: When using the Hold configuration of this skill, if the Traveler's HP is higher than 50%, the DMG dealt by Dewdrops will increase based on the Traveler's Max HP, and the Traveler will lose a fixed amount of HP every second.\nArkhe: Pneuma\nAt certain intervals, after using Torrent Surge, this skill will unleash a Spiritbreath Thorn that pierces opponents, dealing Pneuma-aligned Hydro DMG.\nYou studied the ripples in the water with Paimon.",
        "icon": "/img/talents/traveler_skill.png"
      },
      "elementalBurst": {
        "name": "Rising Waters",
        "description": "Unleashes a slow-moving floating bubble that deals continuous Hydro DMG to nearby opponents.\nYou studied the ebb and flow of the tides with Paimon.",
        "icon": "/img/talents/traveler_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Spotless Waters",
          "description": "After the Dewdrop fired by the Hold Mode of the Aquacrest Saber hits an opponent, a Sourcewater Droplet will be generated near to the Traveler. If the Traveler picks it up, they will restore 7% HP.\n1 Droplet can be created this way every second, and each use of Aquacrest Saber can create 4 Droplets at most.",
          "icon": "/img/talents/traveler_passive1.png"
        },
        {
          "name": "Clear Waters",
          "description": "If HP has been consumed via Suffusion while using the Hold Mode Aquacrest Saber, the Torrent Surge at the skill's end will deal Bonus DMG equal to 45% of the total HP the Traveler has consumed in this skill use via Suffusion.\nThe maximum DMG Bonus that can be gained this way is 5,000.",
          "icon": "/img/talents/traveler_passive2.png"
        }
      ]
    }
  },
  {
    "character": "Venti",
    "talents": {
      "normalAttack": {
        "name": "Divine Marksmanship",
        "description": "Normal Attack\nPerforms up to 6 consecutive shots with a bow.\nCharged Attack\nPerform a more precise Aimed Shot with increased DMG.\n\nWhile aiming, favorable winds will accumulate on the arrowhead. A fully charged arrow will deal Anemo DMG.\nPlunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/venti_attack.png"
      },
      "elementalSkill": {
        "name": "Skyward Sonnet",
        "description": "O wind upon which all hymns and songs fly, bear these earth-walkers up into the sky!\nPress\nSummons a Wind Domain at the enemy's location, dealing AoE Anemo DMG and launching enemies into the air.\nHold\nSummons an even larger Wind Domain with Venti as the epicenter, dealing AoE Anemo DMG and launching affected enemies into the air.\n\nAfter unleashing the Hold version of this ability, Venti rides the wind into the air.\nEnemies hit by Skyward Sonnet will fall to the ground slowly.",
        "icon": "/img/talents/venti_skill.png"
      },
      "elementalBurst": {
        "name": "Wind's Grand Ode",
        "description": "Fires off an arrow made of countless coalesced winds, creating a huge Stormeye that sucks in objects and enemies along its path, dealing continuous Anemo DMG.\nElemental Absorption\nIf the Stormeye comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional elemental DMG of that type.\n\nElemental Absorption may only occur once per use.",
        "icon": "/img/talents/venti_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Embrace of Winds",
          "description": "Holding Skyward Sonnet creates an upcurrent that lasts for 20s.",
          "icon": "/img/talents/venti_passive1.png"
        },
        {
          "name": "Stormeye",
          "description": "Regenerates 15 Energy for Venti after the effects of Wind's Grand Ode end.\nIf an Elemental Absorption occurred, this also restores 15 Energy to all characters of that corresponding element.",
          "icon": "/img/talents/venti_passive2.png"
        },
        {
          "name": "Windrider",
          "description": "Decreases all party member's gliding Stamina Consumption by 20%.",
          "icon": "/img/talents/venti_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Wanderer",
    "talents": {
      "normalAttack": {
        "name": "Yuuban Meigen",
        "description": "Normal Attack\nPerforms up to 3 attacks using wind blades, dealing Anemo DMG.\nCharged Attack\nConsumes a certain amount of Stamina, gathers a build up of high wind pressure, and deals AoE Anemo DMG after a short casting time.\nPlunging Attack\nCalling upon the power of Anemo, the Wanderer plunges towards the ground from mid-air, damaging all opponents in his path. Deals AoE Anemo DMG upon impact with the ground.",
        "icon": "/img/talents/wanderer_attack.png"
      },
      "elementalSkill": {
        "name": "Hanega: Song of the Wind",
        "description": "Concentrates the power of the winds to break free from the shackles of the earth, dealing AoE Anemo DMG before leaping into the air and entering the Windfavored state.\nWindfavored\nThe Wanderer cannot perform Plunging Attacks in this state. When he uses Normal and Charged Attacks, they will be converted into Kuugo: Fushoudan and Kuugo: Toufukai respectively; the DMG they deal and their AoE will be increased, and their DMG will be considered Normal and Charged Attack DMG respectively. Kuugo: Toufukai will not consume Stamina. The Wanderer will hover persistently during this time. While this state is active, the Wanderer's movements gain the following properties:\n- Persistently consumes Kuugoryoku Points to maintain this hovering state.\n- When sprinting, additional Kuugoryoku Points will be consumed for the Wanderer to accelerate mid-air. Holding sprint will cause persistent Kuugoryoku Point consumption to maintain speed. This effect will replace his default sprint.\n- Jumping expends extra Kuugoryoku Points to increase hovering height. Holding jump will cause persistent Kuugoryoku Point consumption to keep increasing hovering height.\nRunning out of Kuugoryoku Points will end the Windfavored state. A second cast during the duration of Windfavored will also end it.",
        "icon": "/img/talents/wanderer_skill.png"
      },
      "elementalBurst": {
        "name": "Kyougen: Five Ceremonial Plays",
        "description": "Compresses the atmosphere into a singlular vacuum that grinds all troubles away, dealing multiple instances of AoE Anemo DMG. If the character is in the Windfavored state due to the skill \"Hanega: Song of the Wind,\" Windfavored state will end after casting.",
        "icon": "/img/talents/wanderer_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Jade-Claimed Flower",
          "description": "If Hanega: Song of the Wind comes into contact with Hydro/Pyro/Cryo/Electro when it is unleashed, this instance of the Windfavored state will obtain buffs according to the contacted element(s):\n- Hydro: Kuugoryoku Point cap increases by 20.\n- Pyro: ATK increases by 30%.\n- Cryo: CRIT Rate increases by 20%.\n- Electro: When Normal and Charged Attacks hit an opponent, 0.8 Energy will be restored. Energy can be restored this way every 0.2s.\nYou can have up to 2 different kinds of these buffs simultaneously.",
          "icon": "/img/talents/wanderer_passive1.png"
        },
        {
          "name": "Gales of Reverie",
          "description": "When the Wanderer hits opponents with Kuugo: Fushoudan or Kuugo: Toufukai in his Windfavored state, he has a 16% chance to obtain the Descent effect: The next time the Wanderer accelerates in mid-air while in this instance of the Windfavored state, this effect will be removed, this acceleration instance will not consume any Kuugoryoku Points, and he will fire off 4 wind arrows that deal 35% of his ATK as Anemo DMG each. For each Kuugo: Fushoudan and Kuugo: Toufukai that does not produce this effect, the next attack of those types will have a 12% increased chance of producing it. The calculation of the effect production is done once every 0.1s.",
          "icon": "/img/talents/wanderer_passive2.png"
        },
        {
          "name": "Strum the Swirling Winds",
          "description": "Mora expended when ascending Bows and Catalysts is decreased by 50%.",
          "icon": "/img/talents/wanderer_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Wriothesley",
    "talents": {
      "normalAttack": {
        "name": "Forceful Fists of Frost",
        "description": "Normal Attack\nCoalescing frost about his fist, Wriothesley will unleash powerful Repelling Fists, performing up to 5 rapid attacks that deal Cryo DMG.\nApart from this, Normal Attack combo count will not reset for a short time after using Icefang Rush or sprinting.\nCharged Attack\nConsumes a fixed amount of Stamina to leap and unleash a Vaulting Fist, dealing AoE Cryo DMG.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE Cryo DMG upon impact.",
        "icon": "/img/talents/wriothesley_attack.png"
      },
      "elementalSkill": {
        "name": "Icefang Rush",
        "description": "Adjusting his breathing, rhythm, and pace, Wriothesley sprints forward a short distance, entering the Chilling Penalty state and unleashing more powerful attacks than before.\nChilling Penalty\nIncreases Wriothesley's interruption resistance\nWhen his HP is above 50%, it will enhance the Repelling Fists of Normal Attack: Forceful Fists of Frost and increase its DMG. When such an attack hits, it will consume a fixed amount of Wriothesley's HP. HP can be lost this way once every 0.1s.\nThis effect will be canceled should Wriothesley leave the field.\n\"Past convictions are past. It is our future choices that we must grasp.\"\n\"Defy your fate, or else this glutton be, to pay your fate's due, by the crime and thee.\"",
        "icon": "/img/talents/wriothesley_skill.png"
      },
      "elementalBurst": {
        "name": "Darkgold Wolfbite",
        "description": "Activating his boxing gloves, Wriothesley strikes out with an icy straight, then uses Icicle Impact to cause multiple instances of AoE Cryo DMG in a frontal area.\nArkhe: Ousia\nAfter Icicle Impact ends, a Surging Blade will descend upon the opponent's position, dealing Ousia-aligned Cryo DMG.\nThere are some things that even the Duke of the Fortress of Meropide can do little about  for example, complicated paperwork, the trivialities of a supervisor, or even... little kids pasting a whole host of cute but difficult-to-remove stickers on his boxing gloves.",
        "icon": "/img/talents/wriothesley_burst.png"
      },
      "passiveTalents": [
        {
          "name": "The Duke's Grace",
          "description": "When Wriothesley crafts Weapon Ascension Materials, he has a 10% chance to receive double the product.",
          "icon": "/img/talents/wriothesley_passive1.png"
        },
        {
          "name": "There Shall Be a Plea for Justice",
          "description": "When Wriothesley's HP is less than 60%, he will obtain a Gracious Rebuke. The next Charged Attack of his Normal Attack: Forceful Fists of Frost will be enhanced to become Rebuke: Vaulting Fist. It will not consume Stamina, will deal 50% increased DMG, and after hitting will restore HP for Wriothesley equal to 30% of his Max HP.\nYou can gain a Gracious Rebuke this way once every 5s.",
          "icon": "/img/talents/wriothesley_passive2.png"
        },
        {
          "name": "There Shall Be a Reckoning for Sin",
          "description": "When Wriothesley's current HP increases or decreases, if he is in the Chilling Penalty state conferred by Icefang Rush, Chilling Penalty will gain one stack of Prosecution Edict. Max 5 stacks. Each stack will increase Wriothesley's ATK by 6%.",
          "icon": "/img/talents/wriothesley_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Xiangling",
    "talents": {
      "normalAttack": {
        "name": "Dough-Fu",
        "description": "Normal Attack\nPerforms up to 5 consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/xiangling_attack.png"
      },
      "elementalSkill": {
        "name": "Guoba Attack",
        "description": "Summons Guoba the Panda. Guoba continuously breathes fire, dealing AoE Pyro DMG.",
        "icon": "/img/talents/xiangling_skill.png"
      },
      "elementalBurst": {
        "name": "Pyronado",
        "description": "Displaying her mastery over both fire and polearms, Xiangling sends a Pyronado whirling around her.\n\nThe Pyronado will move with your character for so long as the ability persists, dealing Pyro DMG to all enemies in its path.",
        "icon": "/img/talents/xiangling_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Crossfire",
          "description": "Increases the flame range of Guoba by 20%.",
          "icon": "/img/talents/xiangling_passive1.png"
        },
        {
          "name": "Beware, It's Super Hot!",
          "description": "When Guoba Attack's effect ends, Guoba leaves a chili pepper on the spot where it disappeared. Picking up a chili pepper increases ATK by 10% for 10s.",
          "icon": "/img/talents/xiangling_passive2.png"
        },
        {
          "name": "Chef de Cuisine",
          "description": "When Xiangling cooks an ATK-boosting dish perfectly, she has a 12% chance to receive double the product.",
          "icon": "/img/talents/xiangling_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Xianyun",
    "talents": {
      "normalAttack": {
        "name": "Word of Wind and Flower",
        "description": "Normal Attack\nSummons swirling winds to perform up to 4 attacks, dealing Anemo DMG.\nCharged Attack\nConsumes a certain amount of Stamina and launches a Breeze Bolt in a straight line that deals Anemo DMG to opponents along its path.\nPlunging Attack\nGathers the power of Anemo and plunges towards the ground from mid-air, damaging all opponents in her path. Deals AoE Anemo DMG upon impact with the ground.",
        "icon": "/img/talents/xianyun_attack.png"
      },
      "elementalSkill": {
        "name": "White Clouds at Dawn",
        "description": "Xianyun enters the Cloud Transmogrification state, in which she will not take Fall DMG, and uses Skyladder once.\nIn this state, her Plunging Attack will be converted into Driftcloud Wave instead, which deals AoE Anemo DMG and ends the Cloud Transmogrification state. This DMG is considered Plunging Attack DMG.\nEach use of Skyladder while in this state increases the DMG and AoE of the next Driftcloud Wave used.\n\nSkyladder\nCan be used while in mid-air. Xianyun leaps forward, dealing Anemo DMG to targets along her path.\n\nDuring each Cloud Transmogrification state Xianyun enters, Skyladder may be used up to 3 times and only 1 instance of Skyladder DMG can be dealt to any one opponent.\nIf Skyladder is not used again in a short period, the Cloud Transmogrification state will be canceled.\nIf Xianyun does not use Driftcloud Wave while in this state, the next CD of White Clouds at Dawn will be decreased by 3s.",
        "icon": "/img/talents/xianyun_skill.png"
      },
      "elementalBurst": {
        "name": "Stars Gather at Dusk",
        "description": "Brings forth a sacred breeze that deals AoE Anemo DMG and heals all nearby characters based on Xianyun's ATK. It will also summon the \"Starwicker\" mechanism.\n\nStarwicker\nContinuously follows the active character and periodically heals all nearby characters based on Xianyun's ATK.\nStarts with 8 stacks of Adeptal Assistance. While Adeptal Assistance is active, nearby active characters will have their jump height increased.\nWhen the active character completes a Plunging Attack, Starwicker will consume 1 stack of Adeptal Assistance and deal AoE Anemo DMG.\nOnly 1 Starwicker can exist simultaneously.",
        "icon": "/img/talents/xianyun_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Galefeather Pursuit",
          "description": "Each opponent hit by Driftcloud Waves from White Clouds at Dawn will grant all nearby party members 1 stack of Storm Pinion for 20s. Max 4 stacks. These will cause the characters' Plunging Attack CRIT Rate to increase by 4%/6%/8%/10% respectively.\nEach Storm Pinion created by hitting an opponent has an independent duration.",
          "icon": "/img/talents/xianyun_passive1.png"
        },
        {
          "name": "Consider, the Adeptus in Her Realm",
          "description": "When the Starwicker created by Stars Gather at Dusk has Adeptal Assistance stacks, nearby active characters' Plunging Attack shockwave DMG will be increased by 200% of Xianyun's ATK. The maximum DMG increase that can be achieved this way is 9,000.\nEach Plunging Attack shockwave DMG instance can only apply this increased DMG effect to a single opponent. Each character can trigger this effect once every 0.4s.",
          "icon": "/img/talents/xianyun_passive2.png"
        },
        {
          "name": "Crane Form",
          "description": "Increases gliding SPD for your own party members by 15%.\nNot stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/xianyun_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Xiao",
    "talents": {
      "normalAttack": {
        "name": "Whirlwind Thrust",
        "description": "Normal Attack\nPerform up to 6 rapid strikes.\nCharged Attack\nDive down and impact the ground, causing damage relative to the falling height. Can only be triggered in mid-air.",
        "icon": "/img/talents/xiao_attack.png"
      },
      "elementalSkill": {
        "name": "Lemniscatic Wind Cycling",
        "description": "He lunges forward, dealing Anemo DMG to enemies along the path.\nCan be used in mid-air.\nHas 2 charges to begin with.",
        "icon": "/img/talents/xiao_skill.png"
      },
      "elementalBurst": {
        "name": "Bane of All Evil",
        "description": "Takes on the form of the yaksha that terrified both demons and archons alike millennia ago. For its duration, increases Xiao's attack range and DMG, while converting damage type to Anemo and enhancing Xiao's jumping ability.\nMaintaining this form continuously drains Xiao's HP.",
        "icon": "/img/talents/xiao_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Evil Conqueror - Tamer of Demons",
          "description": "Starting Bane of All Evil increases Xiao's DMG by 5%. After this, Xiao's DMG continues to increase by 5% every 3s until the skill ends. Max 25% increase.",
          "icon": "/img/talents/xiao_passive1.png"
        },
        {
          "name": "Dissolution Eon - Heaven Fall",
          "description": "When Lemniscatic Wind Cycling is used, increases all subsequent Lemniscatic Wind Cycling's DMG by 10% for 6s. Max 3 stacks. Duration refreshes with new stacks.",
          "icon": "/img/talents/xiao_passive2.png"
        },
        {
          "name": "Transcension - Gravity Defier",
          "description": "Decreases all party member's falling DMG by 30%.\nThe greatest effect out of all Talents of the same type prevails.",
          "icon": "/img/talents/xiao_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Xingqiu",
    "talents": {
      "normalAttack": {
        "name": "Guhua Style",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-aur to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/xingqiu_attack.png"
      },
      "elementalSkill": {
        "name": "Guhua Sword - Fatal Rainscreen",
        "description": "Xingqiu performs twin strikes with his sword, dealing Hydro DMG. At the same time, this ability creates the maximum number of Rain Swords, which will orbit the character.\n\nThe Rain Swords have the following properties:\n\nWhen a character takes DMG, the Rain Sword will shatter, reducing the amount of DMG taken.\nIncreases the character's resistance to interruption.\n\n20% of Xingqiu's Hydro DMG Bonus will be converted to additional DMG Reduction for the Rain Swords.\nThe maximum amount of additional DMG Reduction that can be gained this way is 24%.\n\nThe initial maximum number of Rain Swords is 3.\n\nUsing this ability applies the Wet status onto the character.",
        "icon": "/img/talents/xingqiu_skill.png"
      },
      "elementalBurst": {
        "name": "Guhua Sword - Raincutter",
        "description": "Initiate Rainbow Bladework and fight using an illusory sword rain, while creating the maximum number of Rain Swords.\nRainbow Bladework\n\nNormal Attacks will trigger consecutive sword rain attacks, dealing Hydro DMG.\nRain Swords will remain at the maximum number throughout the ability's duration.\n\nThese effects carry over to other characters.",
        "icon": "/img/talents/xingqiu_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Hydropathic",
          "description": "When a Rain Sword is shattered or when its duration expires, it regenerates the current character's HP based on 6% of Xingqiu's Max HP.",
          "icon": "/img/talents/xingqiu_passive1.png"
        },
        {
          "name": "Blades Amidst Raindrops",
          "description": "Xingqiu gains a 20% Hydro DMG Bonus.",
          "icon": "/img/talents/xingqiu_passive2.png"
        },
        {
          "name": "Flash of Genius",
          "description": "When Xingqiu crafts Character Talent Materials, he has a 25% chance to refund a portion of the crafting materials used.",
          "icon": "/img/talents/xingqiu_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Xinyan",
    "talents": {
      "normalAttack": {
        "name": "Dance on Fire",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes.\nCharged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby enemies.\n\nAt the end of the sequence, perform a more powerful slash.\nPlunging Attack\nPlunges from mid-air to strike the ground, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/xinyan_attack.png"
      },
      "elementalSkill": {
        "name": "Sweeping Fervor",
        "description": "Xinyan brandishes her instrument, dealing Pyro DMG on nearby enemies, forming a shield made out of her audience's passion.\nThe shield's DMG Absorption scales based on Xinyan's DEF and on the number of enemies hit.\n\nHitting 0-1 enemies grants Shield Level 1: Ad Lib.\nHitting 2 enemies grants Shield Level 2: Lead-In.\nHitting 3 or more enemies grants Shield Level 3: Rave, which will also deal intermittent Pyro DMG to nearby enemies.\n\nThe shield has the following special properties:\n\nWhen unleashed, it infuses Xinyan with Pyro.\nIt has 250% DMG Absorption effectiveness against Pyro DMG.\n",
        "icon": "/img/talents/xinyan_skill.png"
      },
      "elementalBurst": {
        "name": "Riff Revolution",
        "description": "Strumming rapidly, Xinyan launches nearby enemies and deals Physical DMG to them, hyping up the crowd. The sheer intensity of the atmosphere will cause explosions that deal Pyro DMG to nearby enemies.",
        "icon": "/img/talents/xinyan_burst.png"
      },
      "passiveTalents": [
        {
          "name": "\"The Show Goes On, Even Without an Audience...\"",
          "description": "Decreases the number of enemies Sweeping Fervor must hit to trigger each level of shielding.\n\nShield Level 2: Lead-In requirement reduced to 1 enemy hit.\nShield Level 3: Rave requirement reduced to 2 enemies hit or more.",
          "icon": "/img/talents/xinyan_passive1.png"
        },
        {
          "name": "\"...Now That's Rock 'N' Roll!\"",
          "description": "Characters shielded by Sweeping Fervor deal 15% increased Physical DMG.",
          "icon": "/img/talents/xinyan_passive2.png"
        },
        {
          "name": "A Rad Recipe",
          "description": "When a Perfect Cooking is achieved on an DEF-boosting dish, Xinyan has a 12% chance to obtain double the product.",
          "icon": "/img/talents/xinyan_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yae Miko",
    "talents": {
      "normalAttack": {
        "name": "Spiritfox Sin-Eater",
        "description": "Normal Attack\nSummons forth kitsune spirits, initiating a maximum of 3 attacks that deal Electro DMG\nCharged Attack\nConsumes a certain amount of Stamina to deal AoE Electro DMG after a short casting time.\nPlunging Attack\nPlunges towards the ground from mid-air, damaging all opponents in her path with thunderous might. Deals AoE Electro DMG upon impact with the ground.",
        "icon": "/img/talents/yae_miko_attack.png"
      },
      "elementalSkill": {
        "name": "Yakan Evocation: Sesshou Sakura",
        "description": "To Yae, such dull tasks as can be accomplished by driving spirits out need not be done personally.\nMoves swiftly, leaving a Sesshou Sakura behind.\nSesshou Sakura Has the following properties:\nPeriodically strikes one nearby opponent with lightning, dealing Electro DMG.\nWhen there are other Sesshou Sakura nearby, their level will increase, boosting the DMG dealt by these lightning strikes.\nThis skill has three charges.\n A maximum of 3 Sesshou Sakura can exist simultaneously. The initial level of each Sesshou Sakura is 1, and the initial highest level each sakura can reach is 3. If a new Sesshou Sakura is created too close to an existing one, the existing one will be destroyed.",
        "icon": "/img/talents/yae_miko_skill.png"
      },
      "elementalBurst": {
        "name": "Great Secret Art: Tenko Kenshin",
        "description": "Legends of 'kitsunetsuki,' or the manifestation of a kitsune's might, are common in Inazuma's folktales. One that particularly captures the imagination is that of the Sky Kitsune, said to cause lightning to fall down upon the foes of the Grand Narukami Shrine. Summons a lightning strike, dealing AoE Electro DMG.  When she uses this skill, Yae Miko will unseal nearby Sesshou Sakura, destroying their outer forms and transforming them into Tenko Thunderbolts that descend from the skies, dealing AoE Electro DMG. Each Sesshou Sakura destroyed in this way will create one Tenko Thunderbolt.",
        "icon": "/img/talents/yae_miko_burst.png"
      },
      "passiveTalents": [
        {
          "name": "The Shrine's Sacred Shade",
          "description": "When casting Great Secret Art: Tenko Kenshin, each Sesshou Sakura destroyed resets the cooldown for 1 charge of Yakan Evocation: Sesshou Sakura.",
          "icon": "/img/talents/yae_miko_passive1.png"
        },
        {
          "name": "Enlightened Blessing",
          "description": "Every point of Elemental Mastery Yae Miko possesses will increase Sesshou Sakura DMG by 0.15%.",
          "icon": "/img/talents/yae_miko_passive2.png"
        },
        {
          "name": "Meditations of a Yako",
          "description": "Has a 25% chance to get 1 regional Character Talent Material (base material excluded) when crafting. The rarity is that of the base material.",
          "icon": "/img/talents/yae_miko_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yanfei",
    "talents": {
      "normalAttack": {
        "name": "Seal of Approval",
        "description": "Normal Attack\nShoots fireballs that deal up to three counts of Pyro DMG. When Yanfei's Normal Attacks hit enemies, they will grant her a single Scarlet Seal. Yanfei may possess a maximum of 3 Scarlet Seals, and each time this effect is triggered, the duration of currently possessed Scarlet Seals will refresh. Each Scarlet Seal will decrease Yanfei's Stamina consumption and will disappear when she leaves the field.\nCharged Attack\nConsumes Stamina and all Scarlet Seals before dealing AoE Pyro DMG to the opponents after a short casting time. This Charged Attack's AoE and DMG will increase according to the amount of Scarlet Seals consumed.\nPlunging Attack\nGathering the power of Pyro, Yanfei plunges towards the ground from mid-air, damaging all opponents in her path. Deals AoE Pyro DMG upon impact with the ground.",
        "icon": "/img/talents/yanfei_attack.png"
      },
      "elementalSkill": {
        "name": "Signed Edict",
        "description": "Summons blistering flames that deal AoE Pyro DMG.\nIf this attack hits an enemy, Yanfei is granted the maximum number of Scarlet Seals.",
        "icon": "/img/talents/yanfei_skill.png"
      },
      "elementalBurst": {
        "name": "Done Deal",
        "description": "Triggers a spray of intense flames that rush at nearby opponents, dealing AoE Pyro DMG, granting Yanfei the maximum number of Scarlet Seals, and applying Brilliance to her.\nBrilliance\nPerodically grants Yanfei a Scarlet Seal. Increases the DMG of her Charged Attacks. The Brilliance effect stops when Yanfei leaves the field or dies.",
        "icon": "/img/talents/yanfei_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Proviso",
          "description": "When Yanfei consumes Scarlet Seals by using a Charged Attack, each Scarlet Seal will increase Yanfei's Pyro DMG Bonus by 5%. This effect lasts for 6s. When a Charged Attack is used again during the effect's duration, it will dispel the previous effect.",
          "icon": "/img/talents/yanfei_passive1.png"
        },
        {
          "name": "Blazing Eye",
          "description": "When Yanfei's Charged Attack deals a CRIT Hit to opponents, she will deal an additional instance of AoE Pyro DMG equal to 80% of her ATK. This DMG counts as Charged Attack DMG.",
          "icon": "/img/talents/yanfei_passive2.png"
        },
        {
          "name": "Encyclopedic Expertise",
          "description": "Displays the location of nearby resources unique to Liyue on the mini-map.",
          "icon": "/img/talents/yanfei_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yaoyao",
    "talents": {
      "normalAttack": {
        "name": "Toss 'N' Turn Spear",
        "description": "Normal Attack\nPerforms up to 4 consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/yaoyao_attack.png"
      },
      "elementalSkill": {
        "name": "Raphanus Sky Cluster",
        "description": "Calls upon Yuegui: Throwing Mode, a special device created by a certain adeptus to help Yaoyao solve her problems.\nThis skill will be used differently in Holding Mode.\nHold\nEnters Aiming Mode to adjust the throw direction.\nYuegui: Throwing Mode\nThrows out White Jade Radishes that will explode upon hitting characters or opponents, dealing Dendro DMG to opponents within a certain AoE, and healing characters within that same AoE based on Yaoyaos Max HP. If a radish does not hit either an opponent or a character, the radish will remain where it is and explode on contact with a character or opponent, or will explode after its duration expires.\nYuegui: Throwing Mode will choose its radish-throw targets.\nIf all nearby characters have more than 70% HP remaining, then it will throw the radish at a nearby opponent.\nIf nearby characters have 70% or less HP remaining, it will throw a radish at the character with the lowest HP percentage remaining. If no opponents exist nearby, Yuegui will also throw White Jade Radishes at characters if they all have more than 70% HP and less than 100% HP remaining. Otherwise, it will throw radishes into the area at random.\nA maximum of 2 instances of Yuegui: Throwing Mode can exist at any one time.",
        "icon": "/img/talents/yaoyao_skill.png"
      },
      "elementalBurst": {
        "name": "Moonjade Descent",
        "description": "At the enjoinment of a certain adeptus, Yueguis full potential can be unleashed in an emergency, dealing Dendro DMG to nearby opponents and entering an (in some sense) unsurpassed Adeptal Legacy state.\nAdeptal Legacy\nWhite Jade Radishes generated will be changed to heal and deal DMG according to this skill. Explosions will heal all nearby party members, and the Dendro DMG that they deal will be viewed as Elemental Burst DMG instead.\nSummons Yuegui: Jumping Mode at intervals until their limit has been reached. The behavior of this version of Yuegui is the same as that of Yuegui: Throwing Mode in the Elemental Skill, Raphanus Sky Cluster. A maximum of 3 Yuegui: Jumping Mode can exist at any one time.\nYaoyao's Movement SPD is increased by 15%.\nYaoyaos Dendro RES will be increased.\nThe Adeptal Legacy state will end once Yaoyao is off-field, and all remaining Yuegui: Jumping Mode will be cleared once this state ends.",
        "icon": "/img/talents/yaoyao_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Tailing on Tiptoes",
          "description": "When Yaoyao is in the party, your characters will not startle Crystalflies and certain other animals when getting near them.",
          "icon": "/img/talents/yaoyao_passive1.png"
        },
        {
          "name": "Starscatter",
          "description": "While affected by the Adeptal Legacy state caused by Moonjade Descent, Yaoyao will constantly throw White Jade Radishes at nearby opponents when she is sprinting, jumping, or running. She can throw 1 White Jade Radish this way once every 0.6s.",
          "icon": "/img/talents/yaoyao_passive2.png"
        },
        {
          "name": "In Others' Shoes",
          "description": "When White Jade Radishes explode, active characters within their AoE will regain HP every 1s based on 0.8% of Yaoyaos Max HP. This effect lasts 5s.",
          "icon": "/img/talents/yaoyao_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yelan",
    "talents": {
      "normalAttack": {
        "name": "Stealthy Bowshot",
        "description": "Normal Attack\nPerforms up to 4 consecutive shots with a bow.\nCharged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, flowing water will accumulate on the arrowhead. A fully charged torrential arrow will deal Hydro DMG.\nBreakthrough\nYelan will enter a \"Breakthrough\" state after spending 5s out of combat, which will cause her next Charged Aimed Shot to have 80% decreased charge time, and once charged, she can fire a \"Breakthrough Barb\" that will deal AoE Hydro DMG based on Yelan's Max HP. \nPlunging Attack\n Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/yelan_attack.png"
      },
      "elementalSkill": {
        "name": "Lingering Lifeline",
        "description": "Fires off a Lifeline that allows her to move rapidly, entangling and marking opponents along its path. When this rapid movement ends, the Lifeline will explode, dealing Hydro DMG to the marked opponents based on Yelan's Max HP.\nTap\nMoves a certain distance forward swiftly. \nHold\nEngages in continuous, swift movement, during which Yelan's resistance to interruption is increased. During this time, Yelan can control this rapid movement and end it by using this Skill again. \n Additionally, each opponent marked by the Lifeline when it explodes grants Yelan a 34% change to reset her Breakthrough state.\n",
        "icon": "/img/talents/yelan_skill.png"
      },
      "elementalBurst": {
        "name": "Depth-Clarion Dice",
        "description": "Deals AoE Hydro DMG and creates an \"Exquisite Throw,\" which aids her in battle. \nExquisite Throw\nFollows the character around and will initiate a coordinated attack under the following circumstances, dealing Hydro DMG based on Yelan's Max HP:\n* Can occur once every second when your active character uses a Normal Attack.\n* Will occur each time Yelan's Lifeline explodes and hits opponents.",
        "icon": "/img/talents/yelan_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Turn Control",
          "description": "When the party has 1/2/3/4 Elemental Types, Yelan's Max HP is increased by 6%/12%/18%/30%",
          "icon": "/img/talents/yelan_passive1.png"
        },
        {
          "name": "Adapt With Ease",
          "description": "So long as an \"Exquisite Throw,\" is in play, your own active character deals 1% more DMG. This increases by a further 3.5% DMG every second. The maximum increase to DMG dealt is 50% \nThe pre-existing effect will be dispelled if Depth-Clarion Dice is recast during its duration.",
          "icon": "/img/talents/yelan_passive2.png"
        },
        {
          "name": "Necessary Calculation",
          "description": "Gains 25% more rewards when dispatched on a Liyue Expedition for 20 hours.",
          "icon": "/img/talents/yelan_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yoimiya",
    "talents": {
      "normalAttack": {
        "name": "Firework Flare-Up",
        "description": "Normal Attack:\nPerforms up to 5 consecutive shots with a bow.\n\nCharged Attack:\nPerform a more precise Aimed Shot with increased DMG. While aiming, flames will accumulate on the arrowhead before being fired off as an attack. Has different effects based on how long the energy has been charged:\nCharge Level 1: Fires off a flaming arrow that deals Pyro DMG.\nCharge Level 2: Generates a maximum of 3 Kindling Arrows based on time spent charging, releasing them as part of this Aimed Shot. Kindling Arrows will home in on nearby opponents, dealing Pyro DMG on hit.\n\nPlunging Attack:\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact.",
        "icon": "/img/talents/yoimiya_attack.png"
      },
      "elementalSkill": {
        "name": "Niwabi Fire-Dance",
        "description": "Yoimiya waves a sparkler and causes a ring of saltpeter to surround her.\nNiwabi Enshou: During this time, arrows fired by Yoimiya's Normal Attack will be Blazing Arrows, and their DMG will be increased and converted to Pyro DMG. during this time, Firework Flare-Up will not generate Kindling Arrows at Charge Level 2.\nThis effect will deactivate when Yoimiya leaves the field.",
        "icon": "/img/talents/yoimiya_skill.png"
      },
      "elementalBurst": {
        "name": "Ryuukin Saxifrage",
        "description": "Yoimiya leaps into the air along with her original creation, the \"Ryuukin Saxifrage,\" and fires forth blazing rockets bursting with surprises that deal AoE Pyro DMG and mark one of the hit opponents with Aurous Blaze.\nAurous Blaze: All Normal/Charged/Plunging Attacks, Elemental Skills, and Elemental Bursts by any party member other than Yoimiya that hit an opponent marked by Aurous Blaze will trigger an explosion, dealing AoE Pyro DMG.\nWhen an opponent affected by Aurous Blaze is defeated before its duration expires, the effect will pass on to another nearby opponent, who will inherit the remaining duration.\nOne Aurous Blaze explosion can be triggered every 2s. When Yoimiya is down, Aurous Blaze effects created through her skills will be deactivated.",
        "icon": "/img/talents/yoimiya_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Tricks of the Trouble-Maker",
          "description": "During Niwabi Fire-Dance, shots from Yoimiya's Normal Attack will increase her Pyro DMG Bonus by 2% on hit. This effect lasts for 3s and can have a maximum of 10 stacks.",
          "icon": "/img/talents/yoimiya_passive1.png"
        },
        {
          "name": "Summer Night's Dawn",
          "description": "Using Ryuukin Saxifrage causes nearby party members (not including Yoimiya) to gain a 10% ATK increase for 15s. Additionally, a further ATK Bonus will be added on based on the number of \"Tricks of the Trouble-Maker\" stacks Yoimiya possesses when using Ryuukin Saxifrage. Each stack increases this ATK Bonus by 1%.",
          "icon": "/img/talents/yoimiya_passive2.png"
        },
        {
          "name": "Blazing Match",
          "description": "When Yoimiya crafts Decoration, Ornament, and Landscape-type Furnishings, she has a 100% chance to refund a portion of the materials used.",
          "icon": "/img/talents/yoimiya_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yun Jin",
    "talents": {
      "normalAttack": {
        "name": "Cloud-Grazing Strike",
        "description": "Normal Attack\nPerforms up to 5 consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/yun_jin_attack.png"
      },
      "elementalSkill": {
        "name": "Opening Flourish",
        "description": "Press\nFlourishes her polearm in a cloud-grasping stance, dealing Geo DMG.\nHold\nTakes up the Opening Flourish stance and charges up, forming a shield. DMG Absorption is based on Yun Jin's Max HP and has 150% effectiveness against all Elemental DMG and Physical DMG. The shield lasts until she finishes unleashing her Elemental Skill. When the skill is released, when its duration ends, or when the shield breaks, Yun Jin will unleash the charged energy as an attack, dealing Geo DMG. Based on the time spent charging, it will either unleash an attack at Charge Level 1 or Level 2.",
        "icon": "/img/talents/yun_jin_skill.png"
      },
      "elementalBurst": {
        "name": "Cliffbreaker's Banner'",
        "description": "Deals AoE Geo DMG and grants all nearby party members a Flying Cloud Flag Formation.\nFlying Cloud Flag Formation\nWhen Normal Attack DMG is dealt to opponents, Bonus DMG will be dealt based on Yun Jin's current DEF. The effects of this skill will be cleared after a set duration or after being triggered a specific number of times. When one Normal Attack hits multiple opponents, the effect is triggered multiple times according to the number of opponents hit. The number of times that the effect is triggered is counted independently for each member of the party with Flying Cloud Flag Formation.",
        "icon": "/img/talents/yun_jin_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Light Nourishment",
          "description": "When Perfect Cooking is achieved on Food with Adventure-related effects, there is a 12% chance to obtain double the product.",
          "icon": "/img/talents/yun_jin_passive1.png"
        },
        {
          "name": "True to Oneself",
          "description": "Using Opening Flourish at the precise moment when Yun Jin is attacked will unleash its Level 2 Charged (Hold) form.",
          "icon": "/img/talents/yun_jin_passive2.png"
        },
        {
          "name": "Breaking Conventions",
          "description": "The Normal Attack DMG Bonus granted by Flying Cloud Flag Formation is further increased by 2.5%/5%/7.5%/11.5% of Yun Jin's DEF when the party contains characters of 1/2/3/4 Elemental Types, respectively.",
          "icon": "/img/talents/yun_jin_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Zhongli",
    "talents": {
      "normalAttack": {
        "name": "Rain of Stone",
        "icon": "/img/talents/zhongli_attack.png",
        "description": "Normal Attack\nPerforms up to 6 consecutive spear strikes.\nCharged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact."
      },
      "elementalSkill": {
        "name": "Dominus Lapidis",
        "icon": "/img/talents/zhongli_skill.png",
        "description": "Press\nCommands the omnipresent power of earth to solidify into a Stone Stele, dealing AoE Geo DMG.\nAdditionally, the Stone Stele will resonate with other Geo Constructs in the vicinity, dealing Geo DMG to surrounding enemies.\nThe Stone Stele is considered a Geo Construct, and can both be climbed and used to block attacks. Only one may exist at any one time.\nHold\nCauses nearby Geo energy to explode, causing the following effects:\n\nCreates a shield of jade. The shield's DMG Absorption scales based on Zhongli's Max HP, and absorbs Geo DMG 250% more effectively.\nCauses AoE Geo DMG.\nIf there are nearby targets with the Geo element, it will drain a large amount of Geo element from a maximum of 2 such targets. This effect does not cause DMG.\n\nStone Stele\nWhen created, deals AoE Geo DMG.\nAdditionally, it will intermittently resonate with other nearby Geo constructs, dealing Geo DMG to nearby opponents.\nThe Stone Stele is considered a Geo construct that can both be climbed and used to block attacks.\nOnly one Stele created by Zhongli himself may initially exist at any one time.\n\nJade Shield\nPossesses 150% DMG Absorption against all Elemental and Physical DMG.\nCharacters protected by the Jade Shield will decrease the Elemental RES and Physical RES of opponents in a small AoE by 20%. This effect cannot be stacked."
      },
      "elementalBurst": {
        "name": "Planet Befall",
        "icon": "/img/talents/zhongli_burst.png",
        "description": "Brings a falling meteor down to earth, dealing massive Geo DMG to opponents caught in its AoE and applying the Petrification status to them.\nPetrification\nOpponents affected by the Petrification status cannot move."
      },
      "passiveTalents": [
        {
          "name": "Resonant Waves",
          "icon": "/img/talents/zhongli_passive1.png",
          "description": "When the Jade Shield takes DMG, it will Fortify:\n\nFortified characters have 5% increased Shield Strength.\n\nCan stack up to 5 times, and lasts until the Jade Shield dissapears."
        },
        {
          "name": "Dominance of Earth",
          "icon": "/img/talents/zhongli_passive2.png",
          "description": "Zhongli deals bonus DMG based on his Max HP:\nNormal Attack, Charged Attack, and Plunging Attack DMG is increased by 1.39% of Max HP.\nDominus Lapidis' Stone Stele, resonance, and hold DMG is increased by 1.9% of Max HP.\nPlanet Befall's DMG is increased by 33% of Max HP."
        },
        {
          "name": "Arcanum of Crystal",
          "icon": "/img/talents/zhongli_passive3.png",
          "description": "Refunds 15% of the ores used when crafting Polearm-type weapons."
        }
      ]
    }
  }
]