[
  {
    "character": "Albedo",
    "talents": {
      "normalAttack": {
        "name": "Favonius Bladework - Weiss",
        "description": "Normal Attack\nPerform up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/albedo_attack.png"
      },
      "elementalSkill": {
        "name": "Abiogenesis: Solar Isotoma",
        "description": "Albedo creates a Solar Isotoma using alchemy, which deals AoE Geo DMG on appearance. Solar Isotoma\n\nWhen enemies within the Solar Isotoma zone are hit, the Solar Isotoma will generate Transient Blossoms which deal AoE Geo DMG. DMG dealt scales off Albedo's DEF.",
        "icon": "/img/talents/albedo_skill.png"
      },
      "elementalBurst": {
        "name": "Rite of Progeniture: Tectonic Tide",
        "description": "Under Albedo's command, Geo crystals surge and burst forth, dealing AoE Geo DMG in front of him. If a Solar Isotoma created by Albedo himself is on the field, 7 Fatal Blossoms will be generated in the Solar Isotoma field, bursting violently into bloom and dealing AoE Geo DMG\nTecotonic Tide DMG and Fatal Blossom DMG will not generate Transient Blossoms.",
        "icon": "/img/talents/albedo_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Calcite Might",
          "description": "Transient Blossoms generated by Abiogenesis: Solar Isotoma deal 25% more DMG to enemies whose HP is below 50%.",
          "icon": "/img/talents/albedo_passive1.png"
        },
        {
          "name": "Homuncular Nature",
          "description": "Using Rite of Progeniture: Tectonic Tide increases the Elemental Mastery of nearby party members by 125 for 10s.",
          "icon": "/img/talents/albedo_passive2.png"
        },
        {
          "name": "Flash of Genius",
          "description": "When Albedo crafts Weapon Ascension Materials, he has a 10% chance to receive double the product.",
          "icon": "/img/talents/albedo_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Alhaitham",
    "talents": {
      "normalAttack": {
        "name": "Abductive Reasoning",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/alhaitham_attack.png"
      },
      "elementalSkill": {
        "name": "Universality: An Elaboration on Form",
        "description": "Rushes forward, dealing Dendro DMG to nearby opponents when the rush ends, causing a Chisel-Light Mirror to form. Holding this skill will cause it to behave differently. Hold\nEnters Aiming Mode to adjust the direction of Alhaitham's rush attack.",
        "icon": "/img/talents/alhaitham_skill.png"
      },
      "elementalBurst": {
        "name": "Particular Field: Fetters of Phenomena",
        "description": "Creates a Particular Binding Field and deals multiple instances of AoE Dendro DMG. If Chisel-Light Mirrors exist when this ability is unleashed, all such Mirrors will be consumed and increase the number of DMG instances dealt. 2s after this ability is unleashed, if 0/1/2/3 Mirrors were consumed, Alhaitham will generate 3/2/1/0 new Mirrors in turn.",
        "icon": "/img/talents/alhaitham_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Four-Causal Correction",
          "description": "When Alhaitham's Charged or Plunging Attacks hit opponents, they will generate 1 Chisel-Light Mirror. This effect can be triggered once every 12s.",
          "icon": "/img/talents/alhaitham_passive1.png"
        },
        {
          "name": "Mysteries Laid Bare",
          "description": "Each point of Alhaitham's Elemental Mastery will increase the DMG dealt by Projection Attacks and Particular Field: Fetters of Phenomena by 0. 1%. The maximum DMG increase this way for both these abilities is 100%.",
          "icon": "/img/talents/alhaitham_passive2.png"
        },
        {
          "name": "Law of Reductive Overdetermination",
          "description": "When Alhaitham crafts Weapon Ascension Materials, he has a 10% chance to receive double the product.",
          "icon": "/img/talents/alhaitham_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Aloy",
    "talents": {
      "normalAttack": {
        "name": "Rapid Fire",
        "description": "Normal Attack\nPerform up to 4 consecutive shots with a bow. Charged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, biting frost will accumulate on the arrowhead.",
        "icon": "/img/talents/aloy_attack.png"
      },
      "elementalSkill": {
        "name": "Frozen Wilds",
        "description": "Aloy throws a Freeze Bomb in the targeted direction and triggers an explosion, dealing Cryo DMG. After it explodes, the Freeze Bomb will split up into many Chillwater Bomblets that explode on contact with opponents or after a short delay, dealing Cryo DMG. When a Freeze Bomb or Chillwater Bomblet hits an opponent, the opponent's ATK is decreased and Aloy receives 1 Coil stack.",
        "icon": "/img/talents/aloy_skill.png"
      },
      "elementalBurst": {
        "name": "Prophecies of Dawn",
        "description": "Aloy throws a Power Cell filled with Cryo in the targeted direction, then detonates it with an arrow, dealing AoE Cryo Damage.",
        "icon": "/img/talents/aloy_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Combat Override",
          "description": "When Aloy receives the Coil effect from Frozen Wilds, her ATK is increased by 16%, while nearby party members' ATK is increased by 8%. This effect lasts 10s.",
          "icon": "/img/talents/aloy_passive1.png"
        },
        {
          "name": "Strong Strike",
          "description": "When Aloy is in the Rushing Ice state conferred by Frozen Wilds, her Cryo DMG Bonus increases by 3. 5% every 1s. A maximum Cryo DMG Bonus increase of 35% can be gained in this way.",
          "icon": "/img/talents/aloy_passive2.png"
        },
        {
          "name": "Easy Does It",
          "description": "When Aloy is in the party, animals who produce Fowl, Raw Meat, or Chilled Meat will not be startled when party members approach them.",
          "icon": "/img/talents/aloy_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Amber",
    "talents": {
      "normalAttack": {
        "name": "Sharpshooter",
        "description": "Normal Attack\nPerforms up to 5 consecutive shots with a bow. Charged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, flames accumulates on the arrowhead.",
        "icon": "/img/talents/amber_attack.png"
      },
      "elementalSkill": {
        "name": "Explosive Puppet",
        "description": "Baron Bunny\n\nContinuously taunts the enemy, drawing their fire. Baron Bunny's HP scales with Amber's Max HP. When destroyed or when its timer expires, Baron Bunny explodes, dealing AoE Pyro DMG.",
        "icon": "/img/talents/amber_skill.png"
      },
      "elementalBurst": {
        "name": "Fiery Rain",
        "description": "Fires of a shower of arrows, dealing continuous AoE Pyro DMG.",
        "icon": "/img/talents/amber_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Every Arrow Finds Its Target",
          "description": "Increases the CRIT Rate of Fiery Rain by 10% and widens its AoE by 30%.",
          "icon": "/img/talents/amber_passive1.png"
        },
        {
          "name": "Precise Shot",
          "description": "Aimed Shot hits on weak spots increase Base ATK by 15% for 10s.",
          "icon": "/img/talents/amber_passive2.png"
        },
        {
          "name": "Gliding Champion",
          "description": "Decreases all party members' gliding Stamina Consumption by 20%. The greatest effect out of all Talents of the same type prevails.",
          "icon": "/img/talents/amber_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Arataki Itto",
    "talents": {
      "normalAttack": {
        "name": "Fight Club Legend",
        "description": "Normal Attack\nPerform up to 4 consecutive strikes. Charged Attack\nWhen holding to perform a Charged Attack, Itto unleashes a series of Arataki Kesagiri slashes without consuming Stamina. Instead, each Arataki Kesagiri slash consumes 1 stack of Superlative Superstrength.",
        "icon": "/img/talents/arataki_itto_attack.png"
      },
      "elementalSkill": {
        "name": "Masatsu Zetsugi: Akaushi Burst!",
        "description": "Hurls Ushi, the young akaushi bull and auxiliary member of the Arataki Gang, dealing Geo DMG to opponents on hit. When Ushi hits opponents, Arataki Itto gains 1 stack of Superlative Superstrength.",
        "icon": "/img/talents/arataki_itto_skill.png"
      },
      "elementalBurst": {
        "name": "Royal Descent: Behold, Itto the Evil!",
        "description": "Time to show 'em the might of the Arataki Gang! For a time, Itto lets out his inner Raging Oni King, wielding his Oni King's Kanabou in battle.",
        "icon": "/img/talents/arataki_itto_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Woodchuck Chucked",
          "description": "When a party member uses attacks to obtain wood from a tree, they have a 25% chance to get an additional log of wood.",
          "icon": "/img/talents/arataki_itto_passive1.png"
        },
        {
          "name": "Arataki Ichiban",
          "description": "When Arataki Itto uses consecutive Arataki Kesagiri, he obtains the following effects:\n - Each slash increases the ATK SPD of the next slash by 10%. Max ATK SPD increase is 30%. - Increases his resistance to interruption.",
          "icon": "/img/talents/arataki_itto_passive2.png"
        },
        {
          "name": "Bloodline of the Crimson Oni",
          "description": "Arataki Kesagiri DMG is increased by 35% of Arataki Itto's DEF.",
          "icon": "/img/talents/arataki_itto_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Arlecchino",
    "talents": {
      "normalAttack": {
        "name": "Normal Attack: Invitation to a Beheading",
        "description": "Normal Attack\nPerforms up to 6 consecutive spear strikes. Charged Attack\nConsumes a fixed amount of Stamina, dashing toward a nearby opponent and cleaving once. Continuously holding this button will cause Arlecchino to consume Stamina and engage in up to 5s of high-speed movement.",
        "icon": "/img/talents/arlecchino_attack.png"
      },
      "elementalSkill": {
        "name": "All Is Ash",
        "description": "Summons forth Balemoon Bloodfire, dealing Pyro DMG to multiple nearby opponents and performing a dash-cleave against one of them, dealing AoE Pyro DMG. Opponents hit by the aforementioned attack will have a Blood-Debt Directive applied to them. Blood-Debt Directive\nLasts 30s.",
        "icon": "/img/talents/arlecchino_skill.png"
      },
      "elementalBurst": {
        "name": "Balemoon Rising",
        "description": "Arlecchino's great wing of Balemoon Bloodfire beats as she absorbs and clears Blood-Debt Directives around her. She deals AoE Pyro DMG before clearing the CD of All Is Ash and healing herself. The healing is based on her Bond of Life value and ATK.",
        "icon": "/img/talents/arlecchino_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Agony Alone May Be Repaid",
          "description": "Blood-Debt Directives have the following characteristics:\nArlecchino will be granted a Bond of Life worth 130% of her Max HP when an opponent to which she herself applied a Directive is defeated. 5s after a Directive is applied, it will be upgraded to a Blood-Debt Due. When absorbed, it will instead grant Arlecchino a Bond of Life worth 130%.",
          "icon": "/img/talents/arlecchino_passive1.png"
        },
        {
          "name": "Strength Alone Can Defend",
          "description": "Arlecchino gains 1% All Elemental and Physical RES for every 100 ATK she has in excess of 1,000. The maximum RES increase she can gain this way for each is 20%.",
          "icon": "/img/talents/arlecchino_passive2.png"
        },
        {
          "name": "The Balemoon Alone May Know",
          "description": "While in combat, Arlecchino gains a 40% Pyro DMG Bonus and can only be healed through Balemoon Rising.",
          "icon": "/img/talents/arlecchino_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kamisato Ayaka",
    "talents": {
      "normalAttack": {
        "name": "Kamisato Art - Kabuki",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash a flurry of sword ki. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kamisato_ayaka_attack.png"
      },
      "elementalSkill": {
        "name": "Kamisato Art: Hyouka",
        "description": "Summons blooming ice to launch nearby opponents, dealing AoE Cryo DMG.",
        "icon": "/img/talents/kamisato_ayaka_skill.png"
      },
      "elementalBurst": {
        "name": "Kamisato Art: Soumetsu",
        "description": "Summons forth a snowstorm with flawless poise, unleasing a Frostflake Seki no To that moves forward continously. Frostflake Seki no To\nA storm of whirling icy winds that slashes repeatedly at every enemy it touches, dealing Cryo DMG. The snowstorm explodes after its duration ends, dealing AoE Cryo DMG.",
        "icon": "/img/talents/kamisato_ayaka_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Amatsumi Kunitsumi Sanctification",
          "description": "After using Kamisato Art: Hyouka, Kamisato Ayaka's Normal and Charged attacks deal 30% increased DMG for 6s.",
          "icon": "/img/talents/kamisato_ayaka_passive1.png"
        },
        {
          "name": "Kanten Senmyou Blessing",
          "description": "When the Cryo application at the end of Kamisato Art: Senho hits an opponent, Kamisato Ayaka gains the following effects:\nRestores 10 Stamina\nGains 18% Cryo DMG Bonus for 10s.",
          "icon": "/img/talents/kamisato_ayaka_passive2.png"
        },
        {
          "name": "Fruits of Shinsa",
          "description": "When Ayaka crafts Weapon Ascension Materials, she has a 10% chance to receive double the product.",
          "icon": "/img/talents/kamisato_ayaka_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kamisato Ayato",
    "talents": {
      "normalAttack": {
        "name": "Kamisato Art - Marobashi",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to dash forward and perform an iai. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kamisato_ayato_attack.png"
      },
      "elementalSkill": {
        "name": "Kamisato Art: Kyouka",
        "description": "Kamisato Ayato shifts positions and enters the Takimeguri Kanka state. After this shift, he will leave a watery illusion at his original location. After it is formed, the watery illusion will explode if opponents are nearby or after its duration ends, dealing AoE Hydro DMG\nTakimeguri Kanka\nIn this state, Kamisato Ayato uses his Shunsuiken to engage in blindingly fast attacks, causing DMG from his Normal Attacks to be converted into AoE Hydro DMG.",
        "icon": "/img/talents/kamisato_ayato_skill.png"
      },
      "elementalBurst": {
        "name": "Kamisato Art: Suiyuu",
        "description": "Unveils a garden of purity that silences the cacophony within. While this space exists, Bloomwater Blades will constantly rain down and attack opponents within its AoE, dealing Hydro DMG and increasing the Normal Attack DMG of characters within.",
        "icon": "/img/talents/kamisato_ayato_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Kamisato Art: Mine Wo Matoishi Kiyotaki",
          "description": "Kamisato Art: Kyouka has the following properties:\nAfter it is used, Kamisato Ayato will gain 2 Namisen stacks. When the water illusion explodes, Ayato will gain a Namisen effect equal to the maximum number of stacks possible.",
          "icon": "/img/talents/kamisato_ayato_passive1.png"
        },
        {
          "name": "Kamisato Art: Michiyuku Hagetsu",
          "description": "If Kamisato Ayato is not on the field and his Energy is less than 40, he will regenerate 2 Energy for himself every second.",
          "icon": "/img/talents/kamisato_ayato_passive2.png"
        },
        {
          "name": "Kamisato Art: Daily Cooking",
          "description": "When Ayato cooks a dish perfectly, he has a 18% chance to receive an additional \"Suspicious\" dish of the same type.",
          "icon": "/img/talents/kamisato_ayato_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Baizhu",
    "talents": {
      "normalAttack": {
        "name": "The Classics of Acupuncture",
        "description": "Normal Attack\nPerforms up to 4 attacks that deal Dendro DMG to opponents in front of him. Charged Attack\nConsumes a certain amount of Stamina to deal AoE Dendro DMG to opponents in front of him after a short casting time. Plunging Attack\nCalling upon the might of Dendro, Baizhu plunges towards the ground from mid-air, damaging all opponents in his path.",
        "icon": "/img/talents/baizhu_attack.png"
      },
      "elementalSkill": {
        "name": "Universal Diagnosis",
        "description": "Controls a Gossamer Sprite that cruises and attacks nearby opponents, dealing Dendro DMG. After it performs 3 attacks or if there are no opponents nearby, the Sprite will return, healing all nearby party members based on Baizhu's Max HP. Those in the medical field who can read true signs of illness from false ones may even cure people before any symptoms can show.",
        "icon": "/img/talents/baizhu_skill.png"
      },
      "elementalBurst": {
        "name": "Holistic Revivification",
        "description": "Enters the Pulsing Clarity state, creating a Seamless Shield that absorbs Dendro DMG with 250% effectiveness. While in this state, Baizhu will generate a new Seamless Shield every 2. 5s.",
        "icon": "/img/talents/baizhu_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Herbal Nourishment",
          "description": "When Baizhu is in the party, interacting with certain harvestable items will heal your current active character for 2. 5% of Baizhu's Max HP.",
          "icon": "/img/talents/baizhu_passive1.png"
        },
        {
          "name": "Five Fortunes Forever",
          "description": "Baizhu gains different effects according to the current HP of your current active character:\nWhen their HP is less than 50%, Baizhu gains 20% Healing Bonus. When their HP is equal to or more than 50%, Baizhu gains 25% Dendro DMG Bonus.",
          "icon": "/img/talents/baizhu_passive2.png"
        },
        {
          "name": "All Things Are of the Earth",
          "description": "Characters who are healed by Seamless Shields will gain the Year of Verdant Favor effect: Each 1,000 Max HP that Baizhu possesses that does not exceed 50,000 will increase the Burning, Bloom, Hyperbloom, and Burgeon reaction DMG dealt by these characters by 2%, and will increase the DMG Bonus provided by Aggravate and Spread by 0. 8%. This effect lasts 6s.",
          "icon": "/img/talents/baizhu_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Barbara",
    "talents": {
      "normalAttack": {
        "name": "Whisper of Water",
        "description": "Normal Attack\nPerform up to 4 water splashes attacks that deal Hydro DMG. Charged Attack\nConsumes a certain amount of Stamina to deal AoE Hydro DMG after a short casting time. Plunging Attack\nGathering the might of Hydro, Barbara plunges towards the ground from mid-air, damaging all enemies in her path.",
        "icon": "/img/talents/barbara_attack.png"
      },
      "elementalSkill": {
        "name": "Let the Show Begin",
        "description": "Summons water droplets resembling musical notes that form a Melody Loop, dealing Hydro DMG to surrounding enemies and afflicting them with the Wet status. Melody Loop\n\nBarbara's Normal Attacks heal all party members and nearby allied characters for a certain amount of HP, which scales with Barbara's Max HP. Her Charged Attack generates 4 times the amount of healing.",
        "icon": "/img/talents/barbara_skill.png"
      },
      "elementalBurst": {
        "name": "Shining Miracle",
        "description": "Heals friendly forces and all parties for a large amount of HP that scales with Barbara's Max HP.",
        "icon": "/img/talents/barbara_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Glorious Season",
          "description": "The Stamina Consumption of characters within Let the Show Begin's Melody Loop is reduced by 12%.",
          "icon": "/img/talents/barbara_passive1.png"
        },
        {
          "name": "Encore",
          "description": "When a character gains an Elemental Orb/Particle, the duration of Let the Show Begin's Melody Loop is extended by 1s. The maximum extension is 5s.",
          "icon": "/img/talents/barbara_passive2.png"
        },
        {
          "name": "With My Whole Heart",
          "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product.",
          "icon": "/img/talents/barbara_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Beidou",
    "talents": {
      "normalAttack": {
        "name": "Oceanborne",
        "description": "Normal Attack\nPerforms up to 5 successive strikes. Charged Attack\nDrains Stamina over time to perform continuous slashes. At end of the sequence, perform a more powerful slash.",
        "icon": "/img/talents/beidou_attack.png"
      },
      "elementalSkill": {
        "name": "Tidecaller",
        "description": "Nothing to worry about. Should anyone raise a hand against her or her men, she will avenge it ten-fold with sword and thunder. Press\nAccumulating the power of lightning, Beidou swings her blade forward fiercely, dealing Electro DMG.",
        "icon": "/img/talents/beidou_skill.png"
      },
      "elementalBurst": {
        "name": "Stormbreaker",
        "description": "Recalling her slaying of the great beast Haishan. Beidou calls upon that monstrous strength and the lightning to create a Thunderbeast's Targe around herself. Thunderbeast's Target\n\nWhen Normal and Charged Attacks hit, they create a lightning discharge that can jump between enemies, dealing Electro DMG.",
        "icon": "/img/talents/beidou_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Retribution",
          "description": "Counterattacking with Tidecaller at the precise moment when the character is hit grants the maximum DMG Bonus.",
          "icon": "/img/talents/beidou_passive1.png"
        },
        {
          "name": "Lightning Storm",
          "description": "Gain the following effects for 10s after unleashing Tidecaller with its maximum DMG Bonus:\nDMG dealt by Normal and Charged Attacks is increased by 15%. ATK SPD of Normal and Charged Attacks is increased by 15%. Greatly reduced delay before unleashing Charged Attacks.",
          "icon": "/img/talents/beidou_passive2.png"
        },
        {
          "name": "Conqueror of Tides",
          "description": "Decreases all party member's swimming Stamina consumption by 20%.",
          "icon": "/img/talents/beidou_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Bennett",
    "talents": {
      "normalAttack": {
        "name": "Strike of Fortune",
        "description": "Normal Attack\nPerform up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword swings. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/bennett_attack.png"
      },
      "elementalSkill": {
        "name": "Passion Overload",
        "description": "Bennett puts all his fire and passion for adventuring into his sword. Results may very based on how fired up he is. Press\nA single, swift flame strike that deals Pyro DMG.",
        "icon": "/img/talents/bennett_skill.png"
      },
      "elementalBurst": {
        "name": "Fantastic Voyage",
        "description": "Bennett leaps towards the enemy and performs a plunging attack, dealing Pyro DMG, creating an Inspiration Field. Inspiration Field\n\nIf the health of a character in the circle is equal to or falls below 70%, their health will continuously regenerate. Regeneration scales based on Bennett's Max HP.",
        "icon": "/img/talents/bennett_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Rekindle",
          "description": "Decreases Passion Overload's CD by 20%.",
          "icon": "/img/talents/bennett_passive1.png"
        },
        {
          "name": "Fearnaught",
          "description": "When inside the area created by Fantastic Voyage, Passion Overload takes on the following effects:\nCD is reduced by 50%. Bennett will not be launched by the effects of Charge Level 2.",
          "icon": "/img/talents/bennett_passive2.png"
        },
        {
          "name": "It Should Be Safe...",
          "description": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%.",
          "icon": "/img/talents/bennett_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Candace",
    "talents": {
      "normalAttack": {
        "name": "Gleaming Spear - Guardian Stance",
        "description": "Normal Attack\nPerforms up to 4 consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/candace_attack.png"
      },
      "elementalSkill": {
        "name": "Sacred Rite: Heron's Sanctum",
        "description": "Candace's fighting style is capable of warding off an entire tide of foes. Tap\nRushes forward with her shield, dealing Hydro DMG to opponents in front of her. Hold\nRaises her shield to block incoming attacks from nearby opponents, forming a barrier that absorbs DMG based on her Max HP and absorbs Hydro DMG 250% more effectively.",
        "icon": "/img/talents/candace_skill.png"
      },
      "elementalBurst": {
        "name": "Sacred Rite: Wagtail's Tide",
        "description": "Raising her weapon on high, Candace calls upon a divine blessing that deals AoE Hydro DMG based on her Max HP and continuously confers the Prayer of the Crimson Crown on your active character. Prayer of the Crimson Crown\nThis effect has the following properties:\nCharacters deal increased Elemental DMG with their Normal Attacks. Whenever a character takes the field, they will unleash a rippling wave of water that deals Hydro DMG to nearby opponents.",
        "icon": "/img/talents/candace_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Aegis of Crossed Arrows",
          "description": "If Candace is hit by an attack in the Hold duration of Sacred Rite: Heron's Sanctum, that skill will finish charging instantly.",
          "icon": "/img/talents/candace_passive1.png"
        },
        {
          "name": "Celestial Dome of Sand",
          "description": "Characters affected by the Prayer of the Crimson Crown caused by Sacred Rite: Wagtail's Tide will deal 0. 5% increased DMG to opponents every 1,000 points of Candace's Max HP when they deal Elemental DMG with their Normal Attacks.",
          "icon": "/img/talents/candace_passive2.png"
        },
        {
          "name": "To Dawn's First Light",
          "description": "Decreases climbing Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the same effects.",
          "icon": "/img/talents/candace_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Charlotte",
    "talents": {
      "normalAttack": {
        "name": "Cool-Color Capture",
        "description": "Normal Attack\nTaking aim at targets using Monsieur Verite, her custom Kamera, Charlotte performs up to 3 consecutive attacks, dealing Cryo DMG. Charged Attack\nConsumes a fixed amount of Stamina, and after a moment's preparation, will deploy Monsieur Verite to deal AoE Cryo DMG. Plunging Attack\nGathering the power of Cryo, Charlotte plunges toward the ground, dealing DMG to all opponents in her path and dealing AoE Cryo DMG upon landing.",
        "icon": "/img/talents/charlotte_attack.png"
      },
      "elementalSkill": {
        "name": "Framing: Freezing Point Composition",
        "description": "Using the keen instincts of an ace reporter, Charlotte uses her photography skills to produce different effects based on whether the ability is Tapped or Held. Tap\nTakes a snapshot using Monsieur Verite, dealing AoE Cryo DMG to opponents in front of her and applying Snappy Silhouette to a maximum of 5 opponents. During this effect's duration, it will deal Cryo DMG to affected opponents at intervals.",
        "icon": "/img/talents/charlotte_skill.png"
      },
      "elementalBurst": {
        "name": "Still Photo: Comprehensive Confirmation",
        "description": "Condensing ice to create The Steambird's signature, Charlotte creates a Newsflash Field that will deal AoE Cryo DMG and restores HP for all nearby party members based on Charlotte's ATK. Newsflash Field\nWhile the ability is active, Monsieur Verite will deal Cryo DMG at intervals to opponents within its AoE. Will continuously restore HP to active character(s) within its AoE based on Charlotte's ATK.",
        "icon": "/img/talents/charlotte_burst.png"
      },
      "passiveTalents": [
        {
          "name": "First-Person Shutter",
          "description": "After activating the Special Analysis Zoom Lens, Charlotte's \"Framing: Freezing Point Composition\" Hold Mode cannot trigger its original effects, but instead enables her to take photos in a rather unique manner.",
          "icon": "/img/talents/charlotte_passive1.png"
        },
        {
          "name": "Moment of Impact",
          "description": "When opponents marked by \"Focused Impression\" are defeated, Framing: Freezing Point Composition's CD will be decreased by 2s. This CD decrease can be triggered 4 times every 12s.",
          "icon": "/img/talents/charlotte_passive2.png"
        },
        {
          "name": "Diversified Investigation",
          "description": "When the party contains 1/2/3 Fontainians other than herself, Charlotte gains a 5%/10%/15% Healing Bonus. When the party contains 1/2/3 non-Fontainians, Charlotte gains a 5%/10%/15% Cryo DMG Bonus.",
          "icon": "/img/talents/charlotte_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Chevreuse",
    "talents": {
      "normalAttack": {
        "name": "Line Bayonet Thrust EX",
        "description": "Normal Attack\nPerforms up to 4 consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/chevreuse_attack.png"
      },
      "elementalSkill": {
        "name": "Short-Range Rapid Interdiction Fire",
        "description": "Chevreuse quickly shoulders her musket and fires at her opponent(s), dealing AoE Pyro DMG. For a short duration after Chevreuse fires a shot, she will continuously restore HP to the active character on the field. The amount healed is based on her Max HP.",
        "icon": "/img/talents/chevreuse_skill.png"
      },
      "elementalBurst": {
        "name": "Ring of Bursting Grenades",
        "description": "Chevreuse fires an explosive grenade at opponents with her musket, dealing AoE Pyro DMG. After the projectile hits, it will split into many secondary explosive shells. The secondary explosive shells will burst after a short interval, dealing Pyro DMG to nearby opponents.",
        "icon": "/img/talents/chevreuse_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Double Time March",
          "description": "Decreases sprinting Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/chevreuse_passive1.png"
        },
        {
          "name": "Vanguard's Coordinated Tactics",
          "description": "When the Elemental Type of all party members is Pyro or Electro and there is at least one Pyro and one Electro characters each in the party:\nChevreuse grants \"Coordinated Tactics\" to nearby party members: After a character triggers the Overloaded reaction, the Pyro and Electro RES of the opponent(s) affected by this Overloaded reaction will be decreased by 40% for 6s. The \"Coordinated Tactics\" effect will be removed when the Elemental Types of the characters in the party do not meet the basic requirements for the Passive Talent.",
          "icon": "/img/talents/chevreuse_passive2.png"
        },
        {
          "name": "Vertical Force Coordination",
          "description": "After Chevreuse fires an Overcharged Ball using Short-Range Rapid Interdiction Fire, nearby Pyro and Electro characters in the party gain 1% increased ATK for every 1,000 Max HP Chevreuse has for 30s. ATK can be increased by up to 40% in this way.",
          "icon": "/img/talents/chevreuse_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Chiori",
    "talents": {
      "normalAttack": {
        "name": "Weaving Blade",
        "description": "Normal Attack\nPerforms up to 4 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/chiori_attack.png"
      },
      "elementalSkill": {
        "name": "Fluttering Hasode",
        "description": "Dashes nimbly forward with silken steps. Once this dash ends, Chiori will summon the automaton doll \"Tamoto\" beside her and sweep her blade upward, dealing AoE Geo DMG to nearby opponents based on her ATK and DEF. Holding the Skill will cause it to behave differently.",
        "icon": "/img/talents/chiori_skill.png"
      },
      "elementalBurst": {
        "name": "Hiyoku: Twin Blades",
        "description": "Twin blades leave their sheaths as Chiori slices with the clean cuts of a master tailor, dealing AoE Geo DMG based on her ATK and DEF.",
        "icon": "/img/talents/chiori_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Tailor-Made",
          "description": "Gain different effects depending on the next action you take within a short duration after using Fluttering Hasode's upward sweep. If you (Press/Tap) the Elemental Skill, you will trigger the Tapestry effect. If you (Press/Tap) your Normal Attack, the Tailoring effect will be triggered instead.",
          "icon": "/img/talents/chiori_passive1.png"
        },
        {
          "name": "The Finishing Touch",
          "description": "When a nearby party member creates a Geo Construct, Chiori will gain 20% Geo DMG Bonus for 20s.",
          "icon": "/img/talents/chiori_passive2.png"
        },
        {
          "name": "Brocaded Collar's Beauteous Silhouette",
          "description": "When any party member is wearing an outfit apart from their default outfit, or is wearing a wind glider other than the Wings of First Flight, your party members will obtain the Swift Stride effect: Movement SPD is increased by 10%. This effect does not take effect in Domains, Trounce Domains and the Spiral Abyss. Swift Stride does not stack.",
          "icon": "/img/talents/chiori_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Chongyun",
    "talents": {
      "normalAttack": {
        "name": "Demonbane",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes. Charged Attack\nDrains Stamina over time to perform continuous swirling attacks against all nearby enemies. At end of the sequence, perform a more powerful slash.",
        "icon": "/img/talents/chongyun_attack.png"
      },
      "elementalSkill": {
        "name": "Spirit Blade - Chonghua's Layered Frost",
        "description": "Chongyun strikes the ground with his greatsword, causing a Cryo explosion in a circular AoE in front of him that deals Cryo DMG. After a short delay, the cold air created by the Cryo explosion will coalesce into a Chonghua Frost Field, within which all DMG done through Normal and Charged Attacks by Sword, Greatsword and Polearm-wielding characters will be converted to Cryo DMG.",
        "icon": "/img/talents/chongyun_skill.png"
      },
      "elementalBurst": {
        "name": "Spirit Blade - Cloud-parting Star",
        "description": "Performing the secret hand seals, Chongyun summons 3 giant spirit blades in mid-air that fall to the earth one by one after a short delay, exploding as they hit the ground. When the spirit blades explode, they will deal AoE Cryo DMG and launch enemies.",
        "icon": "/img/talents/chongyun_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Steady Breathing",
          "description": "Sword, Claymore, or Polearm-wielding characters within the field created by Spirit Blade - Chonghua's Layered Frost have their Normal Attack SPD increased by 8%.",
          "icon": "/img/talents/chongyun_passive1.png"
        },
        {
          "name": "Rimechaser Blade",
          "description": "When the field created by Spirit Blade - Chonghua's Layered Frost disappears, another spirit will be summoned to strike nearby enemies, dealing 100% of Chonghua's Layered Frost's Skill DMG as AoE Cryo DMG. Enemies hit by this blade will have their Cryo RES decreased by 10% for 8s.",
          "icon": "/img/talents/chongyun_passive2.png"
        },
        {
          "name": "Gallant Journey",
          "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%.",
          "icon": "/img/talents/chongyun_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Clorinde",
    "talents": {
      "normalAttack": {
        "name": "Oath of Hunting Shadows",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina and fires Suppressing Shots in a fan pattern with her pistolet. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/clorinde_attack.png"
      },
      "elementalSkill": {
        "name": "Hunter's Vigil",
        "description": "Preparing her pistolet, she enters the \"Night Vigil\" state, using steel and shot together. In this state, Clorinde's Normal Attacks will be transformed into \"Swift Hunt\" pistolet attacks, and the DMG dealt is converted into Electro DMG that cannot be overridden by infusions, and she will be unable to use Charged Attacks. Using her Elemental Skill will transform it into \"Impale the Night\": Perform a lunging attack, dealing Electro DMG.",
        "icon": "/img/talents/clorinde_skill.png"
      },
      "elementalBurst": {
        "name": "Last Lightfall",
        "description": "Grants herself a Bond of Life based upon her own max HP before swiftly evading and striking with saber and sidearm as one, dealing AoE Electro DMG. It is said the legacy of the ancient art of resisting non-human beings with but a mortal body can be traced back to the Lochknights who resisted the Remurian Empire. Be that as it may, so long as one can find a way to control the level of force used, it's not as if it cannot be used in duels against ordinary opponents.",
        "icon": "/img/talents/clorinde_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Night Vigil's Harvest",
          "description": "Displays the location of nearby resources unique to Fontaine on the mini-map.",
          "icon": "/img/talents/clorinde_passive1.png"
        },
        {
          "name": "Dark-Shattering Flame",
          "description": "After a nearby party member triggers an Electro-related reaction against an opponent, Electro DMG dealt by Clorinde's Normal Attacks and Last Lightfall will be increased by 20% of Clorinde's ATK for 15s. Max 3 stacks. Each stack is counted independently.",
          "icon": "/img/talents/clorinde_passive2.png"
        },
        {
          "name": "Lawful Remuneration",
          "description": "If Clorinde's Bond of Life is equal to or greater than 100% of her Max HP, her CRIT Rate will increase by 10% for 15s whenever her Bond of Life value increases or decreases. Max 2 stacks. Each stack is counted independently.",
          "icon": "/img/talents/clorinde_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Collei",
    "talents": {
      "normalAttack": {
        "name": "Supplicant's Bowmanship",
        "description": "Normal Attack\nPerforms up to 4 consecutive shots with a bow. Charged Attack\nPerforms a more precise Aimed Shot with increased DMG. While aiming, Dendro energy will accumulate on the arrowhead.",
        "icon": "/img/talents/collei_attack.png"
      },
      "elementalSkill": {
        "name": "Floral Brush",
        "description": "Throws out a Floral Ring that deals 1 instance of Dendro DMG to targets it comes into contact with. The Floral Ring will return after a set time, dealing Dendro DMG once again.",
        "icon": "/img/talents/collei_skill.png"
      },
      "elementalBurst": {
        "name": "Trump-Card Kitty",
        "description": "Trusty Cuilein-Anbar comes to save the day!\nThrows the doll named Cuilein-Anbar, causing an explosion that deals AoE Dendro DMG, creating a Cuilein-Anbar Zone. Cuilein-Anbar will bounce around within this zone, dealing AoE Dendro DMG.",
        "icon": "/img/talents/collei_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Floral Sidewinder",
          "description": "If one of your party members has triggered Burning, Quicken, Aggravate, Spread, Bloom, Hyperbloom, or Burgeon reactions before the Floral Ring returns, it will grant the character the Sprout effect upon return, which will continuously deal Dendro DMG equivalent to 40% of Collei's ATK to nearby opponents for 3s. If another Sprout effect is triggered during its initial duration, the initial effect will be removed.",
          "icon": "/img/talents/collei_passive1.png"
        },
        {
          "name": "The Languid Wood",
          "description": "When a character within the Cuilein-Anbar Zone triggers Burning, Quicken, Aggravate, Spread, Bloom, Hyperbloom, or Burgeon reactions, the Zone's duration will be increased by 1s. single Trump-Card Kitty can be extended by up to 3s.",
          "icon": "/img/talents/collei_passive2.png"
        },
        {
          "name": "Gliding Champion of Sumeru",
          "description": "Decreases gliding Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/collei_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Cyno",
    "talents": {
      "normalAttack": {
        "name": "Invoker's Spear",
        "description": "Normal Attack\nPerforms up to four consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/cyno_attack.png"
      },
      "elementalSkill": {
        "name": "Secret Rite: Chasmic Soulfarer",
        "description": "Performs a swift thrust, dealing Electro DMG to opponents along the path. When Cyno is under the Pactsworn Pathclearer state triggered by the Elemental Burst \"Sacred Rite: Wolf's Swiftness,\" he will instead unleash a Mortuary Rite that deals thunderous AoE Electro DMG and extends the duration of Pactsworn Pathclearer. \"This judgment brooks no choice.",
        "icon": "/img/talents/cyno_skill.png"
      },
      "elementalBurst": {
        "name": "Sacred Rite: Wolf's Swiftness",
        "description": "Calls upon a divine spirit to indwell him, morphing into the Pactsworn Pathclearer. Pactsworn Pathclearer\nCyno's Normal, Charged, and Plunging Attacks will be converted to Electro DMG that cannot be overridden. Cyno's Elemental Mastery and resistance to interruption will increase, and he gains immunity to Electro-Charged DMG.",
        "icon": "/img/talents/cyno_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Featherfall Judgment",
          "description": "When Cyno is in the Pactsworn Pathclearer state activated by Sacred Rite: Wolf's Swiftness, Cyno will enter the Endseer stance at intervals. If he activates Secret Rite: Chasmic Soulfarer while affected by this stance, he will activate the Judication effect, increasing the DMG of this Secret Rite: Chasmic Soulfarer by 35%, and firing off 3 Duststalker Bolts that deal 100% of Cyno's ATK as Electro DMG. Duststalker Bolt DMG is considered Elemental Skill DMG.",
          "icon": "/img/talents/cyno_passive1.png"
        },
        {
          "name": "Authority Over the Nine Bows",
          "description": "Cyno's DMG values will be increased based on his Elemental Mastery as follows:\n- Pactsworn Pathclearer's Normal Attack DMG is increased by 150% of his Elemental Mastery. - Duststalker Bolt DMG from his Passive Talent Featherfall Judgment is increased by 250% of his Elemental Mastery.",
          "icon": "/img/talents/cyno_passive2.png"
        },
        {
          "name": "The Gift of Silencee",
          "description": "Gains 25% more rewards when dispatched on a Sumeru Expedition for 20 hours.",
          "icon": "/img/talents/cyno_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Dehya",
    "talents": {
      "normalAttack": {
        "name": "Sandstorm Assault",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes using her Claymore and her martial arts. Charged Attack\nDrains Stamina over time to perform continuous slashes. At the end of the sequence, performs a more powerful slash.",
        "icon": "/img/talents/dehya_attack.png"
      },
      "elementalSkill": {
        "name": "Molten Inferno",
        "description": "This art of Dehya's own invention changes its method of use depending on the combat situation. Indomitable Flame\nThis skill will be unleashed should there be no Fiery Sanctum field created by Dehya herself present at the time. Deals AoE Pyro DMG, and creates a field known as Fiery Sanctum.",
        "icon": "/img/talents/dehya_skill.png"
      },
      "elementalBurst": {
        "name": "Leonine Bite",
        "description": "Unleashing her burning anger and casting her inconvenient blade aside, Dehya enters the Blazing Lioness state and increases her resistance to interruption. In this state, Dehya will automatically and continuously unleash the Flame-Mane's Fists, dealing Pyro DMG based on her ATK and Max HP, and when its duration ends, she will unleash an Incineration Drive, dealing AoE Pyro DMG based on her ATK and Max HP. If a Fiery Sanctum field created by Dehya's own Elemental Skill 'Molten Inferno' exists when this ability is unleashed, Dehya will retrieve it, and then create another field once Blazing Lioness's duration expires.",
        "icon": "/img/talents/dehya_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Unstinting Succor",
          "description": "Within 6 seconds after Dehya retrieves the Fiery Sanctum field through Molten Inferno: Ranging Flame or Leonine Bite, she will take 60% less DMG when receiving DMG from Redmane's Blood. This effect can be triggered once every 2s. Additionally, within 9s after Dehya unleashes Molten Inferno: Indomitable Flame, she will grant all party members the Gold-Forged Form state.",
          "icon": "/img/talents/dehya_passive1.png"
        },
        {
          "name": "Stalwart and True",
          "description": "When her HP is less than 40%, Dehya will recover 20% of her Max HP and will restore 6% of her Max HP every 2s for the next 10s. This effect can be triggered once every 20s.",
          "icon": "/img/talents/dehya_passive2.png"
        },
        {
          "name": "The Sunlit Way",
          "description": "Increases the Movement SPD of your own party members by 10% during the day (6:00 â€“ 18:00). Does not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/dehya_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Diluc",
    "talents": {
      "normalAttack": {
        "name": "Tempered Sword",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes. Charged Attack\nDrains Stamina over time to perform continuous slashes. At the end of the sequence, perform a more powerful slash.",
        "icon": "/img/talents/diluc_attack.png"
      },
      "elementalSkill": {
        "name": "Searing Onslaught",
        "description": "Performs a forward slash that deals Pyro DMG. This skill can be used 3 times consecutively. Enters CD if not cast again within a short period.",
        "icon": "/img/talents/diluc_skill.png"
      },
      "elementalBurst": {
        "name": "Dawn",
        "description": "Releases intense flames to knock nearby enemies back, dealing Pyro DMG. The flames then converge into the weapon, summoning a Phoenix that flies forward and deals massive Pyro DMG to all enemies in its path. The Phoenix explodes upon reaching its destination, causing a large amount of AoE Pyro DMG.",
        "icon": "/img/talents/diluc_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Relentless",
          "description": "Diluc's Charged Attack Stamina Cost is decreased by 50%, and its duration is increased by 3s.",
          "icon": "/img/talents/diluc_passive1.png"
        },
        {
          "name": "Blessing of Phoenix",
          "description": "The Pyro Enchantment provided by Dawn lasts for 4s longer. Additionally, Diluc gains 20% Pyro DMG Bonus during the duration of this effect.",
          "icon": "/img/talents/diluc_passive2.png"
        },
        {
          "name": "Tradition of the Dawn Knight",
          "description": "Refunds 15% of the ores used when crafting Claymore-type weapons.",
          "icon": "/img/talents/diluc_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Diona",
    "talents": {
      "normalAttack": {
        "name": "Katzlein Style",
        "description": "Normal Attack\nPerforms up to 5 consecutive shots with a bow. Charged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, biting frost accumulates on the arrowhead.",
        "icon": "/img/talents/diona_attack.png"
      },
      "elementalSkill": {
        "name": "Icy Paws",
        "description": "Fires an Icy Paw that deals Cryo DMG to opponents and forms a shield on hit. The shield's DMG Absorption scales based on Diona's Max HP, and its duration scales off the number of Icy Paws that hit their target. Press\nRapidly fires off 2 Icy Paws.",
        "icon": "/img/talents/diona_skill.png"
      },
      "elementalBurst": {
        "name": "Signature Mix",
        "description": "Tosses out a special cold brew that deals AoE Cryo DMG and creates a Drunken Mist in an AoE. Drunken Mist\n\nDeals continuous Cryo DMG to opponents within the AoE. Continuously regenerates the HP of characters within the AoE.",
        "icon": "/img/talents/diona_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Cat's Tail Secret Menu",
          "description": "Characters shielded by Icy Paws have their Movement SPD increased by 10% and their Stamina Consumption decreased by 10%.",
          "icon": "/img/talents/diona_passive1.png"
        },
        {
          "name": "Drunkard's Farce",
          "description": "Opponents who enter the AoE of Signature Mix have 10% decreased ATK for 15s.",
          "icon": "/img/talents/diona_passive2.png"
        },
        {
          "name": "Complimentary Bar Food",
          "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product.",
          "icon": "/img/talents/diona_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Dori",
    "talents": {
      "normalAttack": {
        "name": "Marvelous Sword- Dance (Modified)",
        "description": "Normal Attack\nPerform up to 3 consecutive strikes. Charged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents. At the end of the sequence, performs a more powerful slash.",
        "icon": "/img/talents/dori_attack.png"
      },
      "elementalSkill": {
        "name": "Spirit-Warding Lamp: Troubleshooter Cannon",
        "description": "Directs a Spirit-Warding Lamp to fire off a Troubleshooter Shot at opponents, dealing Electro DMG. After the Troubleshooter Shot hits, it will create 2 After-Sales Service Rounds that will automatically track opponents and deal Electro DMG. It is said that Dori can fix any problem for you.",
        "icon": "/img/talents/dori_skill.png"
      },
      "elementalBurst": {
        "name": "Alcazarzaray's Exactitude",
        "description": "Summons forth the Jinni within the lamp to give the client various kinds of aid. Jinni\nConnects to a nearby character. The connected character will:\nâ€¢ Continuously restore HP based on Dori's Max HP.",
        "icon": "/img/talents/dori_burst.png"
      },
      "passiveTalents": [
        {
          "name": "An Eye for Gold",
          "description": "After a character connected to the Jinni triggers an Electro0Charged, Superconduct, Overloaded, Quicken, Aggravate, Hyperbloom, or an Electro Swirl or Crystallize reaction, the CD of Spirit-Wandering Lamp: Troubleshooter Cannon is decreased by 1s. This effect can be triggered once every 3s.",
          "icon": "/img/talents/dori_passive1.png"
        },
        {
          "name": "Compound Interest",
          "description": "When the Troubleshooter Shots or After-Sales Service Rounds from Spirit-Warding Lamp: Troubleshooter Cannon hit opponents, Dori will restore 5 Elemental Energy for every 100% Energy Recharge possessed. Per Spirit-Warding Lamp: Troubleshooter Cannon, only one instance of Energy restoration can be triggered and a maximum of 15 Energy can be restored this way.",
          "icon": "/img/talents/dori_passive2.png"
        },
        {
          "name": "Unexpected Order",
          "description": "Has a 25% chance to recover some of the materials used when crafting Character and Weapon Materials.",
          "icon": "/img/talents/dori_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Emilie",
    "talents": {
      "normalAttack": {
        "name": "Shadow-Hunting Spear (Custom)",
        "description": "Normal Attack\nPerforms up to 4 consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to perform an upward slash. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/emilie_attack.png"
      },
      "elementalSkill": {
        "name": "Fragrance Extraction",
        "description": "Creates a Lumidouce Case that deals AoE Dendro DMG. Lumidouce Case\nFires Puffs of Puredew at nearby opponents at intervals, dealing Dendro DMG. When nearby opponents are affected by Burning, they will give off Scents at intervals, and 1 Scent can be created this way every 2s.",
        "icon": "/img/talents/emilie_skill.png"
      },
      "elementalBurst": {
        "name": "Aromatic Explication",
        "description": "Guiding the fragrances collected within the Case, Emilie converts them into pure Dendro energy, creating a Level 3 Lumidouce Case and stowing existing Cases away. While it exists, the Level 3 Lumidouce Case will not gather nearby Scents, but it will continuously cause Scented Dew to descend, attacking opponents within range and dealing Dendro DMG. During this time, 1 drop of Scented Dew will descend every 0.",
        "icon": "/img/talents/emilie_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Lingering Fragrance",
          "description": "Each time it collects 2 Scents, the Level 2 Lumidouce Case will consume Scents and release Cleardew Cologne that deals AoE Dendro DMG equal to 600% of Emilie's ATK to opponents. This DMG is not considered Elemental Skill DMG.",
          "icon": "/img/talents/emilie_passive1.png"
        },
        {
          "name": "Rectification",
          "description": "Emilie deals increased DMG to Burning opponents based on her ATK, with every 1,000 ATK increasing DMG dealt by 15%. The maximum DMG bonus that can be gained this way is 36%.",
          "icon": "/img/talents/emilie_passive2.png"
        },
        {
          "name": "Headspace Capture",
          "description": "When the Lumidouce Case created by Emilie is on the field, all party members gain 85% Pyro RES against Burning DMG.",
          "icon": "/img/talents/emilie_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Eula",
    "talents": {
      "normalAttack": {
        "name": "Favonius Bladework - Edel",
        "description": "Normal Attack\nPerform up to five consecutive strikes. Charged Attack\nDrains Stamina over time to perform continuous slashes. At the end of the sequence, perform a more powerful slash.",
        "icon": "/img/talents/eula_attack.png"
      },
      "elementalSkill": {
        "name": "Icetide Vortex",
        "description": "Sharp frost, swift blade. Press\nSlashes swiftly, dealing Cryo DMG. When it hits an opponent, Eula gains a stack of Grimheart that stacks up to two times.",
        "icon": "/img/talents/eula_skill.png"
      },
      "elementalBurst": {
        "name": "Glacial Illumination",
        "description": "Brandishes her greatsword, dealing Cryo DMG to nearby opponents and creating a Lightfall Sword that follows her around for a duration of up to 7s. While present, the Lightfall Sword increases Eula's resistance to interruption. When Eula's own Normal Attack, Elemental Skill, and Elemental Burst deal DMG to opponents, they will charge the Lightfall Sword, which can gain an energy stack once every 0.",
        "icon": "/img/talents/eula_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Roiling Rime",
          "description": "If 2 stacks of Grimheart are consumed upon unleashing the Holding Mode of Icetide Vortex, a Shattered Lightfall Sword will be created that will explode immediately, dealing 50% of the basic Physical DMG dealt by a Lightfall Sword created by Glacial Illumination.",
          "icon": "/img/talents/eula_passive1.png"
        },
        {
          "name": "Wellspring of War-Lust",
          "description": "When Glacial Illumination is cast, the CD of Icetide Vortex is reset and Eula gains 1 stack of Grimheart.",
          "icon": "/img/talents/eula_passive2.png"
        },
        {
          "name": "Aristocratic Introspection",
          "description": "When Eula crafts Character Talent Materials, she has a 10% chance to receive double the product.",
          "icon": "/img/talents/eula_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Faruzan",
    "talents": {
      "normalAttack": {
        "name": "Parthian Shot",
        "description": "Normal Attack\nPerforms up to 4 consecutive shots with a bow. Charged Attack\nPerforms a more precise Aimed Shot with increased DMG. While aiming, mighty winds will accumulate on the arrowhead.",
        "icon": "/img/talents/faruzan_attack.png"
      },
      "elementalSkill": {
        "name": "Wind Realm of Nasamjnin",
        "description": "Faruzan deploys a polyhedron that deals AoE Anemo DMG to nearby opponents. She will also enter the Manifest Gale state. While in the Manifest Gale state, Faruzan's next fully charged shot will consume this state and will become a Hurricane Arrow that contains high-pressure currents.",
        "icon": "/img/talents/faruzan_skill.png"
      },
      "elementalBurst": {
        "name": "The Wind's Secret Ways",
        "description": "Faruzan deploys a Dazzling Polyhedron that unleashes a Whirlwind Pulse and deals AoE Anemo DMG. While the Dazzling Polyhedron persists, it will continuously move along a triangular path. Once it reaches each corner of that triangular path, it will unleash 1 more Whirlwind Pulse.",
        "icon": "/img/talents/faruzan_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Impetuous Flow",
          "description": "When Faruzan is in the Manifest Gale state created by Wind Realm of Nasamjnin, the amount of time taken to charge a shot is decreased by 60%, and she can apply The Wind's Secret Ways' Perfidious Wind's Bale to opponents who are hit by the vortex created by Pressurized Collapse.",
          "icon": "/img/talents/faruzan_passive1.png"
        },
        {
          "name": "Lost Wisdom of the Seven Caverns",
          "description": "When characters affected by The Wind's Secret Ways' Prayerful Wind's Gift deal Anemo DMG using Normal, Charged, Plunging Attacks, Elemental Skills, or Elemental Bursts to opponents, they will gain the Hurricane Guard effect: This DMG will be increased based on 32% of Faruzan's Base ATK. 1 instance of Hurricane Guard can occur once every 0. 8s.",
          "icon": "/img/talents/faruzan_passive2.png"
        },
        {
          "name": "Tomes Light the Path",
          "description": "Gains 25% more rewards when dispatched on a Sumeru Expedition for 20 hours.",
          "icon": "/img/talents/faruzan_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Fischl",
    "talents": {
      "normalAttack": {
        "name": "Bolts of Downfall",
        "description": "Normal Attack\nPerforms up to 5 consecutive shots with a bow. Charged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, the dark lightning spirits of Immernachtreich shall heed the call of their Prinzessin and indwell the enchanted arrowhead.",
        "icon": "/img/talents/fischl_attack.png"
      },
      "elementalSkill": {
        "name": "Nightrider",
        "description": "Summons Oz, the night raven forged of darkness and lightning descends upon the land, dealing Electro DMG in a small AoE. For the ability's duration, Oz will continuously attack nearby enemies with Freikugel. Hold to adjust the location Oz will be summoned to.",
        "icon": "/img/talents/fischl_skill.png"
      },
      "elementalBurst": {
        "name": "Midnight Phantasmagoria",
        "description": "Summons Oz to spread his twin swings of twilight and defend Fischl. Has the following properties during the ability's duration:\n\nFischl takes on Oz's form, greatly increasing her Movement Speed. Strikes nearby enemies with lightning, dealing Electro DMG to enemies she comes into contact with.",
        "icon": "/img/talents/fischl_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Stellar Predator",
          "description": "When Fischl hits Oz with a fully-charged Aimed Shot, Oz brings down Thundering Retribution, dealing AoE Electro DMG equal to 152. 7% of the arrow's DMG.",
          "icon": "/img/talents/fischl_passive1.png"
        },
        {
          "name": "Undone Be Thy Sinful Hex",
          "description": "If a character triggers an Electro-related Elemental Reaction when Oz is on the field, the enemy shall be stricken with Thundering Retribution, dealing Electro DMG equal to 80% of Fischl's ATK.",
          "icon": "/img/talents/fischl_passive2.png"
        },
        {
          "name": "Mein Hausgarten",
          "description": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%.",
          "icon": "/img/talents/fischl_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Freminet",
    "talents": {
      "normalAttack": {
        "name": "Flowing Eddies",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes. Charged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents. At the end of the sequence, performs a more powerful slash.",
        "icon": "/img/talents/freminet_attack.png"
      },
      "elementalSkill": {
        "name": "Pressurized Floe",
        "description": "Does an upward thrust that will deal Cryo DMG and cause Freminet to enter Pers Timer for 10s. While Pers Timer is active, his Elemental Skill will turn into Shattering Pressure. Shattering Pressure\nExecutes different sorts of attacks based on the Pressure level of Pers Timer, and then cancels Pers Timer.",
        "icon": "/img/talents/freminet_skill.png"
      },
      "elementalBurst": {
        "name": "Shadowhunter's Ambush",
        "description": "Unleashes a wave of untouchable cold, dealing AoE Cryo DMG, resetting the CD of the Elemental Skill \"Pressurized Floe,\" and causing Freminet to enter the Subnautical Hunter mode for 10s. While in Subnautical Hunter mode, his interruption resistance will increase, and Pressurized Floe will obtain the following buffs:\nCD decreased by 70%. Normal Attacks will give Pers 1 additional Pressure stack, and the frost released by his Normal Attacks deal 200% of their original DMG.",
        "icon": "/img/talents/freminet_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Deepwater Navigation",
          "description": "Decreases underwater stamina consumption for your own party members by 35%. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/freminet_passive1.png"
        },
        {
          "name": "Saturation Deep Dive",
          "description": "When using Pressurized Floe: Shattering Pressure, if Pers Timer has less than 4 levels of Pressure, the CD of Pressurized Floe will be decreased by 1s.",
          "icon": "/img/talents/freminet_passive2.png"
        },
        {
          "name": "Parallel Condensers",
          "description": "When Freminet triggers Shatter against opponents, the DMG dealt by Pressurized Floe: Shattering Pressure will be increased by 40% for 5s.",
          "icon": "/img/talents/freminet_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Furina",
    "talents": {
      "normalAttack": {
        "name": "Soloist's Solicitation",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash a solo dance, dealing Physical DMG to nearby opponents and changing her Arkhe alignment. If Salon Members or Singer of Many Waters summoned by her Elemental Skill \"Salon Solitaire\" are present, their lineup will switch in response.",
        "icon": "/img/talents/furina_attack.png"
      },
      "elementalSkill": {
        "name": "Salon Solitaire",
        "description": "Invites the guests of the Salon Solitaire to come forth and abet in Furina's performance. Will summon either the Salon Members or the Singer of Many Waters based on Furina's current Arkhe alignment. Ousia\nFoaming bubbles like celebrants shall dance, dealing AoE Hydro DMG based on Furina's Max HP and summoning 3 Salon Members: the Ball Octopus-shaped Gentilhomme Usher, the Bubbly Seahorse-shaped Surintendante Chevalmarin, and the Armored Crab-shaped Mademoiselle Crabaletta.",
        "icon": "/img/talents/furina_skill.png"
      },
      "elementalBurst": {
        "name": "Let the People Rejoice",
        "description": "Rouses the impulse to revel, creating a stage of foam that will deal AoE Hydro DMG based on Furina's Max HP and cause nearby party members to enter the Universal Revelry state: During this time, when nearby party members' HP increases or decreases, 1 Fanfare point will be granted to Furina for each percentage point of their Max HP by which their HP changes. At the same time, Furina will increase the DMG dealt by and Incoming Healing Bonus of all nearby party members based on the amount of Fanfare she has. When the duration ends, Furina's Fanfare points will be cleared.",
        "icon": "/img/talents/furina_burst.png"
      },
      "passiveTalents": [
        {
          "name": "The Sea Is My Stage",
          "description": "Xenochromatic Fontemer Aberrant ability CD decreased by 30%.",
          "icon": "/img/talents/furina_passive1.png"
        },
        {
          "name": "Endless Waltz",
          "description": "When the active character in your party receives healing, if the source of the healing is not Furina herself and the healing overflows, then Furina will heal a nearby party member for 2% of their Max HP once every 2s within the next 4s.",
          "icon": "/img/talents/furina_passive2.png"
        },
        {
          "name": "Unheard Confession",
          "description": "Every 1,000 points of Furina's Max HP can buff the different Arkhe-aligned Salon Solitaire in the following ways:\nWill increase Salon Member DMG dealt by 0. 7%, up to a maximum of 28%. Will decrease active character healing interval of the Singer of Many Waters by 0.",
          "icon": "/img/talents/furina_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Gaming",
    "talents": {
      "normalAttack": {
        "name": "Stellar Rend",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes. Charged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents. At the end of the sequence, performs a more powerful slash.",
        "icon": "/img/talents/gaming_attack.png"
      },
      "elementalSkill": {
        "name": "Bestial Ascent",
        "description": "Pounces forward using the Wushou arts, leaping high into the air after coming into contact with a target or surface. After Gaming has used Bestial Ascent to rise into the air, he will use the especially powerful Plunging Attack: Charmed Cloudstrider when performing a Plunging Attack. Plunging Attack: Charmed Cloudstrider\nThe DMG from Plunging Attacks caused by Bestial Ascent is converted to Pyro DMG that cannot be overridden by other elemental infusions.",
        "icon": "/img/talents/gaming_skill.png"
      },
      "elementalBurst": {
        "name": "Suanni's Gilded Dance",
        "description": "Gaming enters Wushou Stance, briefly applying Pyro to him, recovering a fixed amount of HP, and summons his companion, the Suanni Man Chai, to smash into his target, dealing AoE Pyro DMG. After bashing its target, Man Chai will roll to a nearby location before moving towards Gaming. When it links up with Gaming, Man Chai will leave the field and reset the CD for Gaming's Elemental Skill, Bestial Ascent.",
        "icon": "/img/talents/gaming_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Dance of Amity",
          "description": "After Bestial Ascent's Plunging Attack: Charmed Cloudstrider hits an opponent, Gaming will regain 1. 5% of his Max HP once every 0. 2s for 0.",
          "icon": "/img/talents/gaming_passive1.png"
        },
        {
          "name": "Air of Prosperity",
          "description": "When Gaming has less than 50% HP, he will receive a 20% Incoming Healing Bonus. When Gaming has 50% HP or more, Plunging Attack: Charmed Cloudstrider will deal 20% more DMG.",
          "icon": "/img/talents/gaming_passive2.png"
        },
        {
          "name": "The Striding Beast",
          "description": "Increases the Movement SPD of your own party members by 10% during the day (6:00 â€“ 18:00). Does not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/gaming_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Ganyu",
    "talents": {
      "normalAttack": {
        "name": "Liutian Archery",
        "description": "Normal Attack\nPerform up to 6 consecutive shots with a bow. Charged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, an icy aura will accumulate on the arrowhead before the arrow is fired.",
        "icon": "/img/talents/ganyu_attack.png"
      },
      "elementalSkill": {
        "name": "Trail of the Qilin",
        "description": "Leaving a single Ice Lotus behind, Ganyu dashes backward, shunning all impurity and dealing AoE Cryo DMG. The Ice Lotus continuously taunts surrounding opponents, attracting them to attack it. Its endurance scales based on Ganyu's Max HP, and it blooms profusely when destroyed or once its duration ends, dealing AoE Cryo DMG.",
        "icon": "/img/talents/ganyu_skill.png"
      },
      "elementalBurst": {
        "name": "Celestial Shower",
        "description": "Coalesces atmospheric frost and snow to summon a Sacred Cryo Pearl that exorcises evil. While active, the Sacred Cryo Pearl will continuously rain down shards of ice, striking opponents within its AoE and dealing Cryo DMG.",
        "icon": "/img/talents/ganyu_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Undivided Heart",
          "description": "After firing a Frostflake Arrow, the CRIT Rate of subsequent Frostflake Arrows and their resulting bloom effects is increased by 20% for 5s.",
          "icon": "/img/talents/ganyu_passive1.png"
        },
        {
          "name": "Harmony between Heaven and Earth",
          "description": "Celestial Shower grants a 20% Cryo DMG Bonus to active members in the AoE.",
          "icon": "/img/talents/ganyu_passive2.png"
        },
        {
          "name": "Preserved for the Hunt",
          "description": "Refunds 15% of the ores used when crafting Bow-type weapons.",
          "icon": "/img/talents/ganyu_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Gorou",
    "talents": {
      "normalAttack": {
        "name": "Ripping Fang Fletching",
        "description": "Normal Attack\nPerform up to 4 consecutive shots with a bow. Charged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, stone crystals will accumulate on the arrowhead.",
        "icon": "/img/talents/gorou_attack.png"
      },
      "elementalSkill": {
        "name": "Inuzaka All-Round Defense",
        "description": "Deals AoE Geo DMG and sets up a General's War Banner. General's War Banner\nProvides up to 3 buffs to active characters within the skill's AoE based on the number of Geo characters in the party at the time of casting:\n- 1 Geo character: Adds \"Standing Firm\" - DEF Bonus. - 2 Geo characters: Adds \"Impregnable\" - Increased resistance to interruption.",
        "icon": "/img/talents/gorou_skill.png"
      },
      "elementalBurst": {
        "name": "Juuga: Forward Unto Victory",
        "description": "Displaying his valor as a general, Gorou deals AoE Geo DMG and creates a field known as General's Glory to embolden his comrades. General's Glory\nThis field has the following properties:\n- Like the General's War Banner created by Inuzaka All-Round Defense, provides buffs to active characters within the skill's AoE based on the number of Geo characters in the party. Also moves together with your active character.",
        "icon": "/img/talents/gorou_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Seeker of Shinies",
          "description": "Displays the location of nearby resources unique to Inazuma on the mini-map.",
          "icon": "/img/talents/gorou_passive1.png"
        },
        {
          "name": "Heedless of the Wind and Weather",
          "description": "After using Juuga: Forward Unto Victory, all nearby party members' DEF is increased by 25% for 12s.",
          "icon": "/img/talents/gorou_passive2.png"
        },
        {
          "name": "A Favor Repaid",
          "description": "Gorou receives the following DMG Bonuses to his attacks based on his DEF:\n- Inuzaka All-Round Defense: Skill DMG increased by 156% of DEF\n- Juuga: Forward Unto Victory: Skill DMG and Crystal Collapse DMG increased by 15. 6% of DEF.",
          "icon": "/img/talents/gorou_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Hu-tao",
    "talents": {
      "normalAttack": {
        "name": "Secret Spear of Wangsheng",
        "description": "Normal Attack\nPerforms up to 6 consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/hu_tao_attack.png"
      },
      "elementalSkill": {
        "name": "Guide to Afterlife",
        "description": "Paramita Papilio\nIncreases Hu Tao's ATK based on her Max HP at the time of entering this state. ATK Bonus gained this way cannot exceed 400% of Hu Tao's Base ATK. Converts attack DMG to Pyro DMG, which cannot be overridden by any other elemental infusion.",
        "icon": "/img/talents/hu_tao_skill.png"
      },
      "elementalBurst": {
        "name": "Spirit Soother",
        "description": "Commands a blazing spirit to attack, dealing Pyro DMG in a large AoE. Upon striking the enemy, regenerates a percentage of Hu Tao's Max HP. This effect can be triggered up to 5 times, based on the number of enemies hit.",
        "icon": "/img/talents/hu_tao_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Flutter By",
          "description": "When a Paramita Papilio state activated by Guide to Afterlife ends, all allies in the party (excluding Hu Tao herself) will have their CRIT Rate increased by 12% for 8s.",
          "icon": "/img/talents/hu_tao_passive1.png"
        },
        {
          "name": "Sanguine Rouge",
          "description": "When Hu Tao's HP is equal to or less than 50%, her Pyro DMG Bonus is increased by 33%.",
          "icon": "/img/talents/hu_tao_passive2.png"
        },
        {
          "name": "The More the Merrier",
          "description": "When Hu Tao cooks a dish perfectly, she has anm 18% chance to receive an additional \"Suspicious\" dish of the same type.",
          "icon": "/img/talents/hu_tao_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Jean",
    "talents": {
      "normalAttack": {
        "name": "Favonius Bladework",
        "description": "Normal Attack\nPerforms up to 5 consecutive strikes. Charged Attack\nConsumes a certain amount of Stamina to launch an enemy using the power of wind. Launched enemies will slowly fall to the ground.",
        "icon": "/img/talents/jean_attack.png"
      },
      "elementalSkill": {
        "name": "Gale Blade",
        "description": "Focusing the might of the formless wind around her blade, Jean releases a miniature storm, launching enemies in the direction she aims at, dealing massive Anemo DMG. Hold\nAt the cost of continued Stamina consumption, Jean can command the whirlwind to pull surrounding enemies towards her front. Direction can be adjusted.",
        "icon": "/img/talents/jean_skill.png"
      },
      "elementalBurst": {
        "name": "Dandelion Breeze",
        "description": "Calling upon the wind's protection, Jean creates a swirling Dandelion Field, launching surrounding enemies and causing Anemo DMG. At the same time, she instantly regenerates a large amount of HP for nearby allied units and all party members. HP restored scale off Jean's ATK.",
        "icon": "/img/talents/jean_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Wind Companion",
          "description": "Hits by Normal Attacks have a 50% chance to regenerate HP equal to 15% of Jean's ATK for all party members.",
          "icon": "/img/talents/jean_passive1.png"
        },
        {
          "name": "Let the Wind Lead",
          "description": "Using Dandelion Breeze will regenerate 20% of its Energy.",
          "icon": "/img/talents/jean_passive2.png"
        },
        {
          "name": "Guiding Breeze",
          "description": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product.",
          "icon": "/img/talents/jean_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kachina",
    "talents": {
      "normalAttack": {
        "name": "Cragbiter",
        "description": "Normal Attack\nPerforms up to 4 consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kachina_attack.png"
      },
      "elementalSkill": {
        "name": "Go, Go Turbo Twirly!",
        "description": "Fight alongside the turbo trusty Turbo Twirly!\nSummons Turbo Twirly. When the skill is Held and released, Kachina will summon and ride Turbo Twirly. After the Skill is used, Kachina will gain 60 Nightsoul points and enter the Nightsoul's Blessing state.",
        "icon": "/img/talents/kachina_skill.png"
      },
      "elementalBurst": {
        "name": "Time to Get Serious!",
        "description": "Striking the ground, Kachina deals AoE Geo DMG based on her DEF and creates a Turbo Drill Field. The Field increases Turbo Twirly's attack AoE and its movement speed when Kachina is riding it. If Kachina's own Turbo Twirly is present when this is used, Turbo Twirly will be summoned to her side.",
        "icon": "/img/talents/kachina_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Mountain Echoes",
          "description": "When nearby party members trigger a Nightsoul Burst, Kachina's Geo DMG Bonus increases by 20% for 12s.",
          "icon": "/img/talents/kachina_passive1.png"
        },
        {
          "name": "The Weight of Stone",
          "description": "Turbo Twirly's DMG is increased by 20% of Kachina's DEF.",
          "icon": "/img/talents/kachina_passive2.png"
        },
        {
          "name": "Heart of Unity",
          "description": "After her Nightsoul points are depleted, Kachina will switch to consuming Phlogiston to maintain her Nightsoul's Blessing. While in an area with Phlogiston Mechanics within Natlan, she can use Nightsoul Transmission: Kachina. When the active character is currently sprinting, climbing, in a movement mode caused by certain Talents, or at a certain height in the air, the following will trigger when switching to Kachina: Kachina will enter the Nightsoul's Blessing state and ride Turbo Twirly when taking the field while gaining 30 Nightsoul points.",
          "icon": "/img/talents/kachina_passive3.png"
        },
        {
          "name": "Boon of Crystal Flame",
          "description": "While in an area with Phlogiston Mechanics within Natlan, 20 Stamina will be restored when interacting with some harvestable items. Additionally, the location of nearby resources unique to Natlan will appear on your mini-map.",
          "icon": "/img/talents/kachina_passive4.png"
        }
      ]
    }
  },
  {
    "character": "Kaeya",
    "talents": {
      "normalAttack": {
        "name": "Ceremonial Bladework",
        "description": "Normal Attack\nPerforms up to 5 consecutive strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging enemeies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kaeya_attack.png"
      },
      "elementalSkill": {
        "name": "Frostgnaw",
        "description": "Unleashes a frigit blast, dealing Cryo DMG to enemies in front of Kaeya.",
        "icon": "/img/talents/kaeya_skill.png"
      },
      "elementalBurst": {
        "name": "Glacial Waltz",
        "description": "Coalescing the frost in the air, Kaeya summons 3 icicles that revolve around him. These icicles will follow the character around and deal Cryo DMG to enemies in their path for so long as they persist.",
        "icon": "/img/talents/kaeya_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Cold-Blooded Strike",
          "description": "Every hit with Frostgnaw regenerates HP for Kaeya equal to 15% of ATK.",
          "icon": "/img/talents/kaeya_passive1.png"
        },
        {
          "name": "Glacial Heart",
          "description": "Enemies Frozen by Frostgnaw will drop additional Elemental Particles. Frostgnaw may only produce a maximum of 2 additional Elemental Particles per use.",
          "icon": "/img/talents/kaeya_passive2.png"
        },
        {
          "name": "Hidden Strength",
          "description": "Decreases all party member's sprinting Stamina consumption by 20%.",
          "icon": "/img/talents/kaeya_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kaveh",
    "talents": {
      "normalAttack": {
        "name": "Schematic Setup",
        "description": "Normal Attack\nUses Mehrak to perform up to 4 consecutive attacks. Charged Attack\nDrains Stamina over time to perform continuous slashes. At the end of the sequence, performs a more powerful slash.",
        "icon": "/img/talents/kaveh_attack.png"
      },
      "elementalSkill": {
        "name": "Artistic Ingenuity",
        "description": "Uses Mehrak's mapping ability for offensive purposes, initiating a radial scan that deals AoE Dendro DMG. It will also scan all Dendro Cores in its AoE and cause them to immediately burst. Mehrak was created through the modification of ancient technology and may have some other functions apart from mapping work.",
        "icon": "/img/talents/kaveh_skill.png"
      },
      "elementalBurst": {
        "name": "Painted Dome",
        "description": "Completely unleashes Mehrak's energy and creates a cubic scanned space, dealing AoE Dendro DMG to all opponents within it, causing all Dendro Cores in its AoE to immediately burst, and granting Kaveh the following enhanced combat abilities for a specific duration:\nIncreases Kaveh's Normal, Charged, and Plunging Attack AoE, and converts his attack DMG to Dendro DMG that cannot be overridden. All Dendro Cores created by all your own party members through Bloom reactions will deal additional DMG when they burst. Increases Kaveh's resistance to interruption.",
        "icon": "/img/talents/kaveh_burst.png"
      },
      "passiveTalents": [
        {
          "name": "The Art of Budgeting",
          "description": "When Kaveh crafts Landscape, Building, and Courtyard-type Furnishings, he has a 100% chance to refund a portion of the materials used.",
          "icon": "/img/talents/kaveh_passive1.png"
        },
        {
          "name": "An Architect's Undertaking",
          "description": "When DMG dealt by a Dendro Core (including DMG from Burgeon and Hyperbloom) hits Kaveh, Kaveh will regain HP equal to 300% of his Elemental Mastery. This effect can be triggered once every 0. 5s.",
          "icon": "/img/talents/kaveh_passive2.png"
        },
        {
          "name": "A Craftsman's Curious Conceptions",
          "description": "During Painted Dome, after Kaveh's Normal, Charged, or Plunging Attacks hit opponents, his Elemental Mastery will increase by 25. This effect can be triggered once every 0. 1s.",
          "icon": "/img/talents/kaveh_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kazuha",
    "talents": {
      "normalAttack": {
        "name": "Garyuu Bladework",
        "description": "Normal Attack\nPerform up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kaedehara_kazuha_attack.png"
      },
      "elementalSkill": {
        "name": "Chihayaburu",
        "description": "Unleashes a secret technique as fierce as the rushing wind that pulls objects and opponents towards Kazuha's current position before launching opponents within the AoE, dealing Anemo DMG and lifting Kazuha into the air on a rushing gust of wind. Press\nCan be used in mid-air. Hold\nCharges up before unleashing greater Anemo DMG over a larger AoE than Press Mode.",
        "icon": "/img/talents/kaedehara_kazuha_skill.png"
      },
      "elementalBurst": {
        "name": "Kazuha Slash",
        "description": "The signature technique of Kazuha's self-styled bladework â€” a single slash that strikes with the force of the first winds of autumn, dealing AoE Anemo DMG. The blade's passage will leave behind a field named \"Autumn Whirlwind\" that periodically deals AoE Anemo DMG to opponents within its range. Elemental Absorption: If Autumn Whirlwind comes into contact with Hydro/Pyro/Cryo/Electro, it will deal additional elemental DMG of that type.",
        "icon": "/img/talents/kaedehara_kazuha_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Soumon Swordsmanship",
          "description": "If Chihayaburu comes into contact with Hydro/Pyro/Cryo/Electro when cast, Chihayaburu will absorb that element and if Plunging Attack: Midare Ranzan is used before the effect expires, it will deal an additional 200% ATK of the absorbed elemental type as DMG. This will be considered Plunging Attack DMG. Elemental Absorption may only occur once per use of Chihayaburu.",
          "icon": "/img/talents/kaedehara_kazuha_passive1.png"
        },
        {
          "name": "Poetics of Fuubutsu",
          "description": "Upon triggering a Swirl reaction, Kaedehara Kazuha will grant all party members a 0. 04% Elemental DMG Bonus to the element absorbed by Swirl for every point of Elemental Mastery he has for 8s. Bonuses for different elements obtained through this method can co-exist.",
          "icon": "/img/talents/kaedehara_kazuha_passive2.png"
        },
        {
          "name": "Cloud Strider",
          "description": "Decreases sprinting Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/kaedehara_kazuha_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Keqing",
    "talents": {
      "normalAttack": {
        "name": "Yunlai Swordsmanship",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging enemeies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/keqing_attack.png"
      },
      "elementalSkill": {
        "name": "Stellar Restoration",
        "description": "Hurls a Lightning Stiletto that annihilates her enemies like the swift thunder. When the Stiletto hits its target, it deals Electro DMG to enemies in a small AoE, and places a Stiletto Mark on the spot hit. Hold\nHold to adjust the direction in which the Stiletto shall be thrown.",
        "icon": "/img/talents/keqing_skill.png"
      },
      "elementalBurst": {
        "name": "Starward Sword",
        "description": "Keqing unleashes the power of lightning, dealing Electro DMG in an AoE. She then blends into the shadow of her blade, striking a series of thunderclap-blows to nearby enemies simultaneous that deal multiple instance of Electro DMG. The final attack deals massive AoE Electro DMG.",
        "icon": "/img/talents/keqing_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Thundering Penance",
          "description": "Within 5s of recasting Stellar Restoration while a Lightning Stiletto is present, Keqing's Normal and Charged Attacks are converted to Electro DMG.",
          "icon": "/img/talents/keqing_passive1.png"
        },
        {
          "name": "Aristocratic Dignity",
          "description": "When casting Starward Sword, Keqing's CRIT Rate is increased by 15%, and her Energy Recharge is increased by 15%. This effect lasts for 8s.",
          "icon": "/img/talents/keqing_passive2.png"
        },
        {
          "name": "Land's Overseer",
          "description": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%.",
          "icon": "/img/talents/keqing_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kinich",
    "talents": {
      "normalAttack": {
        "name": "Nightsun Style",
        "description": "Normal Attack\nPerforms up to 3 rapid strikes. After using his Elemental Skill 'Canopy Hunter: Riding High's' mid-air swing, he can perform a Normal Attack in mid-air before landing. Charged Attack\nConsumes a certain amount to spin and throw his Claymore forward to attack opponents.",
        "icon": "/img/talents/kinich_attack.png"
      },
      "elementalSkill": {
        "name": "Canopy Hunter: Riding High",
        "description": "Kinich can swing in mid-air using a grappling hook. When the grappling hook hits an enemy, it attaches to enemies and Kinich will fire Loop Shots. When Nightsoul points are at max, he can use the Elemental Skill to fire a powerful \"Scalespiker Cannon\" and deal Dendro DMG to enemies.",
        "icon": "/img/talents/kinich_skill.png"
      },
      "elementalBurst": {
        "name": "Hail to the Almighty Dragonlord",
        "description": "Unleashes the power of the Almighty Dragonlord, K'uhul Ajaw. Ajaw will unleash his Dragon Breath at intervals, dealing AoE Dendro DMG.",
        "icon": "/img/talents/kinich_burst.png"
      },
      "passiveTalents": [
        {
          "name": "The Price of Desolation",
          "description": "When Kinich is in Nightsoul's Blessing state, opponents hit by his Elemental Skill will enter the Desolation state, and when affected by Burning or Burgeon reaction DMG, they will restore 7 Nightsoul points to him. Nightsoul points can be gained this way once every 0. 8s.",
          "icon": "/img/talents/kinich_passive1.png"
        },
        {
          "name": "Flame Spirit Pact",
          "description": "After a nearby party member triggers a Nightsoul Burst, Kinich will gain 1 stack of Hunter's Experience that lasts 15s. Max 2 stacks. When Kinich uses Canopy Hunter: Riding High's Scalespiker Cannon, all stacks of Hunter's Experience will be consumed, with each stack consumed increasing the DMG dealt by this Cannon shot by 320% of Kinich's ATK.",
          "icon": "/img/talents/kinich_passive2.png"
        },
        {
          "name": "Repaid in Full",
          "description": "When Kinich is in the air following Canopy Hunter: Riding High's mid-air swing, he can consume 10 Phlogiston points to perform another mid-air swing. While in an area with Phlogiston Mechanics within Natlan, he can use Nightsoul Transmission: Kinich. When the current active character is sprinting, in movement states that result from specific Talents, or in the air, when you switch to Kinich: Kinich will perform one of the following actions depending on the conditions met:\nÂ·When facing a Coilgrass Sigil that can be interacted with: He will fire a grappling hook towards it to move;\nÂ·When there are nearby opponents and you are in combat: Kinich will use Canopy Hunter: Riding High in the direction of the opponents;\nOtherwise, Kinich will fire a grappling hook and swing, prioritizing valid Coilgrass Sigils as grapple targets.",
          "icon": "/img/talents/kinich_passive3.png"
        },
        {
          "name": "Swift Envoy",
          "description": "While in an area with Phlogiston Mechanics within Natlan, interacting with some harvestable items will increase your own party members' Movement SPD by 15% for 10s. Additionally, the location of nearby resources unique to Natlan will appear on your mini-map.",
          "icon": "/img/talents/kinich_passive4.png"
        }
      ]
    }
  },
  {
    "character": "Kirara",
    "talents": {
      "normalAttack": {
        "name": "Boxcutter",
        "description": "Normal Attack\nPerforms up to 4 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 3 rapid claw strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kirara_attack.png"
      },
      "elementalSkill": {
        "name": "Meow-teor Kick",
        "description": "Press\nLeaps into the air with all the agility of a cat passing through the bushes, and thwacks her foes with a flying kick that deals AoE Dendro DMG while creating a Shield of Safe Transport. This will also briefly apply Dendro to Kirara. The shield will absorb Dendro DMG with 250% effectiveness.",
        "icon": "/img/talents/kirara_skill.png"
      },
      "elementalBurst": {
        "name": "Secret Art: Surprise Dispatch",
        "description": "Smash opponents with a Special Delivery Package used for punishing parcel thieves, dealing AoE Dendro DMG. After the Special Delivery Package explodes, it will split up into many Cat Grass Cardamoms that will explode either upon contact with opponents or after a period of time, dealing AoE Dendro DMG. \"Hehe, that's right, this stuff was made to deal with those parcel thieves! Remember to leave a 5-star rating once you've received yours!\".",
        "icon": "/img/talents/kirara_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Cat's Creeping Carriage",
          "description": "When Kirara is in the party, animals who produce Fowl, Raw Meat, or Chilled Meat will not be startled when party members approach them.",
          "icon": "/img/talents/kirara_passive1.png"
        },
        {
          "name": "Bewitching, Betwitching Tails",
          "description": "When Kirara is in the Urgent Neko Parcel state of Meow-teor Kick, each impact against an opponent will grant her a stack of Reinforced Packaging. This effect can be triggered once for each opponent hit every 0. 5s.",
          "icon": "/img/talents/kirara_passive2.png"
        },
        {
          "name": "Pupillary Variance",
          "description": "Every 1,000 Max HP Kirara possesses will increase the DMG dealt by Meow-teor Kick by 0. 4%, and the DMG dealt by Secret Art: Surprise Dispatch by 0. 3%.",
          "icon": "/img/talents/kirara_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Klee",
    "talents": {
      "normalAttack": {
        "name": "Kaboom!",
        "description": "Normal Attack\nThrows things that go boom when they hit things! Perform up to 3 explosive attacks, dealing AoE Pyro DMG. Charged Attack\nConsumes a certain amount of Stamina and deals Pyro DMG to enemies after a short casting time. Plunging Attack\nGathering the power of Pyro, Klee plunges towards the ground from mid-air, damaging all enemies in her path.",
        "icon": "/img/talents/klee_attack.png"
      },
      "elementalSkill": {
        "name": "Jumpy Dumpty",
        "description": "Jumpy Dumpty is tons of boom-bang-fun!\n\nWhen thrown, Jumpy Dumpty bounces thrice, igniting and dealing AoE Pyro DMG with every bounce. On the third bounce, the bomb splits into many mines. The mines will explode upon contact with enemies, or after a short period of time, dealing AoE Pyro DMG.",
        "icon": "/img/talents/klee_skill.png"
      },
      "elementalBurst": {
        "name": "Sparks 'n' Splash",
        "description": "Klee's Blazing Delight! For the duration of this ability, continuously summons Sparks 'n' Splash to attack nearby enemies, dealing AoE Pyro DMG.",
        "icon": "/img/talents/klee_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Pounding Surprise",
          "description": "When Jumpy Dumpty and Normal Attacks deal DMG, Klee has a 50% chance to obtain an Explosive Spark. This Explosive Spark is consumed by the next Charged Attack, which costs no Stamina and deals 50% increased DMG.",
          "icon": "/img/talents/klee_passive1.png"
        },
        {
          "name": "Sparkling Burst",
          "description": "When a Charged Attack results in a CRIT, all party members gain 2 Elemental Energy.",
          "icon": "/img/talents/klee_passive2.png"
        },
        {
          "name": "All Of My Treasures!",
          "description": "Displays the location of nearby resources unique to Mondstadt on the mini-map.",
          "icon": "/img/talents/klee_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Sangonomiya Kokomi",
    "talents": {
      "normalAttack": {
        "name": "The Shape of Water",
        "description": "Normal Attack\nPerforms up to 3 consecutive attacks that take the form of swimming fish, dealing Hydro DMG. Charged Attack\nConsumes a certain amount of Stamina to deal AoE Hydro DMG after a short casting time. Plunging Attack\nGathering the might of Hydro, Kokomi plunges towards the ground from mid-air, damaging all opponents in her path.",
        "icon": "/img/talents/kokomi_attack.png"
      },
      "elementalSkill": {
        "name": "Kurage's Oath",
        "description": "Summons a \"bake-kurage\" created from water that can heal her allies. Using this skill will apply the Wet status to Sangonomiya Kokomi. Bake-Kurage:\nDeals Hydro DMG to surrounding opponents and heal nearby active characters at fixed intervals.",
        "icon": "/img/talents/kokomi_skill.png"
      },
      "elementalBurst": {
        "name": "Nereid's Ascension",
        "description": "The might of Watatsumi descends, dealing Hydro DMG to surrounding opponents, before robing Kokomi in a Ceremonial Garment made from the flowing waters of Sangonomiya. Ceremonial Garment\nSangonomiya Kokomi's Normal Attack, Charged Attack and Bake-Kurage DMG are increased based on her Max HP. When her Normal and Charged Attacks hit opponents, Kokomi will restore HP for all nearby party members, and the amount restored is based on her Max HP.",
        "icon": "/img/talents/kokomi_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Tamanooya's Casket",
          "description": "If Sangonomiya Kokomi's own Bake-Kurage are on the field when she uses Nereid's Ascension, the Bake-Kurage's duration will be refreshed.",
          "icon": "/img/talents/kokomi_passive1.png"
        },
        {
          "name": "Song of Pearls",
          "description": "While donning the Ceremonial Garment created by Nereid's Ascension, the Normal and Charged Attack DMG Bonus Sangonomiya Kokomi gains based on her Max HP will receive a further increase based on 15% of her Healing Bonus.",
          "icon": "/img/talents/kokomi_passive2.png"
        },
        {
          "name": "Flawless Strategy",
          "description": "Sangonomiya Kokomi has a 25% Healing Bonus, but a 100% decrease in CRIT Rate.",
          "icon": "/img/talents/kokomi_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kuki Shinobu",
    "talents": {
      "normalAttack": {
        "name": "Shinobu's Shadowsword",
        "description": "Normal Attack\nPerform up to 4 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/kuki_shinobu_attack.png"
      },
      "elementalSkill": {
        "name": "Sanctifying Ring",
        "description": "Creates a Grass Ring of Sanctification at the cost of part of her HP, dealing Electro DMG to nearby opponents. Grass Ring of Sanctification\nFollows your current active character around. Deals Electro DMG to nearby opponents every 1.",
        "icon": "/img/talents/kuki_shinobu_skill.png"
      },
      "elementalBurst": {
        "name": "Gyoei Narukami Kariyama Rite",
        "description": "Stabs an evil-excoriating blade into the ground, creating a field that cleanses the area of all that is foul, dealing continuous Electro DMG to opponents within its AoE based on Shinobu's Max HP. If Shinobu's HP is less than or equal to 50% when this skill is used, the field will last longer.",
        "icon": "/img/talents/kuki_shinobu_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Breaking Free",
          "description": "When Shinobu's HP is not higher than 50%, her Healing Bonus is increased by 15%.",
          "icon": "/img/talents/kuki_shinobu_passive1.png"
        },
        {
          "name": "Heart's Repose",
          "description": "Sanctifying Ring's abilities will be boosted based on Shinobu's Elemental Mastery:\nÂ·Healing amount will be increased by 75% of Elemental Mastery. Â·DMG dealt is increased by 25% of Elemental Mastery.",
          "icon": "/img/talents/kuki_shinobu_passive2.png"
        },
        {
          "name": "Protracted Prayers",
          "description": "",
          "icon": "/img/talents/kuki_shinobu_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Layla",
    "talents": {
      "normalAttack": {
        "name": "Sword of the Radiant Path",
        "description": "Normal Attack\nPerforms up to 3 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/layla_attack.png"
      },
      "elementalSkill": {
        "name": "Nights of Formal Focus",
        "description": "Puts forth a shield known as the Curtain of Slumber, dealing AoE Cryo DMG. The Curtain of Slumber's DMG Absorption is based on Layla's Max HP and absorbs Cryo DMG with 250% effectiveness. When the shield is deployed, Layla will have Cryo applied to her briefly.",
        "icon": "/img/talents/layla_skill.png"
      },
      "elementalBurst": {
        "name": "Dream of the Star-Stream Shaker",
        "description": "Unleashes a Celestial Dreamsphere that constantly fires Starlight Slugs at opponents within its AoE, dealing Cryo DMG. When a Starlight Slug hits, it will generate 1 Night Star for nearby Curtains of Slumber. Each Curtain of Slumber can gain 1 Night Star this way every 0.",
        "icon": "/img/talents/layla_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Like Nascent Light",
          "description": "While the Curtain of Slumber is active, the Deep Sleep effect will activate each time the Curtain gains 1 Night Star:\nThe Shield Strength of a character under the effect of the Curtain of Slumber increases by 6%. This effect can have a maximum of 4 stacks and persists until the Curtain of Slumber disappears.",
          "icon": "/img/talents/layla_passive1.png"
        },
        {
          "name": "Sweet Slumber Undisturbed",
          "description": "The DMG dealt by the Shooting Stars fired by Nights of Formal Focus is increased by 1. 5% of Layla's Max HP.",
          "icon": "/img/talents/layla_passive2.png"
        },
        {
          "name": "Shadowy Dream-Signs",
          "description": "When Layla crafts Character Talent Materials, she has a 10% chance to receive double the product.",
          "icon": "/img/talents/layla_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Lisa",
    "talents": {
      "normalAttack": {
        "name": "Lightning Touch",
        "description": "Normal Attack\nPerform up to 4 lightning attacks that deal Electro DMG. Charged Attack\nConsumes a certain amount of Stamina to deal AoE Electro DMG after a short casting time. Plunging Attack\nGathering the might of Electro, Lisa plunges towards the ground from mid-air, damaging all enemies in her path.",
        "icon": "/img/talents/lisa_attack.png"
      },
      "elementalSkill": {
        "name": "Violet Arc",
        "description": "Channels the power of lightning to sweep bothersome matters away. Press\nReleases a homing Lightning Orb. On hit, it deals Electro DMG, and applies a stack of Conductive status (Max 3 stacks) to enemies in a small AoE.",
        "icon": "/img/talents/lisa_skill.png"
      },
      "elementalBurst": {
        "name": "Lightning Rose",
        "description": "Summons a Lightning Rose that unleashes powerful lightning bolts, launching surrounding enemies and dealing Electro DMG. The Lightning Rose will continuously emit lightning to knock back enemies and deal Electro DMG for so long as it persists.",
        "icon": "/img/talents/lisa_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Induced Aftershock",
          "description": "Hits by charged Attacks apply Violet Arc's Conductive status to enemies.",
          "icon": "/img/talents/lisa_passive1.png"
        },
        {
          "name": "Static Electricity Field",
          "description": "Enemies hit by Lightning Rose have their DEF decreased by 15% for 10s.",
          "icon": "/img/talents/lisa_passive2.png"
        },
        {
          "name": "General Pharmaceutics",
          "description": "When Lisa crafts a potion, she has a 20% chance to refund a portion of the crafting materials used.",
          "icon": "/img/talents/lisa_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Lynette",
    "talents": {
      "normalAttack": {
        "name": "Rapid Ritesword",
        "description": "Normal Attack\nPerforms up to 4 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/lynette_attack.png"
      },
      "elementalSkill": {
        "name": "Enigmatic Feint",
        "description": "Flicks her mantle and executes an Enigma Thrust, dealing Anemo DMG. When the Enigma Thrust hits an opponent, it will restore Lynette's HP based on her Max HP, and in the 4s afterward, she will lose a certain amount of HP per second. Based on whether you press or hold this ability, she will use Enigma Thrust differently.",
        "icon": "/img/talents/lynette_skill.png"
      },
      "elementalBurst": {
        "name": "Magic Trick: Astonishing Shift",
        "description": "Lynette raises her mantle high, dealing AoE Anemo DMG, using skillful sleight of hand to make a giant Bogglecat Box appear!\nBogglecat Box\nTaunts nearby opponents, attracting their attacks. Deals Anemo DMG to nearby opponents at intervals. When the Bogglecat Box comes into contact with Hydro/Pyro/Cryo/Electro, it will gain the corresponding element and additionally fire Vivid Shots that will deal DMG from that element at intervals.",
        "icon": "/img/talents/lynette_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Loci-Based Mnemonics",
          "description": "Shows the location of nearby Recovery Orbs on the minimap. The underwater Stamina and HP gained from touching Orbs will be increased by 25%.",
          "icon": "/img/talents/lynette_passive1.png"
        },
        {
          "name": "Sophisticated Synergy",
          "description": "Within 10s after using Magic Trick: Astonishing Shift, when there are 1/2/3/4 Elemental Types in the party, all party members' ATK will be increased by 8%/12%/16%/20% respectively.",
          "icon": "/img/talents/lynette_passive2.png"
        },
        {
          "name": "Props Positively Prepped",
          "description": "After the Bogglecat Box summoned by Magic Trick: Astonishing Shift performs Elemental Conversion, Lynette's Elemental Burst will deal 15% more DMG. This effect will persist until the Bogglecat Box's duration ends.",
          "icon": "/img/talents/lynette_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Lyney",
    "talents": {
      "normalAttack": {
        "name": "Card Force Translocation",
        "description": "Normal Attack\nPerforms up to 4 consecutive shots with a bow. Plunging Attack\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact. Charged Attack\nPerforms a more precise Aimed Shot with increased DMG.",
        "icon": "/img/talents/lyney_attack.png"
      },
      "elementalSkill": {
        "name": "Bewildering Lights",
        "description": "Lyney does a flourish with his hat, unleashing a firework surprise!\nWhen used, he will clear all current Prop Surplus stacks and deal AoE Pyro DMG to opponents in front of him. DMG will be increased according to the stacks cleared, and this will also regenerate Lyney's HP based on his Max HP. When a Grin-Malkin Hat created by Lyney is on the field, the fireworks will cause it to explode, dealing AoE Pyro DMG equal to that of a Pyrotechnic Strike.",
        "icon": "/img/talents/lyney_skill.png"
      },
      "elementalBurst": {
        "name": "Wondrous Trick: Miracle Parade",
        "description": "Unleashing his magic, Lyney turns hinself into a Grin-Malkin Cat that can move around quickly. (Not to be mistaken for the Grin-Malkin Hat. They're two different props!)\nWhen the Grin-Malkin Cat gets close to opponents, it will send flames falling down on them, dealing at most 1 instance of Pyro DMG to each opponent.",
        "icon": "/img/talents/lyney_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Trivial Observations",
          "description": "Displays the location of nearby resources unique to Fontaine on the mini-map.",
          "icon": "/img/talents/lyney_passive1.png"
        },
        {
          "name": "Perilous Performance",
          "description": "If Lyney consumes HP when firing off a Prop Arrow, the Grin-Malkin hat summoned by the arrow will, upon hitting an opponent, restore 3 Energy to Lyney and increase DMG dealt by 80% of his ATK.",
          "icon": "/img/talents/lyney_passive2.png"
        },
        {
          "name": "Conclusive Ovation",
          "description": "When dealing DMG to opponents affected by Pyro, Lyney will receive the following buffs:\nBase ATK increased by 60%. Each Pyro party member other than Lyney will cause this effect to receive a further 20% bonus. Lyney can gain a total of 100% increased DMG to opponents affected by Pyro in this way.",
          "icon": "/img/talents/lyney_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Mika",
    "talents": {
      "normalAttack": {
        "name": "Spear of Favonius - Arrow's Passage",
        "description": "Normal Attack\nPerforms up to 5 consecutive strikes using his crossbow and spear. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/mika_attack.png"
      },
      "elementalSkill": {
        "name": "Starfrost Swirl",
        "description": "Mika uses his crossbow to attack, granting all nearby characters in your party Soulwind. When characters in the Soulwind state are on the field, their ATK SPD will be increased. Will take effect in different ways if Tapped or Held.",
        "icon": "/img/talents/mika_skill.png"
      },
      "elementalBurst": {
        "name": "Skyfeather Song",
        "description": "Derives the ability to spur his teammates on from the recited prayers of the knightly order, regenerating HP for all nearby party members. This healing is based on Mika's Max HP and will grant them the Eagleplume state. Eagleplume\nWhen the Normal Attacks of active characters affected by Eagleplume hit an opponent, Mika will help them regenerate HP based on his Max HP.",
        "icon": "/img/talents/mika_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Demarcation",
          "description": "Displays the location of nearby resources unique to Mondstadt on the mini-map.",
          "icon": "/img/talents/mika_passive1.png"
        },
        {
          "name": "Suppressive Barrage",
          "description": "Per the following circumstances, the Soulwind state caused by Starfrost Swirl will grant characters the Detector effect, increasing their Physical DMG by 10% when they are on the field. If the Flowfrost Arrow hits more than one opponent, each additional opponent hit will generate 1 Detector stack. When a Rimestar Shard hits an opponent, it will generate 1 Detector stack.",
          "icon": "/img/talents/mika_passive2.png"
        },
        {
          "name": "Topographical Mapping",
          "description": "When an active character affected by both Skyfeather Song's Eagleplume and Starfrost Swirl's Soulwind at once scores a CRIT Hit with their attacks, Soulwind will grant them 1 stack of Detector from Suppressive Barrage. During a single instance of Soulwind, 1 Detector stack can be gained in this manner. Additionally, the maximum number of stacks that can be gained through Soulwind alone is increased by 1.",
          "icon": "/img/talents/mika_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Mona",
    "talents": {
      "normalAttack": {
        "name": "Ripple of Fate",
        "description": "Normal Attack\nPerforms up to 4 water splash attacks that deal Hydro DMG. Charged Attack\nConsumes a certain amount of Stamina and deals AoE Hydro DMG after a short casting time. Plunging Attack\nGathering the might of Hydro, Mona plunges towards the ground from mid-air, damaging all enemies in her path.",
        "icon": "/img/talents/mona_attack.png"
      },
      "elementalSkill": {
        "name": "Reflection of Doom",
        "description": "Creates an illusory Phantom of fate from coalesced waterspouts. The Phantom has the following special properties:\n\nContinuously taunts nearby enemies, attracting their fire. Continuously deals Hydro DMG to nearby enemies.",
        "icon": "/img/talents/mona_skill.png"
      },
      "elementalBurst": {
        "name": "Stellaris Phantasm",
        "description": "Mona summons the sparkling waves and creates a reflection of the starry sky, applying the Illusory Bubble status to opponents in a large AoE. Illusory Bubble\nTraps opponents inside a pocket of destiny and also makes them Wet. Renders weaker opponents immobile.",
        "icon": "/img/talents/mona_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Come 'n' Get Me, Hag!",
          "description": "After she has used Illusory Torrent for 2s, if there are any enemies nearby, Mona will automatically create a Phantom. A Phantom created in this manner lasts for 2s, and its explosion DMG is equal to 50% of Mirror Reflection of Doom.",
          "icon": "/img/talents/mona_passive1.png"
        },
        {
          "name": "Waterborne Destiny",
          "description": "Increases Mona's Hydro DMG Bonus by a degree equivalent to 20% of her Energy Recharge rate.",
          "icon": "/img/talents/mona_passive2.png"
        },
        {
          "name": "Principium of Astrology",
          "description": "When Mona crafts Weapon Ascension Materials, she has a 25% chance to refund a portion of the crafting materials used.",
          "icon": "/img/talents/mona_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Mualani",
    "talents": {
      "normalAttack": {
        "name": "Cooling Treatment",
        "description": "Normal Attack\nPerforms up to 3 attacks that deal Hydro DMG. Charged Attack\nConsumes a certain amount of Stamina to smack a Pufferball into the air that deals AoE Hydro DMG upon landing. Plunging Attack\nGathers the power of Hydro and plunges towards the ground from mid-air, damaging all opponents in her path.",
        "icon": "/img/talents/mualani_attack.png"
      },
      "elementalSkill": {
        "name": "Surfshark Wavebreaker",
        "description": "Combining her mastery of speed and the waves and water, Mualani can surf anytime, anywhere. After using this skill, Mualani will gain 60 Nightsoul points and enter the Nightsoul's Blessing state. Nightsoul's Blessing: Mualani\nContinuously consume Nightsoul points.",
        "icon": "/img/talents/mualani_skill.png"
      },
      "elementalBurst": {
        "name": "Boomsharka-laka",
        "description": "Fires a Super Shark Missile that can track opponents, dealing Nightsoul-aligned AoE Hydro DMG based on Mualani's Max HP.",
        "icon": "/img/talents/mualani_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Heat-Resistant Freshwater Floater",
          "description": "When Sharky's Surging Bite hits an opponent, a Puffer will be generated nearby. Mualani will restore 20 Nightsoul points when she picks up a Puffer. Only 2 such Puffers can be created in this way during a single instance of being in Nightsoul's Blessing.",
          "icon": "/img/talents/mualani_passive1.png"
        },
        {
          "name": "Natlan's Greatest Guide",
          "description": "When a nearby party member triggers a Nightsoul Burst, Mualani will gain 1 stack of Wavechaser's Exploits, which lasts for 20s. Max 3 stacks. When she uses Boomsharka-laka, Mualani will clear all Wavechaser's Exploits stacks and increase the DMG of this Boomsharka-laka by 15%/30%/45% of her Max HP based on the number of stacks cleared.",
          "icon": "/img/talents/mualani_passive2.png"
        },
        {
          "name": "Crests and Troughs",
          "description": "After her Nightsoul points are depleted, Mualani will switch to consuming Phlogiston to maintain her Nightsoul's Blessing. While in an area with Phlogiston Mechanics within Natlan, she can use Nightsoul Transmission: Mualani. When the active character is currently sprinting, swimming, in a movement mode caused by certain Talents, or at a certain height in the air, the following will trigger when switching to Mualani: Mualani will enter the Nightsoul's Blessing state and gain 40 Nightsoul points.",
          "icon": "/img/talents/mualani_passive3.png"
        },
        {
          "name": "The Trick Is to Keep Smiling!",
          "description": "While in an area with Phlogiston Mechanics within Natlan, 15 Phlogiston will be restored when interacting with some harvestable items. Additionally, the location of nearby resources unique to Natlan will appear on your mini-map.",
          "icon": "/img/talents/mualani_passive4.png"
        }
      ]
    }
  },
  {
    "character": "Nahida",
    "talents": {
      "normalAttack": {
        "name": "Akara",
        "description": "Normal Attack\nPerforms up to 4 attacks that deal Dendro DMG to opponents in front of her\nCharged Attack\nConsumes a certain amount of Stamina to deal AoE Dendro DMG to opponents in front of her after a short casting time. Plunging Attack\nCalling upon the might of Dendro, Nahida plunges towards the ground from mid-air, damaging all opponents in her path. Deals AoE Dendro DMG upon impact with the ground.",
        "icon": "/img/talents/nahida_attack.png"
      },
      "elementalSkill": {
        "name": "All Schemes to Know",
        "description": "Sends forth karmic bonds of wood and tree from her side, dealing AoE Dendro DMG and marking up to 8 opponents hit with the Seed of Skandha. When held, this skill will trigger differently. Hold\nEnters Aiming Mode, which will allow you to select a limited number of opponents within a limited area.",
        "icon": "/img/talents/nahida_skill.png"
      },
      "elementalBurst": {
        "name": "Illusory Heart",
        "description": "Manifests the Court of Dreams and expands the Shrine of Maya. When the Shrine of Maya field is unleashed, the following effects will be separately unleashed based on the Elemental Types present within the party. Pyro: While Nahida remains within the Shrine of Maya, the DMG dealt by Tri-Karma Purification from \"All Schemes to Know\" is increased.",
        "icon": "/img/talents/nahida_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Compassion Illuminated",
          "description": "When unleashing Illusory Heart, the Shrine of Maya will gain the following effects:\nThe Elemental Mastery of the active character within the field will be increased by 25% of the Elemental Mastery of the party member with the highest Elemental Mastery. You can gain a maximum of 250 Elemental Mastery in this manner.",
          "icon": "/img/talents/nahida_passive1.png"
        },
        {
          "name": "Awakening Elucidated",
          "description": "Each point of Nahida's Elemental Mastery beyond 200 will grant 0. 1% Bonus DMG and 0. 03% CRIT Rate to Tri-Karma Purification from All Schemes to Know.",
          "icon": "/img/talents/nahida_passive2.png"
        },
        {
          "name": "On All Things Meditated",
          "description": "Nahida can use All Schemes to Know to interact with some harvestable items within a fixed AoE. This skill may even have some other effects.",
          "icon": "/img/talents/nahida_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Navia",
    "talents": {
      "normalAttack": {
        "name": "Blunt Refusal",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes. Charged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby opponents. At the end of the sequence, performs a more powerful slash.",
        "icon": "/img/talents/navia_attack.png"
      },
      "elementalSkill": {
        "name": "Ceremonial Crystalshot",
        "description": "When a character in the party obtains an Elemental Shard created from the Crystallize reaction, Navia will gain 1 Crystal Shrapnel stack. Navia can have up to 6 stacks of Crystal Shrapnel at once. Each time Crystal Shrapnel gain is triggered, the duration of the Crystal Shrapnel stacks you already have will be reset.",
        "icon": "/img/talents/navia_skill.png"
      },
      "elementalBurst": {
        "name": "As the Sunlit Sky's Singing Salute",
        "description": "On the orders of the President of the Spina di Rosula, call for a magnificent Rosula Dorata Salute. Unleashes a massive cannon bombardment on opponents in front of her, dealing AoE Geo DMG and providing Cannon Fire Support for a duration afterward, periodically dealing Geo DMG to nearby opponents. When cannon attacks hit opponents, Navia will gain 1 stack of Crystal Shrapnel.",
        "icon": "/img/talents/navia_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Painstaking Transaction",
          "description": "Gains 25% more rewards when dispatched on a Fontaine Expedition for 20 hours.",
          "icon": "/img/talents/navia_passive1.png"
        },
        {
          "name": "Undisclosed Distribution Channels",
          "description": "For 4s after using Ceremonial Crystalshot, the DMG dealt by Navia's Normal Attacks, Charged Attacks, and Plunging Attacks will be converted into Geo DMG which cannot be overridden by other Elemental infusions, and the DMG dealt by Navia's Normal Attacks, Charged Attacks, and Plunging Attacks will be increased by 40%.",
          "icon": "/img/talents/navia_passive2.png"
        },
        {
          "name": "Mutual Assistance Network",
          "description": "For each Pyro/Electro/Cryo/Hydro party member, Navia gains 20% increased ATK. This effect can stack up to 2 times.",
          "icon": "/img/talents/navia_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Neuvillette",
    "talents": {
      "normalAttack": {
        "name": "As Water Seeks Equilibrium",
        "description": "Normal Attack\nWith light flourishes, Neuvillette commands the tides to unleash a maximum of 3 attacks, dealing Hydro DMG. Charged Attack Empowerment: Legal Evaluation\nWhile charging up, Neuvillette will gather the power of water, forming it into a Seal of Arbitration. In this state, Neuvillette can move and change facing, and also absorb any Sourcewater Droplets in a certain AoE.",
        "icon": "/img/talents/neuvillette_attack.png"
      },
      "elementalSkill": {
        "name": "O Tears, I Shall Repay",
        "description": "Summons a Raging Waterfall that will deal AoE Hydro DMG to opponents in front of Neuvillette based on his Max HP. After hitting an opponent, this skill will generate 3 Sourcewater Droplets near that opponent. Arkhe: Pneuma\nAt certain intervals, when the Raging Waterfall descends, a Spiritbreath Thorn will descend that will pierce opponents, dealing Pneuma-aligned Hydro DMG.",
        "icon": "/img/talents/neuvillette_skill.png"
      },
      "elementalBurst": {
        "name": "O Tides, I Have Returned",
        "description": "Unleashes waves that will deal AoE Hydro DMG based on Neuvillette's Max HP. After a short interval, 2 waterfalls will descend and deal Hydro DMG in a somewhat smaller AoE, and will generate 6 Sourcewater Droplets within an area in front. \"The law is only established after its publication, and above that, the laws of nature have governed all species and eras since ancient times.",
        "icon": "/img/talents/neuvillette_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Gather Like the Tide",
          "description": "Increases underwater Sprint SPD for your own party members by 15%. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/neuvillette_passive1.png"
        },
        {
          "name": "Heir to the Ancient Sea's Authority",
          "description": "When a party member triggers a Vaporize, Frozen, Electro-Charged, Bloom, Hydro Swirl, or a Hydro Crystallize reaction on opponents, 1 stack of Past Draconic Glories will be granted to Neuvillette for 30s. Max 3 stacks. Past Draconic Glories causes Charged Attack: Equitable Judgment to deal 110%/125%/160% of its original DMG.",
          "icon": "/img/talents/neuvillette_passive2.png"
        },
        {
          "name": "Discipline of the Supreme Arbitration",
          "description": "For each 1% of Neuvillette's current HP greater than 30% of Max HP, he will gain 0. 6% Hydro DMG Bonus. A maximum bonus of 30% can be obtained this way.",
          "icon": "/img/talents/neuvillette_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Nilou",
    "talents": {
      "normalAttack": {
        "name": "Dance of Samser",
        "description": "Normal Attack\nPerforms up to 3 consecutive sword strikes. Charged Attack\nConsumes a certain amount of Stamina to perform a twirling slash. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/nilou_attack.png"
      },
      "elementalSkill": {
        "name": "Dance of Haftkarsvar",
        "description": "Nilou will enter the Pirouette state, dealing Hydro DMG to nearby opponents based on her Max HP. While she is in the Pirouette state, Nilou's Normal Attacks and Elemental Attacks will cause her to enter the Sword Dance and Whirling Steps stances respectively, causing DMG she deals to be converted to Hydro DMG that cannot be overridden and that is considered Elemental Skill DMG. In these stances, Nilou's third dance step will end Pirouette, and has the following effects:\nSword Dance: unleashes a Luminous Illusion that deals Hydro DMG to opponents it touches and grants Nilou the Lunar Prayer effect.",
        "icon": "/img/talents/nilou_skill.png"
      },
      "elementalBurst": {
        "name": "Dance of Abzendegi: Distant Dreams, Listening Spring",
        "description": "Begins the dance of faraway dreams and springs that hear, causing a Lotus of Distant Waters to bloom, dealing AoE Hydro DMG based on Nilou's Max HP and applying the Lingering Aeon effect to all opponents hit. After an interval, opponents affected by Lingering Aeon will take Hydro DMG.",
        "icon": "/img/talents/nilou_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Court of Dancing Petals",
          "description": "When all characters in the party are all Dendro or Hydro, and there are at least one Dendro character and one Hydro character:\nThe completion of the third dance step of Nilou's Dance of Haftkarsvar will grant all nearby characters the Golden Chalice's Bounty for 30s. Characters under the effect of Golden Chalice's Bounty will increase the Elemental Mastery of all nearby characters by 100 for 10s whenever they are hit by Dendro attacks. Also, triggering the Bloom reaction will create Bountiful Cores instead of Dendro Cores.",
          "icon": "/img/talents/nilou_passive1.png"
        },
        {
          "name": "Dreamy Dance of Aeons",
          "description": "Every 1,000 points of Nilou's Max HP above 30,000 will cause the DMG dealt by Bountiful Cores created by characters affected by Golden Chalice's Bounty to increase by 9%. The maximum increase in Bountiful Core DMG that can be achieved this way is 400%.",
          "icon": "/img/talents/nilou_passive2.png"
        },
        {
          "name": "White Jade Lotus",
          "description": "When Perfect Cooking is achieved on Food with Adventure-related effects, there is a 12% chance to obtain double the product.",
          "icon": "/img/talents/nilou_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Ningguang",
    "talents": {
      "normalAttack": {
        "name": "Sparkling Scatter",
        "description": "Normal Attack\nShoots gems that deal Geo DMG. Upon hit, this grants Ningguang 1 Star Jade. Charged Attack\nConsumes a certain amount of Stamina to fire off a giant gem that deals Geo DMG.",
        "icon": "/img/talents/ningguang_attack.png"
      },
      "elementalSkill": {
        "name": "Jade Screen",
        "description": "Ningguang creates a Jade Screen out of gold, obsidian and her great opulence, dealing AoE Geo DMG. Jade Screen\n\nBlocks enemy projectiles. Endurance scales based on Ningguang's Max HP.",
        "icon": "/img/talents/ningguang_skill.png"
      },
      "elementalBurst": {
        "name": "Starshatter",
        "description": "Gathering a great number of gems, Ningguang scatters them all at once, sending homing projectiles at her enemies that deal massive Geo DMG. If Starshatter is cast when a Jade Screen is nearby, the Jade Screen will fire additional gem projectiles at the same time.",
        "icon": "/img/talents/ningguang_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Backup Plan",
          "description": "When Ningguang is in possession of Star Jades, her Charged Attack does not consume Stamina.",
          "icon": "/img/talents/ningguang_passive1.png"
        },
        {
          "name": "Strategic Reserve",
          "description": "A character that passes through the Jade Screen will gain a 12% Geo DMG Bonus for 10s.",
          "icon": "/img/talents/ningguang_passive2.png"
        },
        {
          "name": "Trove of Marvelous Treasure",
          "description": "Displays the location of nearby ore veins (Iron Ore, White Iron Ore, Crystal Ore, and Magical Crystal Ore) on the mini-map.",
          "icon": "/img/talents/ningguang_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Noelle",
    "talents": {
      "normalAttack": {
        "name": "Favonius Bladework - Maid",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes. Charged Attack\nDrains Stamina over time to perform continuous swirling attacks against all nearby enemies. At end of the sequence, perform a more powerful slash.",
        "icon": "/img/talents/noelle_attack.png"
      },
      "elementalSkill": {
        "name": "Breastplate",
        "description": "Summons a protective stone armor, dealing Geo DMG to surrounding enemies and creating a shield. The shield's DMG Absorption scaled based on Noelle's DEF. The shield has the following properties:\n\nWhen Noelle's Normal and Charged Attacks hit a target, they have a certain chance to regenerate HP for all characters, both on and off the field.",
        "icon": "/img/talents/noelle_skill.png"
      },
      "elementalBurst": {
        "name": "Sweeping Time",
        "description": "Gathering the strength of stone around her weapon, Noelle strikes the enemies surrounding her within a large AoE, dealing Geo DMG. Afterwards, Noelle gains the following effects:\n\nLarger attack AoE. Converts attack DMG to Geo DMG.",
        "icon": "/img/talents/noelle_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Devotion",
          "description": "When Noelle is in the party but not on the field, this ability triggers automatically when the active character's HP falls below 30%:\nCreates a shield that lasts for 20s and absorbs DMG equal to 400% of Noelle's DEF. This effect can only occur once every 60s.",
          "icon": "/img/talents/noelle_passive1.png"
        },
        {
          "name": "Nice and Clean",
          "description": "Every 4 Normal or Charged Attack hits will decrease the CD of Breastplate by 1s. Hitting multiple enemies with a single attack is only counted as 1 hit.",
          "icon": "/img/talents/noelle_passive2.png"
        },
        {
          "name": "Maid's Knighthood",
          "description": "When a Perfect Cooking is achieved on a DEF-boosting dish, Noelle has a 12% chance to obtain double the product.",
          "icon": "/img/talents/noelle_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Qiqi",
    "talents": {
      "normalAttack": {
        "name": "Ancient Sword Art",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/qiqi_attack.png"
      },
      "elementalSkill": {
        "name": "Adeptus Art: Herald of Frost",
        "description": "Using the Icevein Talisman, Qiqi brings forth the Herald of Frost, dealing Cryo DMG to nearby enemies. Herald of Frost\n\nWhen Qiqi hits a target with her Normal or Charged Attacks, she regenerates HP for all party members and all nearby allied characters. Healing scales based on Qiqi's ATK.",
        "icon": "/img/talents/qiqi_skill.png"
      },
      "elementalBurst": {
        "name": "Adeptus Art: Preserver of Fortune",
        "description": "Qiqi releases the adeptus power sealed within her body, marking nearby enemies with a Fortune-Preserving Talisman that deals Cryo DMG. Fortune-Preserving Talisman\nWhen enemies affected by this Talisman take DMG, the character that dealt this DMG regenerates HP.",
        "icon": "/img/talents/qiqi_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Life-Prolonging Methods",
          "description": "When a character under the effects of Adeptus Art: Herald of Frost triggers an Elemental Reaction, their Incoming Healing Bonus is increased by 20% for 8s.",
          "icon": "/img/talents/qiqi_passive1.png"
        },
        {
          "name": "A Glimpse into Arcanum",
          "description": "When Qiqi hits enemies with her Normal and Charged Attacks, she has a 50% chance to apply a Fortune-Preserving Talisman to them for 6s. This effect can only occur once every 30s.",
          "icon": "/img/talents/qiqi_passive2.png"
        },
        {
          "name": "Former Life Memories",
          "description": "Displays the location of nearby resources unique to Liyue on the mini-map.",
          "icon": "/img/talents/qiqi_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Raiden Shogun",
    "talents": {
      "normalAttack": {
        "name": "Origin",
        "description": "Normal Attack\nPerforms up to 5 consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to perform an upward slash. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/shogun_attack.png"
      },
      "elementalSkill": {
        "name": "Transcendence: Baleful Omen",
        "description": "The Raiden Shogun unveils a shard of her Euthymia, dealing Electro DMG to nearby opponents, and granting nearby party members the Eye of Stormy Judgment. Eye of Stormy Judgment\nWhen characters with this buff attack and deal DMG to opponents, the Eye will unleash a coordinated attack, dealing AoE Electro DMG at the opponent's position. Characters who gain the Eye of Stormy Judgment will have their Elemental Burst DMG increased based on the Energy Cost of the Elemental Burst during the Eye's duration.",
        "icon": "/img/talents/shogun_skill.png"
      },
      "elementalBurst": {
        "name": "Secret Art: Musou Shinsetsu",
        "description": "Gathering truths unnumbered and wishes uncounted, the Raiden Shogun unleashes the Musou no Hitotachi and deals AoE Electro DMG, using Musou Isshin in combat for a certain duration afterward. The DMG dealt by Musou no Hitotachi and Musou Isshin's attacks will be increased based on the number of Chakra Desiderata's Resolve stacks consumed when this skill is used. Musou Isshin\nWhile in this state, the Raiden Shogun will wield her tachi in battle, while her Normal, Charged, and Plunging Attacks will be infused with Electro DMG, which cannot be overridden.",
        "icon": "/img/talents/shogun_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Wishes Unnumbered",
          "description": "When nearby party members gain Elemental Orbs or Particles, Chakra Desiderata gains 2 Resolve stacks. This effect can occur once every 3s.",
          "icon": "/img/talents/shogun_passive1.png"
        },
        {
          "name": "Enlightened One",
          "description": "Each 1% above 100% Energy Recharge that the Raiden Shogun possesses grants her:\n0. 6% greater Energy restoration from Musou Isshin\n0. 4% Electro DMG Bonus.",
          "icon": "/img/talents/shogun_passive2.png"
        },
        {
          "name": "All-Preserver",
          "description": "Mora expended when ascending Swords and Polearms is decreased by 50%.",
          "icon": "/img/talents/shogun_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Razor",
    "talents": {
      "normalAttack": {
        "name": "Steel Fang",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes. Charged Attack\nDrains Stamina over time to perform continuous swirling attacks against all nearby enemies. At end of the sequence, perform a more powerful slash.",
        "icon": "/img/talents/razor_attack.png"
      },
      "elementalSkill": {
        "name": "Claw and Thunder",
        "description": "Hunts his prey using the techniques taught to him by his master and his Lupical. Press\nSwings the Thunder Wolf Claw, dealing Electro DMG to enemies in front of Razor. Upon striking an enemy, Razor will gain an Electro Sigil, which increases his Energy Recharge rate.",
        "icon": "/img/talents/razor_skill.png"
      },
      "elementalBurst": {
        "name": "Lightning Fang",
        "description": "Summons the Wolf Within which deals Electro DMG to all nearby opponents. This clears all of Razor's Electro Sigils, which will be converted into elemental energy for him. The Wolf Within will fight alongside Razor for the skill's duration.",
        "icon": "/img/talents/razor_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Awakening",
          "description": "Decreases Claw and Thunder's CD by 18%. Using Lightning Fang resets the CD of Claw and Thunder.",
          "icon": "/img/talents/razor_passive1.png"
        },
        {
          "name": "Hunger",
          "description": "When Razor's Energy is below 50%, increases Energy Recharge by 30%.",
          "icon": "/img/talents/razor_passive2.png"
        },
        {
          "name": "Wolvensprint",
          "description": "Decreases all party member's sprinting Stamina Consumption by 20%.",
          "icon": "/img/talents/razor_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Rosaria",
    "talents": {
      "normalAttack": {
        "name": "Spear of the Church",
        "description": "Normal Attack\nPerforms up to five rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/rosaria_attack.png"
      },
      "elementalSkill": {
        "name": "Ravaging Confession",
        "description": "Rosaria swiftly positions herself behind her opponent, then pierces and slashes the enemy with her polearm, dealing Cryo DMG. Rosaria cannot use this ability to move behind larger opponents.",
        "icon": "/img/talents/rosaria_skill.png"
      },
      "elementalBurst": {
        "name": "Rites of Termination",
        "description": "Rosaria's unique take on this prayer ritual. First, she swings her weapon to slash surrounding enemies; then, she summons a frigid Ice Lance that strikes the ground. Both actions deal Cryo DMG.",
        "icon": "/img/talents/rosaria_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Regina Probationum",
          "description": "When Rosaria strikes an opponent from behind using Ravaging Confession, Rosaria's CRIT Rate increases by 12% for 5s.",
          "icon": "/img/talents/rosaria_passive1.png"
        },
        {
          "name": "Shadow Samaritan",
          "description": "Casting Rites of Termination increases CRIT Rate of all nearby party members (except Rosaria herself) by 15% of Rosaria's CRIT Rate for 10s. Rosaria's CRIT Rate Bonus gained this way cannot exceed 15%.",
          "icon": "/img/talents/rosaria_passive2.png"
        },
        {
          "name": "Night Walk",
          "description": "At night (18:00 - 6:00), increases the Movement SPD of your own party members by 10%. Does not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the same effects.",
          "icon": "/img/talents/rosaria_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Kujou Sara",
    "talents": {
      "normalAttack": {
        "name": "Tengu Bowmanship",
        "description": "Normal Attack\nPerform up to 5 consecutive shots with a bow. Charged Attack\n Perform a more precise Aimed Shot with increased DMG. While aiming, crackling lightning will accumulate on the arrowhead.",
        "icon": "/img/talents/kujou_sara_attack.png"
      },
      "elementalSkill": {
        "name": "Tengu Stormcall",
        "description": "Retreats rapidly with the speed of a tengu, summoning the protection of the Crowfeather. Gains Crowfeather Cover for 18s, and when Kujou Sara fires a fully-charged Aimed Shot, Crowfeather Cover will be consumed, and will leave a Crowfeather at the target location. Crowfeathers will trigger Tengu Juurai: Ambush after a short time, dealing Electro DMG and granting the active character within its AoE an ATK Bonus based on Kujou Sara's Base ATK.",
        "icon": "/img/talents/kujou_sara_skill.png"
      },
      "elementalBurst": {
        "name": "Subjugation: Koukou Sendou",
        "description": "Casts down Tengu Juurai: Titanbreaker, dealing AoE Electro DMG. Afterwards, Tengu Juurai: Titanbreaker spreads out into 4 consecutive bouts of Tengu Juurai: Stormcluster, dealing AoE Electro DMG. Tengu Juurai: Titanbreaker and Tengu Juurai: Stormcluster can provide the active character within their AoE with the same ATK Bonus as given by the Elemental Skill, Tengu Stormcall.",
        "icon": "/img/talents/kujou_sara_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Immovable Will",
          "description": "While in the Crowfeather Cover state provided by Tengu Stormcall, Aimed Shot charge times are decreased by 60%.",
          "icon": "/img/talents/kujou_sara_passive1.png"
        },
        {
          "name": "Decorum",
          "description": "When Tengu Juurai: Ambush hits opponents, Kujou Sara will restore 1. 2 Energy to all party members for every 100% Energy Recharge she has. This effect can be triggered once every 3s.",
          "icon": "/img/talents/kujou_sara_passive2.png"
        },
        {
          "name": "Land Survey",
          "description": "When dispatched on an expedition in Inazuma, time consumed is reduced by 25%.",
          "icon": "/img/talents/kujou_sara_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Sayu",
    "talents": {
      "normalAttack": {
        "name": "Shuumatsuban Ninja Blade",
        "description": "Normal Attack:\nPerforms up to 4 consecutive strikes. Charged Attack:\nrains Stamina over time to perform continuous spinning attacks against all nearby opponents. At the end of the sequence, perform a more powerful slash.",
        "icon": "/img/talents/sayu_attack.png"
      },
      "elementalSkill": {
        "name": "Yoohoo Art: Fuuin Dash",
        "description": "The special technique of the Yoohoo Ninja Arts!\nSayu curls up into a rolling Fuufuu Windwheel and smashes into opponents at high speed, dealing Anemo DMG. When the duration ends, she unleashes a Fuufuu Whirlwind Kick, dealing AoE Anemo DMG. Press: Enters the Fuufuu Windwheel state, rolling forward a short distance before using the Fuufuu Whirlwind Kick.",
        "icon": "/img/talents/sayu_skill.png"
      },
      "elementalBurst": {
        "name": "Yoohoo Art: Mujina Flurry",
        "description": "The other super special technique of the Yoohoo Ninja Arts!\n\nIt summons a pair of helping hands for Sayu. Deals Anemo DMG to nearby opponents and heals all nearby party members. The amount of HP restored is based on Sayu's ATK.",
        "icon": "/img/talents/sayu_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Someone More Capable",
          "description": "When Sayu triggers a Swirl reaction while active, she heals all your characters and nearby allies for 300 HP. She will also heal an additional 1. 2 HP for every point of Elemental Mastery she has.",
          "icon": "/img/talents/sayu_passive1.png"
        },
        {
          "name": "No Work Today!",
          "description": "The Muji-Muji Daruma created by Yoohoo Art: Mujina Flurry gains the following effects:\nWhen healing a character, it will also heal characters near that healed character for 20% the amount of HP. Increases the AoE of its attack against opponents.",
          "icon": "/img/talents/sayu_passive2.png"
        },
        {
          "name": "Yoohoo Art: Silencer's Secret",
          "description": "When Sayu is in the party, your characters will not startle Crystalflies and certain other animals when getting near them. Check the \"Other\" sub-category of the \"Living Beings / Wildlife\" section in the Archive for creatures this skill works on.",
          "icon": "/img/talents/sayu_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Sethos",
    "talents": {
      "normalAttack": {
        "name": "Royal Reed Archery",
        "description": "Normal Attack\nPerforms up to 3 consecutive shots with a bow. Charged Attack\nPerforms a more precise Aimed Shot with increased DMG. While aiming, the power of Electro will accumulate on the arrowhead before the arrow is fired.",
        "icon": "/img/talents/sethos_attack.png"
      },
      "elementalSkill": {
        "name": "Ancient Rite: The Thundering Sands",
        "description": "Gathers the might of thunder, dealing AoE Electro DMG and quickly retreating. If this attack triggers Electro-Charged, Superconduct, Overloaded, Quicken, Aggravate, Hyperbloom, or Electro Swirl reactions, Sethos recovers a certain amount of Elemental Energy. \"The God indwelt Priest, the Magi who turned pits to springs, the singers of the sea of sand still spread their stories.",
        "icon": "/img/talents/sethos_skill.png"
      },
      "elementalBurst": {
        "name": "Secret Rite: Twilight Shadowpiercer",
        "description": "Perform a secret rite, entering the \"Twilight Meditation\" state, during which Sethos's Normal Attacks will be converted into enemy-piercing Dusk Bolts: Deal Electro DMG to opponents in its path, with DMG increased based on Sethos's Elemental Mastery. Sethos cannot perform Aimed Shots while in this state. DMG dealt by Dusk Bolts is considered Charged Attack DMG.",
        "icon": "/img/talents/sethos_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Thoth's Revelation",
          "description": "Displays the location of nearby resources unique to Sumeru on the mini-map.",
          "icon": "/img/talents/sethos_passive1.png"
        },
        {
          "name": "Black Kite's Enigma",
          "description": "When Aiming, the charging time is decreased by 0. 285s based on each point of Sethos's current Elemental Energy. Charging time can be reduced to a minimum of 0.",
          "icon": "/img/talents/sethos_passive2.png"
        },
        {
          "name": "The Sand King's Boon",
          "description": "Sethos gains the \"Scorching Sandshade\" effect, increasing the DMG dealt by Shadowpiercing Shots by 700% of Sethos's Elemental Mastery. The Scorching Sandshade effect will be canceled when any of the following conditions are met:\n5s after a Shadowpiercing Shot first hits an opponent. After 4 Shadowpiercing Shots strike opponents.",
          "icon": "/img/talents/sethos_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Shenhe",
    "talents": {
      "normalAttack": {
        "name": "Dawnstar Piercer",
        "description": "Normal Attack\nPerforms up to five consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/shenhe_attack.png"
      },
      "elementalSkill": {
        "name": "Spring Spirit Summoning",
        "description": "The frosted dew, silvery and dense, shall exorcise all demons. Grants all nearby party members the Icy Quill effect and deals Cryo DMG in different ways based on whether it is {LAYOUT_MOBILE#tapped}{LAYOUT_PC#pressed}{LAYOUT_PS#pressed} or held. Press\nRushes forward together with a Talisman Spirit, dealing Cryo DMG to opponents along the path.",
        "icon": "/img/talents/shenhe_skill.png"
      },
      "elementalBurst": {
        "name": "Divine Maiden's Deliverance",
        "description": "Unleashes the power of the Talisman Spirit, allowing it to roam free in this plane, dealing AoE Cryo DMG. The Talisman Spirit then creates a field that decreases the Cryo RES and Physical RES of opponents within it. It also deals periodic Cryo DMG to opponents within the field.",
        "icon": "/img/talents/shenhe_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Precise Comings and Goings",
          "description": "Gains 25% more rewards when dispatched on a Liyue Expedition for 20 hours.",
          "icon": "/img/talents/shenhe_passive1.png"
        },
        {
          "name": "Deific Embrace",
          "description": "An active character within the field created by Divine Maiden's Deliverance gains 15% Cryo DMG Bonus.",
          "icon": "/img/talents/shenhe_passive2.png"
        },
        {
          "name": "Spirit Communion Seal",
          "description": "After Shenhe uses Spring Spirit Summoning, she will grant all nearby party members the following effects:\n- Press: Elemental Skill and Elemental Burst DMG increased by 15% for 10s. - Hold: Normal, Charged, and Plunging Attack DMG increased by 15% for 15s.",
          "icon": "/img/talents/shenhe_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Shikanoin Heizou",
    "talents": {
      "normalAttack": {
        "name": "Fudou Style Martial Arts",
        "description": "Normal Attack\nPerforms up to 5 fisticuffs empowered by a mighty wind, dealing Anemo DMG. Charged Attack\nConsumes a certain amount of Stamina and performs a sweeping kick that deals Anemo DMG. Plunging Attack\nCalling upon the surging wind, Heizou plunges towards the ground from mid-air, damaging all opponents in his path.",
        "icon": "/img/talents/shikanoin_heizou_attack.png"
      },
      "elementalSkill": {
        "name": "Heartstopper Strike",
        "description": "Press\nWields the swift winds to launch a Heartstopper Strike that deals Anemo DMG. Hold\nCharges energy to unleash an even stronger blow. He will obtain the Declension effect while charging, which will increase the power of the Heartstopper Strike.",
        "icon": "/img/talents/shikanoin_heizou_skill.png"
      },
      "elementalBurst": {
        "name": "Windmuster Kick",
        "description": "Leaps into the air and uses the Fudou Style Vacuum Slugger and kicks his opponent. The Vacuum Slugger will explode upon hit and create an Arresting Windtunnel that pulls in nearby objects and opponents, dealing AoE Anemo DMG. When Vacuum Slugger hits opponents affected by Hydro/Pyro/Cryo/Electro, these opponents will be afflicted with Windmuster Iris.",
        "icon": "/img/talents/shikanoin_heizou_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Paradoxical Practice",
          "description": "When Shikanoin Heizou activates a Swirl reaction while on the field, he will gain 1 Declension stack for Heartstopper Strike. This effect can be triggered once every 0. 1s.",
          "icon": "/img/talents/shikanoin_heizou_passive1.png"
        },
        {
          "name": "Penetrative Reasoning",
          "description": "After Shikanoin Heizou's Heartstopper Strike hits an opponent, increases all party members' (excluding Shikanoin Heizou) Elemental Mastery by 80 for 10s.",
          "icon": "/img/talents/shikanoin_heizou_passive2.png"
        },
        {
          "name": "Pre-Existing Guilt",
          "description": "Decreases sprinting Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/shikanoin_heizou_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Sigewinne",
    "talents": {
      "normalAttack": {
        "name": "Targeted Treatment",
        "description": "Normal Attack\nPerforms up to 3 consecutive attacks. Charged Attack\nPerforms a more precise Aimed Shot with increased DMG. While aiming, the power of Hydro will continually accumulate on the arrow.",
        "icon": "/img/talents/sigewinne_attack.png"
      },
      "elementalSkill": {
        "name": "Rebound Hydrotherapy",
        "description": "Blows a Bolstering Bubblebalm that can stimulate blood flow and help patients drift off to sleep using a bubblegun specially made in the Fortress of Meropide. Bolstering Bubblebalms will bounce between nearby opponents, dealing Hydro DMG based on Sigewinne's max HP to opponents it hits. When it bounces, it will restore HP to all nearby party members except Sigewinne herself.",
        "icon": "/img/talents/sigewinne_skill.png"
      },
      "elementalBurst": {
        "name": "Super Saturated Syringing",
        "description": "Takes out a special Fortress of Meropide-made syringe and assault the area in front with waves of kindness and medicine, dealing AoE Hydro DMG based on Sigewinne's max HP. In addition, Sigewinne absorbs up to 2 nearby Sourcewater Droplets within a certain range when she uses this skill. \"Hey, overdosing on medicine is no different from poison, you know, it's real dangerous! But patients need care and concern, and nobody can overdose on that!\".",
        "icon": "/img/talents/sigewinne_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Emergency Dose",
          "description": "While underwater, heal your active character over 2. 5s when their HP falls under 50%. The amount healed is equal to 50% of their Max HP, and their All Elemental and Physical RES will be decreased by 10% for 10s.",
          "icon": "/img/talents/sigewinne_passive1.png"
        },
        {
          "name": "Requires Appropriate Rest",
          "description": "Sigewinne grants herself the \"Semi-Strict Bedrest\" effect for 18s after using Rebound Hydrotherapy: Sigewinne gains an 8% Hydro DMG Bonus and 10 stacks of Convalescence. When the Elemental Skills of your nearby off-field party members other than Sigewinne deal DMG, consume 1 stack of Convalescence, and increase the DMG dealt by this instance of Elemental Skill DMG. Every 1,000 Max HP Sigewinne has above 30,000 increases the DMG by 80.",
          "icon": "/img/talents/sigewinne_passive2.png"
        },
        {
          "name": "Detailed Diagnosis, Thorough Treatment",
          "description": "When Sigewinne performs healing, the amount healed for this instance is increased based on the total current value of the Bonds of Life on all party members: For each 1,000 HP worth of Bonds of Life, the outgoing healing is increased by 3%. The amount of healing provided can be increased by up to 30% in this way.",
          "icon": "/img/talents/sigewinne_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Sucrose",
    "talents": {
      "normalAttack": {
        "name": "Wind Spirit Creation",
        "description": "Normal Attack\nPerforms up to 4 attacks using Wind Spirits, dealing Anemo DMG. Charged Attack\nConsumes a certain amount of Stamina and deals AoE Anemo DMG after a short casting time. Plunging Attack\nCalling upon the power of her Wind Spirits, Sucrose plunges towards the ground from mid-air, damaging all enemies in her path.",
        "icon": "/img/talents/sucrose_attack.png"
      },
      "elementalSkill": {
        "name": "Astable Anemohypostasis Creation - 6308",
        "description": "Creates a small Wind Spirit that deals Anemo DMG to enemies in an AoE, pulling them towards the location of the Wind Spirit before launching them.",
        "icon": "/img/talents/sucrose_skill.png"
      },
      "elementalBurst": {
        "name": "Forbidden Creation - Isomer 75 / Type II",
        "description": "Sucrose hurls an unstable concoction that creates a Large Wind Spirit. While it persists, the Large Wind Spirit will continuously pull and launch nearby enemies, dealing AoE Anemo DMG. Elemental Absorption\nIf the Wind Spirit comes into contact with Hydro / Pyro / Cryo / Electro elements, it will deal additional DMG of that type.",
        "icon": "/img/talents/sucrose_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Catalyst Conversion",
          "description": "When Sucrose triggers a Swirl effect, characters in the party with the matching element have their Elemental Mastery increased by 50 for 8s.",
          "icon": "/img/talents/sucrose_passive1.png"
        },
        {
          "name": "Mollis Favonius",
          "description": "When Astable Anemohypostatis Creation - 6308 or Forbidden Creation - Isomer 75 / Type II hit an enemy, increases other party member's Elemental Mastery based on 20% of Sucrose's Elemental Mastery for 8s.",
          "icon": "/img/talents/sucrose_passive2.png"
        },
        {
          "name": "Astable Invention",
          "description": "When Sucrose crafts Character and Weapon Enhancement Materials, she has a 10% to obtain double the product.",
          "icon": "/img/talents/sucrose_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Tartaglia",
    "talents": {
      "normalAttack": {
        "name": "Cutting Torrent",
        "description": "Normal Attack\nPerforms up to 6 consecutive shots with a bow. Charged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, the power of Hydro will accumulate on the arrowhead.",
        "icon": "/img/talents/tartaglia_attack.png"
      },
      "elementalSkill": {
        "name": "Foul Legacy: Raging Tide",
        "description": "Unleashes a set of weaponry made of pure water, dealing Hydro DMG to surrounding opponents and entering a Melee Stance. In this Stance, Tartaglia's Normal and Charged Attacks change as follows:\nNormal Attack\nPerforms up to 6 consecutive Hydro strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash a cross slash, dealing Hydro DMG.",
        "icon": "/img/talents/tartaglia_skill.png"
      },
      "elementalBurst": {
        "name": "Havor: Obliteration",
        "description": "Performs different attacks based on what stance Tartaglia is in when casting. Ranged Stance: Flash of Havoc\nSwiftly fires a Hydro-imbued magic arrow, dealing AoE Hydro DMG and applying the Riptide status. Returns a portion of its Energy Cost after use.",
        "icon": "/img/talents/tartaglia_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Never Ending",
          "description": "Extends Riptide duration by 8s.",
          "icon": "/img/talents/tartaglia_passive1.png"
        },
        {
          "name": "Sword of Torrents",
          "description": "When Tartaglia is in Foul Legacy: Raging Tide's Melee Stance, or if his Normal and Charged Attacks do CRIT DMG, they will apply the Riptide status effect on the hit enemy.",
          "icon": "/img/talents/tartaglia_passive2.png"
        },
        {
          "name": "Master of Weaponry",
          "description": "Increases your own party member's Normal Attack Level by 1.",
          "icon": "/img/talents/tartaglia_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Thoma",
    "talents": {
      "normalAttack": {
        "name": "Swiftshatter Spear",
        "description": "Normal Attack\nPerforms up to four consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/thoma_attack.png"
      },
      "elementalSkill": {
        "name": "Blazing Blessing",
        "description": "Thoma vaults forward with his polearm and delivers a flame-filled flying kick that deals AoE Pyro DMG, while also summoning a defensive Blazing Barrier. At the moment of casting, Thoma's Elemental Skill applies Pyro to himself. The DMG Absorption of the Blazing Barrier scales off Thoma's Max HP.",
        "icon": "/img/talents/thoma_skill.png"
      },
      "elementalBurst": {
        "name": "Crimson Ooyoroi",
        "description": "Thoma spins his polearm, slicing at his foes with roaring flames that deal AoE Pyro DMG and weave themselves into a Scorching Ooyoroi. Scorching Ooyoroi\nWhile Scorching Ooyoroi is in effect, the active character's Normal Attacks will trigger Fiery Collapse, dealing AoE Pyro DMG and summoning a Blazing Barrier. Fiery Collapse can be triggered once every 1s.",
        "icon": "/img/talents/thoma_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Imbricated Armor",
          "description": "When your current active character obtains or refreshes a Blazing Barrier, this character's Shield Strength will increase by 5% for 6s. This effect can be triggered once every 0. 3 seconds.",
          "icon": "/img/talents/thoma_passive1.png"
        },
        {
          "name": "Flaming Assault",
          "description": "DMG dealt by Crimson Ooyoroi's Fiery Collapse is increased by 2. 2% of Thoma's Max HP.",
          "icon": "/img/talents/thoma_passive2.png"
        },
        {
          "name": "Snap and Swing",
          "description": "When you fish successfully in Inazuma, Thoma's help grants a 20% chance of scoring a double catch.",
          "icon": "/img/talents/thoma_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Tighnari",
    "talents": {
      "normalAttack": {
        "name": "Khanda Barrier-Buster",
        "description": "Normal Attack\nPerform up to 4 consecutive shots with a bow. Charged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, the power of Dendro will accumulate on the arrowhead before the arrow is fired.",
        "icon": "/img/talents/tighnari_attack.png"
      },
      "elementalSkill": {
        "name": "Vijnana-Phala Mine",
        "description": "Tighnari throws a Vijnana Stormheart ahead that deals AoE Dendro DMG, creating a Vijnana-Khanda Field that creates mysterious illusions that taunt opponents and draw their fir\nAdditionally, Tighnari gains the Vijnana Suffusion effect, which will decrease the Wreath Arrow's charging time by 2. 4s. This effect will dissipate once the skill duration ends or after Tighnari has fired 3 Wreath Arrows.",
        "icon": "/img/talents/tighnari_skill.png"
      },
      "elementalBurst": {
        "name": "Fashioner's Tanglevine Shaft",
        "description": "Combines the power of all seeds to fire 6 Tanglevine Shafts that can track opponents and deal Dendro DMG. After they hit, the Tanglevine Shafts will create a secondary wave of Tanglevine Shafts that can also track opponents and deal Dendro DMG on hit. \"Do not seek to escape so easily.",
        "icon": "/img/talents/tighnari_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Keen Sight",
          "description": "After Tighnari fires a Wreath Arrow, his Elemental Mastery is increased by 50 for 4s.",
          "icon": "/img/talents/tighnari_passive1.png"
        },
        {
          "name": "Scholarly Blade",
          "description": "For every point of Elemental Mastery Tighnari possesses, his Charged Attack and Fashioner's Tanglevine Shaft DMG are increased by 0. 06%. The maximum DMG Bonus obtainable this way is 60%.",
          "icon": "/img/talents/tighnari_passive2.png"
        },
        {
          "name": "Encyclopedic Knowledge",
          "description": "Displays the location of nearby resources unique to Sumeru on the mini-map.",
          "icon": "/img/talents/tighnari_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Traveler",
    "talents": {
      "normalAttack": {
        "name": "Foreign Ironwind",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/traveler_attack.png"
      },
      "elementalSkill": {
        "name": "Palm Vortex",
        "description": "Grasping the wind's might, you form a vortex of vacuum in your palm, causing Anemo DMG 6 times in 1. 5 seconds to opponents in front of you. The vacuum vortex explodes when the skill duration ends, causing a greater amount of Anemo DMG over a larger area.",
        "icon": "/img/talents/traveler_skill.png"
      },
      "elementalBurst": {
        "name": "Gust Surge",
        "description": "Guiding the path of the wind currents, you summon a forward-moving tornado that pulls objects and opponents towards itself, dealing Anemo DMG each 0. 5 seconds, 9 times. Elemental Absorption\nIf the vortex comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal 30.",
        "icon": "/img/talents/traveler_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Slitting Wind",
          "description": "The last hit of a Normal Attack combo unleashes a wind blade, dealing 60% of ATK as Anemo DMG to all opponents in its path.",
          "icon": "/img/talents/traveler_passive1.png"
        },
        {
          "name": "Second Wind",
          "description": "Palm Vortex kills regenerate 2% HP for 5s. This effect can only occur once every 5s.",
          "icon": "/img/talents/traveler_passive2.png"
        }
      ]
    }
  },
  {
    "character": "Traveler",
    "talents": {
      "normalAttack": {
        "name": "Foreign Fieldcleaver",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/traveler_attack.png"
      },
      "elementalSkill": {
        "name": "Razorgrass Blade",
        "description": "With a flourish of your blade, you unleash a spray of razor-sharp leaves that go before you and deal Dendro DMG.",
        "icon": "/img/talents/traveler_skill.png"
      },
      "elementalBurst": {
        "name": "Surgent Manifestation",
        "description": "Calling upon the might of the flora all around you, you create a Lea Lotus Lamp. This Lamp will deal continuous Dendro DMG to opponents within its AoE. Lotuslight Transfiguration\nThe Lea Lotus Lamp will undergo the following changes after it comes into contact with Hydro/Electro/Pyro:\nHydro: the Lamp's AoE and the AoE of its atacks are increased.",
        "icon": "/img/talents/traveler_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Verdant Luxury",
          "description": "Every point of Elemental Mastery the Traveler possesses increases the DMG dealt by Razorgrass Blade by 0. 15% and the DMG dealt by Surgent Manifestation by 0. 1%.",
          "icon": "/img/talents/traveler_passive1.png"
        },
        {
          "name": "Verdant Overgrowth",
          "description": "Lea Lotus Lamp will obtain one level of Overflowing Lotuslight every second it is on the field, increasing the Elemental Mastery of active character(s) within its AoE by 6. Overflowing Lotuslight has a maximum of 10 stacks.",
          "icon": "/img/talents/traveler_passive2.png"
        }
      ]
    }
  },
  {
    "character": "Traveler",
    "talents": {
      "normalAttack": {
        "name": "Foreign Thundershock",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/traveler_attack.png"
      },
      "elementalSkill": {
        "name": "Lightning Blade",
        "description": "Unleashes three swift thunder shadows that deal Electro DMG to opponents and leave an Abundance Amulet behind after hitting an opponent. 2 Abundance Amulets can be created initially. Using this skill will reset any Abundance Amulets that were generated.",
        "icon": "/img/talents/traveler_skill.png"
      },
      "elementalBurst": {
        "name": "Bellowing Thunder",
        "description": "You call upon the protection of lightning, knocking nearby opponents back and dealing Electro DMG to them. Lightning Shroud\nWhen your active character's Normal or Charged Attacks hit opponents, they will call Falling Thunder forth, dealing Electro DMG. When Falling Thunder hits opponents, it will regenerate Energy for that character.",
        "icon": "/img/talents/traveler_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Thunderflash",
          "description": "When another nearby character in the party obtains an Abundance Amulet created by Lightning Blade, Lightning Blade's CD is decreased by 1. 5s.",
          "icon": "/img/talents/traveler_passive1.png"
        },
        {
          "name": "Resounding Roar",
          "description": "Increases the Energy Recharge effect granted by Lightning Blade's Abundance Amulet by 10% of the Traveler's Energy Recharge.",
          "icon": "/img/talents/traveler_passive2.png"
        }
      ]
    }
  },
  {
    "character": "Traveler",
    "talents": {
      "normalAttack": {
        "name": "Foreign Rockblade",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/traveler_attack.png"
      },
      "elementalSkill": {
        "name": "Starfell Sword",
        "description": "You disgorge a meteorite from the depths of the earth, dealing AoE Geo DMG. The meteorite is considered a Geo Construct, and can be climbed or used to block attacks. Hold: This skill's positioning may be adjusted.",
        "icon": "/img/talents/traveler_skill.png"
      },
      "elementalBurst": {
        "name": "Wake of Earth",
        "description": "Energizing the Geo elements deep underground, you set off expanding shockwaves. Launches surrounding opponents back and deals AoE Geo DMG. A stone wall is erected at the edges of the shockwave.",
        "icon": "/img/talents/traveler_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Shattered Darkrock",
          "description": "Reduces Starfell Sword's CD by 2s.",
          "icon": "/img/talents/traveler_passive1.png"
        },
        {
          "name": "Frenzied Rockslide",
          "description": "The final hit of a Normal Attack combo triggers a collapse, dealing 60% of ATK as AoE Geo DMG.",
          "icon": "/img/talents/traveler_passive2.png"
        }
      ]
    }
  },
  {
    "character": "Traveler",
    "talents": {
      "normalAttack": {
        "name": "Foreign Stream",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/traveler_attack.png"
      },
      "elementalSkill": {
        "name": "Aquacrest Saber",
        "description": "Unleashes a torrent that can cleanse the world. Press\nSends a Torrent Surge forward that will deal Hydro DMG to opponents it comes into contact with. Hold\nEnter Aiming Mode and constantly fire off Dewdrops in the direction in which you are aiming, dealing Hydro DMG to opponents they hit.",
        "icon": "/img/talents/traveler_skill.png"
      },
      "elementalBurst": {
        "name": "Rising Waters",
        "description": "Unleashes a slow-moving floating bubble that deals continuous Hydro DMG to nearby opponents. You studied the ebb and flow of the tides with Paimon.",
        "icon": "/img/talents/traveler_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Spotless Waters",
          "description": "After the Dewdrop fired by the Hold Mode of the Aquacrest Saber hits an opponent, a Sourcewater Droplet will be generated near to the Traveler. If the Traveler picks it up, they will restore 7% HP. 1 Droplet can be created this way every second, and each use of Aquacrest Saber can create 4 Droplets at most.",
          "icon": "/img/talents/traveler_passive1.png"
        },
        {
          "name": "Clear Waters",
          "description": "If HP has been consumed via Suffusion while using the Hold Mode Aquacrest Saber, the Torrent Surge at the skill's end will deal Bonus DMG equal to 45% of the total HP the Traveler has consumed in this skill use via Suffusion. The maximum DMG Bonus that can be gained this way is 5,000.",
          "icon": "/img/talents/traveler_passive2.png"
        }
      ]
    }
  },
  {
    "character": "Venti",
    "talents": {
      "normalAttack": {
        "name": "Divine Marksmanship",
        "description": "Normal Attack\nPerforms up to 6 consecutive shots with a bow. Charged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, favorable winds will accumulate on the arrowhead.",
        "icon": "/img/talents/venti_attack.png"
      },
      "elementalSkill": {
        "name": "Skyward Sonnet",
        "description": "O wind upon which all hymns and songs fly, bear these earth-walkers up into the sky!\nPress\nSummons a Wind Domain at the enemy's location, dealing AoE Anemo DMG and launching enemies into the air. Hold\nSummons an even larger Wind Domain with Venti as the epicenter, dealing AoE Anemo DMG and launching affected enemies into the air. After unleashing the Hold version of this ability, Venti rides the wind into the air.",
        "icon": "/img/talents/venti_skill.png"
      },
      "elementalBurst": {
        "name": "Wind's Grand Ode",
        "description": "Fires off an arrow made of countless coalesced winds, creating a huge Stormeye that sucks in objects and enemies along its path, dealing continuous Anemo DMG. Elemental Absorption\nIf the Stormeye comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use.",
        "icon": "/img/talents/venti_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Embrace of Winds",
          "description": "Holding Skyward Sonnet creates an upcurrent that lasts for 20s.",
          "icon": "/img/talents/venti_passive1.png"
        },
        {
          "name": "Stormeye",
          "description": "Regenerates 15 Energy for Venti after the effects of Wind's Grand Ode end. If an Elemental Absorption occurred, this also restores 15 Energy to all characters of that corresponding element.",
          "icon": "/img/talents/venti_passive2.png"
        },
        {
          "name": "Windrider",
          "description": "Decreases all party member's gliding Stamina Consumption by 20%.",
          "icon": "/img/talents/venti_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Wanderer",
    "talents": {
      "normalAttack": {
        "name": "Yuuban Meigen",
        "description": "Normal Attack\nPerforms up to 3 attacks using wind blades, dealing Anemo DMG. Charged Attack\nConsumes a certain amount of Stamina, gathers a build up of high wind pressure, and deals AoE Anemo DMG after a short casting time. Plunging Attack\nCalling upon the power of Anemo, the Wanderer plunges towards the ground from mid-air, damaging all opponents in his path.",
        "icon": "/img/talents/wanderer_attack.png"
      },
      "elementalSkill": {
        "name": "Hanega: Song of the Wind",
        "description": "Concentrates the power of the winds to break free from the shackles of the earth, dealing AoE Anemo DMG before leaping into the air and entering the Windfavored state. Windfavored\nThe Wanderer cannot perform Plunging Attacks in this state. When he uses Normal and Charged Attacks, they will be converted into Kuugo: Fushoudan and Kuugo: Toufukai respectively; the DMG they deal and their AoE will be increased, and their DMG will be considered Normal and Charged Attack DMG respectively.",
        "icon": "/img/talents/wanderer_skill.png"
      },
      "elementalBurst": {
        "name": "Kyougen: Five Ceremonial Plays",
        "description": "Compresses the atmosphere into a singlular vacuum that grinds all troubles away, dealing multiple instances of AoE Anemo DMG. If the character is in the Windfavored state due to the skill \"Hanega: Song of the Wind,\" Windfavored state will end after casting.",
        "icon": "/img/talents/wanderer_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Jade-Claimed Flower",
          "description": "If Hanega: Song of the Wind comes into contact with Hydro/Pyro/Cryo/Electro when it is unleashed, this instance of the Windfavored state will obtain buffs according to the contacted element(s):\n- Hydro: Kuugoryoku Point cap increases by 20. - Pyro: ATK increases by 30%. - Cryo: CRIT Rate increases by 20%.",
          "icon": "/img/talents/wanderer_passive1.png"
        },
        {
          "name": "Gales of Reverie",
          "description": "When the Wanderer hits opponents with Kuugo: Fushoudan or Kuugo: Toufukai in his Windfavored state, he has a 16% chance to obtain the Descent effect: The next time the Wanderer accelerates in mid-air while in this instance of the Windfavored state, this effect will be removed, this acceleration instance will not consume any Kuugoryoku Points, and he will fire off 4 wind arrows that deal 35% of his ATK as Anemo DMG each. For each Kuugo: Fushoudan and Kuugo: Toufukai that does not produce this effect, the next attack of those types will have a 12% increased chance of producing it. The calculation of the effect production is done once every 0.",
          "icon": "/img/talents/wanderer_passive2.png"
        },
        {
          "name": "Strum the Swirling Winds",
          "description": "Mora expended when ascending Bows and Catalysts is decreased by 50%.",
          "icon": "/img/talents/wanderer_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Wriothesley",
    "talents": {
      "normalAttack": {
        "name": "Forceful Fists of Frost",
        "description": "Normal Attack\nCoalescing frost about his fist, Wriothesley will unleash powerful Repelling Fists, performing up to 5 rapid attacks that deal Cryo DMG. Apart from this, Normal Attack combo count will not reset for a short time after using Icefang Rush or sprinting. Charged Attack\nConsumes a fixed amount of Stamina to leap and unleash a Vaulting Fist, dealing AoE Cryo DMG.",
        "icon": "/img/talents/wriothesley_attack.png"
      },
      "elementalSkill": {
        "name": "Icefang Rush",
        "description": "Adjusting his breathing, rhythm, and pace, Wriothesley sprints forward a short distance, entering the Chilling Penalty state and unleashing more powerful attacks than before. Chilling Penalty\nIncreases Wriothesley's interruption resistance\nWhen his HP is above 50%, it will enhance the Repelling Fists of Normal Attack: Forceful Fists of Frost and increase its DMG. When such an attack hits, it will consume a fixed amount of Wriothesley's HP.",
        "icon": "/img/talents/wriothesley_skill.png"
      },
      "elementalBurst": {
        "name": "Darkgold Wolfbite",
        "description": "Activating his boxing gloves, Wriothesley strikes out with an icy straight, then uses Icicle Impact to cause multiple instances of AoE Cryo DMG in a frontal area. Arkhe: Ousia\nAfter Icicle Impact ends, a Surging Blade will descend upon the opponent's position, dealing Ousia-aligned Cryo DMG. There are some things that even the Duke of the Fortress of Meropide can do little about â€” for example, complicated paperwork, the trivialities of a supervisor, or even.",
        "icon": "/img/talents/wriothesley_burst.png"
      },
      "passiveTalents": [
        {
          "name": "The Duke's Grace",
          "description": "When Wriothesley crafts Weapon Ascension Materials, he has a 10% chance to receive double the product.",
          "icon": "/img/talents/wriothesley_passive1.png"
        },
        {
          "name": "There Shall Be a Plea for Justice",
          "description": "When Wriothesley's HP is less than 60%, he will obtain a Gracious Rebuke. The next Charged Attack of his Normal Attack: Forceful Fists of Frost will be enhanced to become Rebuke: Vaulting Fist. It will not consume Stamina, will deal 50% increased DMG, and after hitting will restore HP for Wriothesley equal to 30% of his Max HP.",
          "icon": "/img/talents/wriothesley_passive2.png"
        },
        {
          "name": "There Shall Be a Reckoning for Sin",
          "description": "When Wriothesley's current HP increases or decreases, if he is in the Chilling Penalty state conferred by Icefang Rush, Chilling Penalty will gain one stack of Prosecution Edict. Max 5 stacks. Each stack will increase Wriothesley's ATK by 6%.",
          "icon": "/img/talents/wriothesley_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Xiangling",
    "talents": {
      "normalAttack": {
        "name": "Dough-Fu",
        "description": "Normal Attack\nPerforms up to 5 consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/xiangling_attack.png"
      },
      "elementalSkill": {
        "name": "Guoba Attack",
        "description": "Summons Guoba the Panda. Guoba continuously breathes fire, dealing AoE Pyro DMG.",
        "icon": "/img/talents/xiangling_skill.png"
      },
      "elementalBurst": {
        "name": "Pyronado",
        "description": "Displaying her mastery over both fire and polearms, Xiangling sends a Pyronado whirling around her. The Pyronado will move with your character for so long as the ability persists, dealing Pyro DMG to all enemies in its path.",
        "icon": "/img/talents/xiangling_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Crossfire",
          "description": "Increases the flame range of Guoba by 20%.",
          "icon": "/img/talents/xiangling_passive1.png"
        },
        {
          "name": "Beware, It's Super Hot!",
          "description": "When Guoba Attack's effect ends, Guoba leaves a chili pepper on the spot where it disappeared. Picking up a chili pepper increases ATK by 10% for 10s.",
          "icon": "/img/talents/xiangling_passive2.png"
        },
        {
          "name": "Chef de Cuisine",
          "description": "When Xiangling cooks an ATK-boosting dish perfectly, she has a 12% chance to receive double the product.",
          "icon": "/img/talents/xiangling_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Xianyun",
    "talents": {
      "normalAttack": {
        "name": "Word of Wind and Flower",
        "description": "Normal Attack\nSummons swirling winds to perform up to 4 attacks, dealing Anemo DMG. Charged Attack\nConsumes a certain amount of Stamina and launches a Breeze Bolt in a straight line that deals Anemo DMG to opponents along its path. Plunging Attack\nGathers the power of Anemo and plunges towards the ground from mid-air, damaging all opponents in her path.",
        "icon": "/img/talents/xianyun_attack.png"
      },
      "elementalSkill": {
        "name": "White Clouds at Dawn",
        "description": "Xianyun enters the Cloud Transmogrification state, in which she will not take Fall DMG, and uses Skyladder once. In this state, her Plunging Attack will be converted into Driftcloud Wave instead, which deals AoE Anemo DMG and ends the Cloud Transmogrification state. This DMG is considered Plunging Attack DMG.",
        "icon": "/img/talents/xianyun_skill.png"
      },
      "elementalBurst": {
        "name": "Stars Gather at Dusk",
        "description": "Brings forth a sacred breeze that deals AoE Anemo DMG and heals all nearby characters based on Xianyun's ATK. It will also summon the \"Starwicker\" mechanism. Starwicker\nContinuously follows the active character and periodically heals all nearby characters based on Xianyun's ATK.",
        "icon": "/img/talents/xianyun_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Galefeather Pursuit",
          "description": "Each opponent hit by Driftcloud Waves from White Clouds at Dawn will grant all nearby party members 1 stack of Storm Pinion for 20s. Max 4 stacks. These will cause the characters' Plunging Attack CRIT Rate to increase by 4%/6%/8%/10% respectively.",
          "icon": "/img/talents/xianyun_passive1.png"
        },
        {
          "name": "Consider, the Adeptus in Her Realm",
          "description": "When the Starwicker created by Stars Gather at Dusk has Adeptal Assistance stacks, nearby active characters' Plunging Attack shockwave DMG will be increased by 200% of Xianyun's ATK. The maximum DMG increase that can be achieved this way is 9,000. Each Plunging Attack shockwave DMG instance can only apply this increased DMG effect to a single opponent.",
          "icon": "/img/talents/xianyun_passive2.png"
        },
        {
          "name": "Crane Form",
          "description": "Increases gliding SPD for your own party members by 15%. Not stackable with Passive Talents that provide the exact same effects.",
          "icon": "/img/talents/xianyun_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Xiao",
    "talents": {
      "normalAttack": {
        "name": "Whirlwind Thrust",
        "description": "Normal Attack\nPerform up to 6 rapid strikes. Charged Attack\nDive down and impact the ground, causing damage relative to the falling height. Can only be triggered in mid-air.",
        "icon": "/img/talents/xiao_attack.png"
      },
      "elementalSkill": {
        "name": "Lemniscatic Wind Cycling",
        "description": "He lunges forward, dealing Anemo DMG to enemies along the path. Can be used in mid-air. Has 2 charges to begin with.",
        "icon": "/img/talents/xiao_skill.png"
      },
      "elementalBurst": {
        "name": "Bane of All Evil",
        "description": "Takes on the form of the yaksha that terrified both demons and archons alike millennia ago. For its duration, increases Xiao's attack range and DMG, while converting damage type to Anemo and enhancing Xiao's jumping ability. Maintaining this form continuously drains Xiao's HP.",
        "icon": "/img/talents/xiao_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Evil Conqueror - Tamer of Demons",
          "description": "Starting Bane of All Evil increases Xiao's DMG by 5%. After this, Xiao's DMG continues to increase by 5% every 3s until the skill ends. Max 25% increase.",
          "icon": "/img/talents/xiao_passive1.png"
        },
        {
          "name": "Dissolution Eon - Heaven Fall",
          "description": "When Lemniscatic Wind Cycling is used, increases all subsequent Lemniscatic Wind Cycling's DMG by 10% for 6s. Max 3 stacks. Duration refreshes with new stacks.",
          "icon": "/img/talents/xiao_passive2.png"
        },
        {
          "name": "Transcension - Gravity Defier",
          "description": "Decreases all party member's falling DMG by 30%. The greatest effect out of all Talents of the same type prevails.",
          "icon": "/img/talents/xiao_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Xingqiu",
    "talents": {
      "normalAttack": {
        "name": "Guhua Style",
        "description": "Normal Attack\nPerforms up to 5 rapid strikes. Charged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes. Plunging Attack\nPlunges from mid-aur to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/xingqiu_attack.png"
      },
      "elementalSkill": {
        "name": "Guhua Sword - Fatal Rainscreen",
        "description": "Xingqiu performs twin strikes with his sword, dealing Hydro DMG. At the same time, this ability creates the maximum number of Rain Swords, which will orbit the character. The Rain Swords have the following properties:\n\nWhen a character takes DMG, the Rain Sword will shatter, reducing the amount of DMG taken.",
        "icon": "/img/talents/xingqiu_skill.png"
      },
      "elementalBurst": {
        "name": "Guhua Sword - Raincutter",
        "description": "Initiate Rainbow Bladework and fight using an illusory sword rain, while creating the maximum number of Rain Swords. Rainbow Bladework\n\nNormal Attacks will trigger consecutive sword rain attacks, dealing Hydro DMG. Rain Swords will remain at the maximum number throughout the ability's duration.",
        "icon": "/img/talents/xingqiu_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Hydropathic",
          "description": "When a Rain Sword is shattered or when its duration expires, it regenerates the current character's HP based on 6% of Xingqiu's Max HP.",
          "icon": "/img/talents/xingqiu_passive1.png"
        },
        {
          "name": "Blades Amidst Raindrops",
          "description": "Xingqiu gains a 20% Hydro DMG Bonus.",
          "icon": "/img/talents/xingqiu_passive2.png"
        },
        {
          "name": "Flash of Genius",
          "description": "When Xingqiu crafts Character Talent Materials, he has a 25% chance to refund a portion of the crafting materials used.",
          "icon": "/img/talents/xingqiu_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Xinyan",
    "talents": {
      "normalAttack": {
        "name": "Dance on Fire",
        "description": "Normal Attack\nPerforms up to 4 consecutive strikes. Charged Attack\nDrains Stamina over time to perform continuous spinning attacks against all nearby enemies. At the end of the sequence, perform a more powerful slash.",
        "icon": "/img/talents/xinyan_attack.png"
      },
      "elementalSkill": {
        "name": "Sweeping Fervor",
        "description": "Xinyan brandishes her instrument, dealing Pyro DMG on nearby enemies, forming a shield made out of her audience's passion. The shield's DMG Absorption scales based on Xinyan's DEF and on the number of enemies hit. Hitting 0-1 enemies grants Shield Level 1: Ad Lib.",
        "icon": "/img/talents/xinyan_skill.png"
      },
      "elementalBurst": {
        "name": "Riff Revolution",
        "description": "Strumming rapidly, Xinyan launches nearby enemies and deals Physical DMG to them, hyping up the crowd. The sheer intensity of the atmosphere will cause explosions that deal Pyro DMG to nearby enemies.",
        "icon": "/img/talents/xinyan_burst.png"
      },
      "passiveTalents": [
        {
          "name": "\"The Show Goes On, Even Without an Audience...\"",
          "description": "Decreases the number of enemies Sweeping Fervor must hit to trigger each level of shielding. Shield Level 2: Lead-In requirement reduced to 1 enemy hit. Shield Level 3: Rave requirement reduced to 2 enemies hit or more.",
          "icon": "/img/talents/xinyan_passive1.png"
        },
        {
          "name": "\"...Now That's Rock 'N' Roll!\"",
          "description": "Characters shielded by Sweeping Fervor deal 15% increased Physical DMG.",
          "icon": "/img/talents/xinyan_passive2.png"
        },
        {
          "name": "A Rad Recipe",
          "description": "When a Perfect Cooking is achieved on an DEF-boosting dish, Xinyan has a 12% chance to obtain double the product.",
          "icon": "/img/talents/xinyan_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yae-miko",
    "talents": {
      "normalAttack": {
        "name": "Spiritfox Sin-Eater",
        "description": "Normal Attack\nSummons forth kitsune spirits, initiating a maximum of 3 attacks that deal Electro DMG\nCharged Attack\nConsumes a certain amount of Stamina to deal AoE Electro DMG after a short casting time. Plunging Attack\nPlunges towards the ground from mid-air, damaging all opponents in her path with thunderous might. Deals AoE Electro DMG upon impact with the ground.",
        "icon": "/img/talents/yae-miko_attack.png"
      },
      "elementalSkill": {
        "name": "Yakan Evocation: Sesshou Sakura",
        "description": "To Yae, such dull tasks as can be accomplished by driving spirits out need not be done personally. Moves swiftly, leaving a Sesshou Sakura behind. Sesshou Sakura Has the following properties:\nPeriodically strikes one nearby opponent with lightning, dealing Electro DMG.",
        "icon": "/img/talents/yae-miko_skill.png"
      },
      "elementalBurst": {
        "name": "Great Secret Art: Tenko Kenshin",
        "description": "Legends of 'kitsunetsuki,' or the manifestation of a kitsune's might, are common in Inazuma's folktales. One that particularly captures the imagination is that of the Sky Kitsune, said to cause lightning to fall down upon the foes of the Grand Narukami Shrine. Summons a lightning strike, dealing AoE Electro DMG.",
        "icon": "/img/talents/yae-miko_burst.png"
      },
      "passiveTalents": [
        {
          "name": "The Shrine's Sacred Shade",
          "description": "When casting Great Secret Art: Tenko Kenshin, each Sesshou Sakura destroyed resets the cooldown for 1 charge of Yakan Evocation: Sesshou Sakura.",
          "icon": "/img/talents/yae-miko_passive1.png"
        },
        {
          "name": "Enlightened Blessing",
          "description": "Every point of Elemental Mastery Yae Miko possesses will increase Sesshou Sakura DMG by 0. 15%.",
          "icon": "/img/talents/yae-miko_passive2.png"
        },
        {
          "name": "Meditations of a Yako",
          "description": "Has a 25% chance to get 1 regional Character Talent Material (base material excluded) when crafting. The rarity is that of the base material.",
          "icon": "/img/talents/yae-miko_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yanfei",
    "talents": {
      "normalAttack": {
        "name": "Seal of Approval",
        "description": "Normal Attack\nShoots fireballs that deal up to three counts of Pyro DMG. When Yanfei's Normal Attacks hit enemies, they will grant her a single Scarlet Seal. Yanfei may possess a maximum of 3 Scarlet Seals, and each time this effect is triggered, the duration of currently possessed Scarlet Seals will refresh.",
        "icon": "/img/talents/yanfei_attack.png"
      },
      "elementalSkill": {
        "name": "Signed Edict",
        "description": "Summons blistering flames that deal AoE Pyro DMG. If this attack hits an enemy, Yanfei is granted the maximum number of Scarlet Seals.",
        "icon": "/img/talents/yanfei_skill.png"
      },
      "elementalBurst": {
        "name": "Done Deal",
        "description": "Triggers a spray of intense flames that rush at nearby opponents, dealing AoE Pyro DMG, granting Yanfei the maximum number of Scarlet Seals, and applying Brilliance to her. Brilliance\nPerodically grants Yanfei a Scarlet Seal. Increases the DMG of her Charged Attacks.",
        "icon": "/img/talents/yanfei_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Proviso",
          "description": "When Yanfei consumes Scarlet Seals by using a Charged Attack, each Scarlet Seal will increase Yanfei's Pyro DMG Bonus by 5%. This effect lasts for 6s. When a Charged Attack is used again during the effect's duration, it will dispel the previous effect.",
          "icon": "/img/talents/yanfei_passive1.png"
        },
        {
          "name": "Blazing Eye",
          "description": "When Yanfei's Charged Attack deals a CRIT Hit to opponents, she will deal an additional instance of AoE Pyro DMG equal to 80% of her ATK. This DMG counts as Charged Attack DMG.",
          "icon": "/img/talents/yanfei_passive2.png"
        },
        {
          "name": "Encyclopedic Expertise",
          "description": "Displays the location of nearby resources unique to Liyue on the mini-map.",
          "icon": "/img/talents/yanfei_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yaoyao",
    "talents": {
      "normalAttack": {
        "name": "Toss 'N' Turn Spear",
        "description": "Normal Attack\nPerforms up to 4 consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/yaoyao_attack.png"
      },
      "elementalSkill": {
        "name": "Raphanus Sky Cluster",
        "description": "Calls upon â€œYuegui: Throwing Mode,â€ a special device created by a certain adeptus to help Yaoyao solve her problems. This skill will be used differently in Holding Mode. Hold\nEnters Aiming Mode to adjust the throw direction.",
        "icon": "/img/talents/yaoyao_skill.png"
      },
      "elementalBurst": {
        "name": "Moonjade Descent",
        "description": "At the enjoinment of a certain adeptus, Yueguiâ€™s full potential can be unleashed in an emergency, dealing Dendro DMG to nearby opponents and entering an (in some sense) unsurpassed Adeptal Legacy state. Adeptal Legacy\nÂ·White Jade Radishes generated will be changed to heal and deal DMG according to this skill. Explosions will heal all nearby party members, and the Dendro DMG that they deal will be viewed as Elemental Burst DMG instead.",
        "icon": "/img/talents/yaoyao_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Tailing on Tiptoes",
          "description": "When Yaoyao is in the party, your characters will not startle Crystalflies and certain other animals when getting near them.",
          "icon": "/img/talents/yaoyao_passive1.png"
        },
        {
          "name": "Starscatter",
          "description": "While affected by the Adeptal Legacy state caused by Moonjade Descent, Yaoyao will constantly throw White Jade Radishes at nearby opponents when she is sprinting, jumping, or running. She can throw 1 White Jade Radish this way once every 0. 6s.",
          "icon": "/img/talents/yaoyao_passive2.png"
        },
        {
          "name": "In Others' Shoes",
          "description": "When White Jade Radishes explode, active characters within their AoE will regain HP every 1s based on 0. 8% of Yaoyaoâ€™s Max HP. This effect lasts 5s.",
          "icon": "/img/talents/yaoyao_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yelan",
    "talents": {
      "normalAttack": {
        "name": "Stealthy Bowshot",
        "description": "Normal Attack\nPerforms up to 4 consecutive shots with a bow. Charged Attack\nPerform a more precise Aimed Shot with increased DMG. While aiming, flowing water will accumulate on the arrowhead.",
        "icon": "/img/talents/yelan_attack.png"
      },
      "elementalSkill": {
        "name": "Lingering Lifeline",
        "description": "Fires off a Lifeline that allows her to move rapidly, entangling and marking opponents along its path. When this rapid movement ends, the Lifeline will explode, dealing Hydro DMG to the marked opponents based on Yelan's Max HP. Tap\nMoves a certain distance forward swiftly.",
        "icon": "/img/talents/yelan_skill.png"
      },
      "elementalBurst": {
        "name": "Depth-Clarion Dice",
        "description": "Deals AoE Hydro DMG and creates an \"Exquisite Throw,\" which aids her in battle. Exquisite Throw\nFollows the character around and will initiate a coordinated attack under the following circumstances, dealing Hydro DMG based on Yelan's Max HP:\n* Can occur once every second when your active character uses a Normal Attack. * Will occur each time Yelan's Lifeline explodes and hits opponents.",
        "icon": "/img/talents/yelan_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Turn Control",
          "description": "When the party has 1/2/3/4 Elemental Types, Yelan's Max HP is increased by 6%/12%/18%/30%.",
          "icon": "/img/talents/yelan_passive1.png"
        },
        {
          "name": "Adapt With Ease",
          "description": "So long as an \"Exquisite Throw,\" is in play, your own active character deals 1% more DMG. This increases by a further 3. 5% DMG every second.",
          "icon": "/img/talents/yelan_passive2.png"
        },
        {
          "name": "Necessary Calculation",
          "description": "Gains 25% more rewards when dispatched on a Liyue Expedition for 20 hours.",
          "icon": "/img/talents/yelan_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yoimiya",
    "talents": {
      "normalAttack": {
        "name": "Firework Flare-Up",
        "description": "Normal Attack:\nPerforms up to 5 consecutive shots with a bow. Charged Attack:\nPerform a more precise Aimed Shot with increased DMG. While aiming, flames will accumulate on the arrowhead before being fired off as an attack.",
        "icon": "/img/talents/yoimiya_attack.png"
      },
      "elementalSkill": {
        "name": "Niwabi Fire-Dance",
        "description": "Yoimiya waves a sparkler and causes a ring of saltpeter to surround her. Niwabi Enshou: During this time, arrows fired by Yoimiya's Normal Attack will be Blazing Arrows, and their DMG will be increased and converted to Pyro DMG. during this time, Firework Flare-Up will not generate Kindling Arrows at Charge Level 2.",
        "icon": "/img/talents/yoimiya_skill.png"
      },
      "elementalBurst": {
        "name": "Ryuukin Saxifrage",
        "description": "Yoimiya leaps into the air along with her original creation, the \"Ryuukin Saxifrage,\" and fires forth blazing rockets bursting with surprises that deal AoE Pyro DMG and mark one of the hit opponents with Aurous Blaze. Aurous Blaze: All Normal/Charged/Plunging Attacks, Elemental Skills, and Elemental Bursts by any party member other than Yoimiya that hit an opponent marked by Aurous Blaze will trigger an explosion, dealing AoE Pyro DMG. When an opponent affected by Aurous Blaze is defeated before its duration expires, the effect will pass on to another nearby opponent, who will inherit the remaining duration.",
        "icon": "/img/talents/yoimiya_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Tricks of the Trouble-Maker",
          "description": "During Niwabi Fire-Dance, shots from Yoimiya's Normal Attack will increase her Pyro DMG Bonus by 2% on hit. This effect lasts for 3s and can have a maximum of 10 stacks.",
          "icon": "/img/talents/yoimiya_passive1.png"
        },
        {
          "name": "Summer Night's Dawn",
          "description": "Using Ryuukin Saxifrage causes nearby party members (not including Yoimiya) to gain a 10% ATK increase for 15s. Additionally, a further ATK Bonus will be added on based on the number of \"Tricks of the Trouble-Maker\" stacks Yoimiya possesses when using Ryuukin Saxifrage. Each stack increases this ATK Bonus by 1%.",
          "icon": "/img/talents/yoimiya_passive2.png"
        },
        {
          "name": "Blazing Match",
          "description": "When Yoimiya crafts Decoration, Ornament, and Landscape-type Furnishings, she has a 100% chance to refund a portion of the materials used.",
          "icon": "/img/talents/yoimiya_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Yun Jin",
    "talents": {
      "normalAttack": {
        "name": "Cloud-Grazing Strike",
        "description": "Normal Attack\nPerforms up to 5 consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact.",
        "icon": "/img/talents/yun_jin_attack.png"
      },
      "elementalSkill": {
        "name": "Opening Flourish",
        "description": "Press\nFlourishes her polearm in a cloud-grasping stance, dealing Geo DMG. Hold\nTakes up the Opening Flourish stance and charges up, forming a shield. DMG Absorption is based on Yun Jin's Max HP and has 150% effectiveness against all Elemental DMG and Physical DMG.",
        "icon": "/img/talents/yun_jin_skill.png"
      },
      "elementalBurst": {
        "name": "Cliffbreaker's Banner'",
        "description": "Deals AoE Geo DMG and grants all nearby party members a Flying Cloud Flag Formation. Flying Cloud Flag Formation\nWhen Normal Attack DMG is dealt to opponents, Bonus DMG will be dealt based on Yun Jin's current DEF. The effects of this skill will be cleared after a set duration or after being triggered a specific number of times.",
        "icon": "/img/talents/yun_jin_burst.png"
      },
      "passiveTalents": [
        {
          "name": "Light Nourishment",
          "description": "When Perfect Cooking is achieved on Food with Adventure-related effects, there is a 12% chance to obtain double the product.",
          "icon": "/img/talents/yun_jin_passive1.png"
        },
        {
          "name": "True to Oneself",
          "description": "Using Opening Flourish at the precise moment when Yun Jin is attacked will unleash its Level 2 Charged (Hold) form.",
          "icon": "/img/talents/yun_jin_passive2.png"
        },
        {
          "name": "Breaking Conventions",
          "description": "The Normal Attack DMG Bonus granted by Flying Cloud Flag Formation is further increased by 2. 5%/5%/7. 5%/11.",
          "icon": "/img/talents/yun_jin_passive3.png"
        }
      ]
    }
  },
  {
    "character": "Zhongli",
    "talents": {
      "normalAttack": {
        "name": "Rain of Stone",
        "icon": "/img/talents/zhongli_attack.png",
        "description": "Normal Attack\nPerforms up to 6 consecutive spear strikes. Charged Attack\nConsumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way. Plunging Attack\nPlunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact."
      },
      "elementalSkill": {
        "name": "Dominus Lapidis",
        "icon": "/img/talents/zhongli_skill.png",
        "description": "Press\nCommands the omnipresent power of earth to solidify into a Stone Stele, dealing AoE Geo DMG. Additionally, the Stone Stele will resonate with other Geo Constructs in the vicinity, dealing Geo DMG to surrounding enemies. The Stone Stele is considered a Geo Construct, and can both be climbed and used to block attacks."
      },
      "elementalBurst": {
        "name": "Planet Befall",
        "icon": "/img/talents/zhongli_burst.png",
        "description": "Brings a falling meteor down to earth, dealing massive Geo DMG to opponents caught in its AoE and applying the Petrification status to them. Petrification\nOpponents affected by the Petrification status cannot move."
      },
      "passiveTalents": [
        {
          "name": "Resonant Waves",
          "icon": "/img/talents/zhongli_passive1.png",
          "description": "When the Jade Shield takes DMG, it will Fortify:\n\nFortified characters have 5% increased Shield Strength. Can stack up to 5 times, and lasts until the Jade Shield dissapears."
        },
        {
          "name": "Dominance of Earth",
          "icon": "/img/talents/zhongli_passive2.png",
          "description": "Zhongli deals bonus DMG based on his Max HP:\nNormal Attack, Charged Attack, and Plunging Attack DMG is increased by 1. 39% of Max HP. Dominus Lapidis' Stone Stele, resonance, and hold DMG is increased by 1."
        },
        {
          "name": "Arcanum of Crystal",
          "icon": "/img/talents/zhongli_passive3.png",
          "description": "Refunds 15% of the ores used when crafting Polearm-type weapons."
        }
      ]
    }
  },
  {
    "character": "Mavuika",
    "talents": {
      "normalAttack": {
        "name": "Flames Weave Life",
        "icon": "/img/talents/mavuika_attack.png",
        "description": "Normal AttackPerforms up to 4 consecutive claymore strikes. Charged Attack Consumes a certain amount of Stamina to perform an especially powerful Severing Splendor strike toward the front. Plunging Attack Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."
      },
      "elementalSkill": {
        "name": "The Named Moment",
        "icon": "/img/talents/mavuika_skill.png",
        "description": "Calling upon her authority over conflict, Mavuika summons the All-Fire Armaments passed down through the line of human Archons, dealing Nightsoul-aligned Pyro DMGAfter using this, Mavuika's Nightsoul points are restored to max value, and she enters the Nightsoul's Blessing state."
      },
      "elementalBurst": {
        "name": "Hour of Burning Skies",
        "icon": "/img/talents/mavuika_burst.png",
        "description": "When Mavuika has at least 50% Fighting Spirit, she can consume it all to unleash her Elemental Burst."
      },
      "passiveTalents": [
        {
          "name": "Gift of Flaming Flowers",
          "icon": "/img/talents/mavuika_passive1.png",
          "description": "When a nearby party member triggers a Nightsoul Burst, Mavuika's ATK increases by 30% for 10s."
        },
        {
          "name": "Kiongozi",
          "icon": "/img/talents/mavuika_passive2.png",
          "description": "After using her Elemental Burst, Hour of Burning Skies, every point of Fighting Spirit present when it is used increases the DMG that the current active party member deals by 0.2%. The maximum increase obtainable this way is 40%, and this effect lasts 20s, decaying over this duration until it reaches 0."
        },
        {
          "name": "Exhaust Mode",
          "icon": "/img/talents/mavuika_passive3.png",
          "description": "After Nightsoul points have been fully depleted, Mavuika will switch to using Phlogiston to maintain the All-Fire Armaments' Flamestrider form."
        }
      ]
    }
  }
]